import { View, Text, StyleSheet, ScrollView } from 'react-native'
import React from 'react'
import LinearGradient from 'react-native-linear-gradient'

const Abhangrvaishishte = () => {
  return (
    <LinearGradient colors={['#FFF7E6', '#FFECC2']} style={styles.container}>
      <View style={styles.card}>
        <ScrollView
          style={styles.innerScroll}
          showsVerticalScrollIndicator={true}
          contentContainerStyle={{ paddingVertical: 10 }}
        >
          <Text style={styles.text}>
            आरती कामधेनवे | {"\n"}सुरभिया वैष्णवे वोवाळू तुज प्रीती ||{"\n"}
            विश्वरूप नित्य नवे आरती कामधेनवे ||१||{"\n"}{"\n"}
            प्रसन्न वेदमाय | {"\n"}होय विलंब काय गाजवी कीर्ती घोष ||{"\n"}
            हाची प्रसंग होये आरती कामधेनवे | {"\n"}सुरभिया वैष्णवे वोवाळू तुज प्रीती ||{"\n"}
            विश्वरूप नित्य नवे आरती कामधेनवे ||२||{"\n"}{"\n"}
            प्रताप थोर गाजो | {"\n"}नाम सुरभिया साजो | {"\n"} मागणे तुज एक ||{"\n"}
            वर देई विजयी जे आरती कामधेनवे | {"\n"}सुरभिया वैष्णवे वोवाळू तुज प्रीती ||{"\n"}
            विश्वरूप नित्य नवे आरती कामधेनवे ||३||{"\n"}{"\n"}
            विनंती सत्यपणे | {"\n"}द्यावे अभंग देणे प्रसिद्ध त्रिभुवनी कीर्ती होय ||{"\n"}
            तुझी जेणे आरती कामधेनवे | {"\n"}सुरभिया वैष्णवे वोवाळू तुज प्रीती ||{"\n"}
            विश्वरूप नित्य नवे आरती कामधेनवे ||४||{"\n"}{"\n"}
            प्रमाण मागणे हे | {"\n"}तुकाविप्र नाम ध्येये उरवी सत्यपणे ||{"\n"}
            विनवणी सहजे आरती कामधेनवे | {"\n"}सुरभिया वैष्णवे वोवाळू तुज प्रीती ||{"\n"}
            विश्वरूप नित्य नवे आरती कामधेनवे आरती कामधेनवे ||५||
          </Text>
        </ScrollView>
      </View>
    </LinearGradient>
  )
}

export default Abhangrvaishishte

const styles = StyleSheet.create({
  container: {
    flex: 1,
    padding: 16,
    backgroundColor: '#faf9f6',
    alignItems: 'center',
    justifyContent: 'center',
  },
  card: {
    backgroundColor: '#ffffff',
    borderRadius: 12,
    width: '90%',
    elevation: 4,
    shadowColor: '#000',
    shadowOpacity: 0.1,
    shadowRadius: 6,
    shadowOffset: { width: 0, height: 2 },
    height: '100%', // 👈 defines visible scroll area inside card
    overflow: 'hidden', // keep scroll indicator inside
  },
  innerScroll: {
    flex: 1,
  },
  text: {
    fontFamily: 'VesperLibre-Bold',
    fontSize: 18,
    lineHeight: 26,
    color: '#3a2b1e',
    textAlign: 'center',
    paddingHorizontal: 10,
  },
})
