import { View, Text, StyleSheet, ScrollView } from 'react-native'
import React from 'react'
import LinearGradient from 'react-native-linear-gradient'

const Abhangparayan = () => {
  return (
    <LinearGradient colors={['#FFF7E6', '#FFECC2']} style={styles.container}>
      <ScrollView>
        <Text style={styles.text}>प्रत्येक नाम सप्ताह मध्ये गाथा पारायण साठी असलेला वेळ आणि लोकभावना ध्यानात घेत संत तुकाविप्र यांचे निवडक 77 अभंग गाथा पारायण अभंग म्हणून आमच्या दिंडीच्या चालक अर्जुन पाटील यांनी निवडले आहेत. ते या प्रमाणे.</Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>१</Text>
        <Text style={styles.text}>

          धुंडिराजा करु | प्रथम वंदन |{"\n"}दुसरे वंदन | गुरुराया || १ ||{"\n"}
          दत्तात्रेया तुम्हा | साष्टांग नमन । {"\n"}तुकाविप्र लीन | सर्व भावे || २ ||
        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>२</Text>
        <Text style={styles.text}>
          प्रसन्न वदना वेदांत सिद्धांता । {"\n"}वरदान आता तुर्त द्यावे || १ || {"\n"}
          हेता ऐसे तुज पूजावे अभंग | {"\n"}भरोनी सर्वांग प्रेम प्रीती || २ ||{"\n"}
          पूर्ण हेत तेव्हा पूजन ही घडे । {"\n"}विनंती निवाडे खरीखूरी || ३ ||{"\n"}
          तुकाविप्र म्हणे राजयोग नीती । {"\n"}भाव प्रेमा भक्ती सिद्ध व्हावी || ४ ||{"\n"}
        </Text>

        <View style={styles.line}></View>
        <Text style={styles.title}>३</Text>
        <Text style={styles.text}>
          गुरुदेवा विप्रनाथा । {"\n"}मज होय बुद्धीदाता || १  ||{"\n"}
          केली प्रथम चरणी । {"\n"}गुरुराया विनवणी || २ ||{"\n"}
          मति द्यावी जी सबळ । {"\n"}गुरुराज या निर्मळ || ३ ||{"\n"}
          तुकाविप्र म्हणे देवा । {"\n"}गुरुकृपा वर व्हावा || ४ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>४</Text>
        <Text style={styles.text}>
          अवचट नोहे नेमे आलो जन्मा । {"\n"}कीर्तन महिमा कलीमाजी म्हणोनि || १ ||{"\n"}
          आर्व आहे आम्हा शंभर कोटीचे । {"\n"}खर्व या नामाचे संकीर्तन आमुचे || २  ||{"\n"}
          कलयुगासाठी, जन्माची आवडी । {"\n"}पद्म शतकोडी आर्व आम्हा कीर्तन || ३  ||{"\n"}
          देव नाम याची सर्व कथा वार्ता । {"\n"}श्रोता गुरु वक्ता संकीर्तन अभंग || ४  ||{"\n"}
          तुकाविप्र कली आर्व तेचि भागा ।। {"\n"}कीर्तन चिद्गंगा संत गुरु संगती || ५ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>५ </Text>
        <Text style={styles.text}>
          मागु नये काही | देवाही दिकाला । {"\n"}उदर पूर्तिला | कोणे काळी || १ ||{"\n"}
          फिरवावी झोळी | करावा आनंद । {"\n"}देवासी नैवेद्य | सर्वाभूति || २ ||{"\n"}
          गुंतू नये कोठे | इनामा वार्षिका । {"\n"}प्रेमळ भाविका | सूचना हे || ३ ||{"\n"}
          तुकाविप्र एका | झोळीच्या आधारे । {"\n"}कीर्तन गजरे | सर्व काळ || ५ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>६ </Text>
        <Text style={styles.text}>
          आम्ही गर्जत हरी नाम आलो | {"\n"}सुखरूप सहज आता जालो || १ ||{"\n"}
          प्रचिती हे प्रमाण सुचविली | {"\n"}चित्त असावे ते बाप विठ्ठली || २ ||{"\n"}
          ज्ञान गर्व सांडोनी हरी गावा | {"\n"}सत्य लाभ तरीच नीत्य नवा || ३ ||{"\n"}
          सूचना हे प्रचीत जाणोनिया | {"\n"}नासो आळस हरी नाम गाया || ४ ||{"\n"}
          तुकाविप्र आवडी हरी नाम | {"\n"}कलयुगी साधन निरुपम || ५ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>७ </Text>
        <Text style={styles.text}>
          इष्ट नव्हे निष्ठ ऐसे | गुप्त नसे प्रगट || १ ||{"\n"}
          सर्व  काळ दिसे परी | रुप हरि नाकळे || २ ||{"\n"}
          भाव अभाव भावना | संकीर्तनी गुंतली || ३ ||{"\n"}
          तुकाविप्र म्हणे वस्तु | पटी तंतु कापूस || ४ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>८ </Text>
        <Text style={styles.text}>
          उपकारी संतराव । {"\n"}ज्याचा  आज्ञाधारी देव || १ ||{"\n"}
          त्यानी धरियेले हाती | {"\n"}दाखविला रमापति || २ ||{"\n"}
          केले उभे कीर्तनासी । {"\n"}हरि विठ्ठल प्रीतीसी || ३ ||{"\n"}
          तुकाविप्र म्हणे देव । {"\n"}सर्वभावे संतराव || ४ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>९ </Text>
        <Text style={styles.text}>
          उदाराचा राणा हरी। {"\n"}भीमा तीरी तु यक || १ ||{"\n"}
          वीटेवरी उभा धींग । {"\n"}पांडुरंग तु देवा || २ ||{"\n"}
          हेची पाई झळाळीत । {"\n"}माळा संत बिरूद || ३ ||{"\n"}
          तुकाविप्र तुझे भेटी  । {"\n"}ब्रीदासाठी कीर्तनी || ४ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>१० </Text>
        <Text style={styles.text}>
          एकनाथ कृपे आनंत वैष्णव । {"\n"} नामी नित्योछव । {"\n"}हरी गुरू प्रसाद || १ ||{"\n"}
          एकनीष्ट तप सह्याद्रीचे तळी । {"\n"}कृष्णेचीया जळी । {"\n"}वेदवती संगम || २ ||{"\n"}
          तुकाविप्र तया कुळीचा प्रसाद । {"\n"}कीर्तन आनंद । {"\n"}हरी गुरू स्मरण || ३ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>११ </Text>
        <Text style={styles.text}>
          ऐकारे बाप हो | करू नका गूल | {"\n"}स्मरणी विठ्ठल | प्रीती करा || १ ||{"\n"}
          इतर भाषण | तारीना तुम्हासी | {"\n"}न करा वाचेशी | उगा शीण || २ ||{"\n"}
          क्षण भर तरी | स्मरण करावे | {"\n"}शुद्ध भक्ति भावे | श्री हरीचे || ३ ||{"\n"}
          ऐसे वेद श्रुती | शास्त्राचे प्रमाण | {"\n"}श्री हरी स्मरण | सार आहे || ४ ||{"\n"}
          तुकाविप्र म्हणे | ऐकावे आवडी  | {"\n"}कीर्तन हे जोडी  सार एक || ५ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>१२</Text>
        <Text style={styles.text}>
          ऐसे किती याची मऱ्हाष्ट्र देशात | {"\n"}विठोबाचे भक्त निरुपम || १ ||{"\n"}
          देशो देशी भक्त अनंत अपार | {"\n"}विठ्ठल साचार देवाचे या || २ ||{"\n"}
          तुकाराम वाणी कुणबी जातीचा | {"\n"}भक्त विठोबाचा निरुपम || ३ ||{"\n"}
          कान्होबा तयाचा बंधु कीर्तीध्वज | {"\n"}पुत्र  भक्तराज  नारायेण || ४ ||{"\n"}
          तुकाविप्र म्हणे नातू पंतु त्यांचे | {"\n"}भक्त विठोबाचे कुटुंबीत || ५ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>१३ </Text>
        <Text style={styles.text}>
          कीती जपाल धनाला । {"\n"}काही जपा की हीताला || १ ||{"\n"}
          येक येकासी पाहता । {"\n"}धन जोडीसी करीता || २ ||{"\n"}
          त्याच्या गती जाणोनीया । {"\n"}लागा हीता आपुलीया || ३ ||{"\n"}
          तुकाविप्र म्हणे धन । {"\n"}आहे धर्म तो करणे || ४ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>१४ </Text>
        <Text style={styles.text}>
          खेळ टीपरी आनंद । {"\n"}हा गोविंद विजेई || १ ||{"\n"}
          नाच तडातड हारी । {"\n"}या टीपरी खेळता || २ ||{"\n"}
          न जा कोठे येथोनिया । {"\n"}सीणवाया सकळ || ३ ||{"\n"}
          देव खेळाया गूंतला । {"\n"}संत भला संगती || ४ ||{"\n"}
          तुकाविप्र नित्यावळी । {"\n"}देव खेळी आभंग || ५ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>१५ </Text>
        <Text style={styles.text}>
          खळा रोकडे पाझर । {"\n"}ते हे सत्य पंढरपुर || १ ||{"\n"}
          येथे खळत्व राहणे । {"\n"}हेचि पाप दुजे कोणे  || २ ||{"\n"}
          पुण्येवंता तुर्त लाभ । {"\n"}संत संगती स्वयंभ || ३ ||{"\n"}
          कासे गोचीड लागला । {"\n"}दूध चवी काये त्याला || ४||{"\n"}
          तुकावीप्र पंढरीसी । {"\n"}तैसा काये पापरासी || ५ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>१६ </Text>
        <Text style={styles.text}>
          गुरूस्वामी दत्तात्रेय । {"\n"}आम्हा देह दाविले || १ ||{"\n"}
          देह धरावसे जाले । {"\n"}तेंव्हा केले कौतुक || २ ||{"\n"}
          वेडी देहासी निंदिती । {"\n"}तोंडी माती तयाच्या || ३ ||{"\n"}
          देह बोलाचे भांडार । {"\n"}सर्व सार देहचि || ४ ||{"\n"}
          तुकाविप्र देह दृष्टी । {"\n"}सत्य गोष्टी अभंग || ५ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>१७ </Text>
        <Text style={styles.text}>
          गोडी लागलियावरी । {"\n"}सुटे कैसी तया वारी || १ ||{"\n"}
          संत संगे लागे गोडी । {"\n"}तेंव्हा होये सार जोडी || २ ||{"\n"}
          ऐसा लाभ हाता येणे | {"\n"}सत्य सद्गुरूचे देणे || ३ ||{"\n"}
          थोर विश्वास या काजा | {"\n"}त्रिभुवनी कीर्तिध्वजा || ४ ||{"\n"}
          तुकाविप्र म्हणे भोळी । {"\n"}भक्ती लाभची सगळी || ५ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>१८ </Text>
        <Text style={styles.text}>
          घराश्रमी केली | उत्तम रहाटी। {"\n"}धरीयेले कटी | नाम हरी || १ ||{"\n"}
          त्याने केले ऐसे | काही कवतुक । {"\n"}पिकविले सुख | कीर्तनाचे || २ ||{"\n"}
          विप्र पदवीचा | देणे भोगवटा । {"\n"}म्हणोनि वैकुंठा | नेले मज || ३ ||{"\n"}
          तुकाविप्र लिखा | दऊत लेखणी । {"\n"}विठ्ठल स्मरणी | कृष्णातीरी || ४ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>१९ </Text>
        <Text style={styles.text}>
          घरे मोटाली बांधीली । {"\n"}भाग्ये अपार भोगीली || १ ||{"\n"}
          सत्ता मिरवली जगी । {"\n"}मरोनिया गेली उगी || २ ||{"\n"}
          उरविली नाही कीर्ती । {"\n"}संती सांगावया प्रीती || ३ ||{"\n"}
          व्यर्थ सीण केला खरा । {"\n"}नर जिण्याचा मातेरा || ४ ||{"\n"}
          हरी गुरू भक्ती करा । {"\n"}मग कीर्ती कैची काई || ५ ||{"\n"}
          तुकाविप्र म्हणे संत । {"\n"}सभे कीर्ती तोची संत || ६ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>२० </Text>
        <Text style={styles.text}>
          चला विठल दर्शना। {"\n"}चंद्रभागेचीया स्नाना || १ ||{"\n"}
          काला खेळाया पंढरी । {"\n"}देवराया बरोबरी || २ ||{"\n"}
          चला भाविक प्रेमळ । {"\n"}खेळू पंढरी सकळ || ३ ||{"\n"}
          तुकाविप्र म्हणे तूर्त । {"\n"}चाला धरोनि भावार्थ || ४ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>२१ </Text>
        <Text style={styles.text}>
          चंद्रभागे पुंडलीका । {"\n"}भावे नमस्कार येका || १ ||{"\n"}
          प्रिती बहु असो डोळे । {"\n"}भेटी अभंग सोहळे || २ ||{"\n"}
          नित्य आता संध्या स्नान | {"\n"}चंद्रभागे ब्रह्म यज्ञ || ३ ||{"\n"}
          सर्व भावे ब्रह्म कर्म । {"\n"}भूमी वैकुंठी हा नेम || ४ ||{"\n"}
          तुकाविप्र विनवणी । {"\n"}सत्य जोडोनिया पाणी || ५ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>२२ </Text>
        <Text style={styles.text}>
          छैया मय्या पैठणात । {"\n"}जाले गंधर्व कलीत || १ ||{"\n"}
          एकनाथाचे वंशज । {"\n"}मोठे साधु कीर्तीध्वज || २ ||{"\n"}
          निरुपम देखियेले । {"\n"}प्रतिष्ठानी तूर्त काळे || ३ ||{"\n"}
          तुकाविप्र संतोषला । {"\n"}तया पाहोनी संताला || ४ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>२३ </Text>
        <Text style={styles.text}>
          जीव दशा सर्व नाहीसीच केली । {"\n"}आळी भृंगी जाली जैसी तैसी || १ ||{"\n"}
          तनु मात्र आहे दीसाया मानव । {"\n"}गुरुकृपा ठेवा भक्तीसाटी || २ ||{"\n"}
          तुकाविप्र म्हणे देहीच वेगळा | {"\n"}आभंग आगळा ब्रह्म लाभ || ३ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>२४ </Text>
        <Text style={styles.text}>
          जयासी न घडे पंढरीची वारी। {"\n"}जावे ब्रह्मपुरी एकवेळ || १ ||{"\n"}
          मार्गशिर्ष मासी होतो हा उत्सव । {"\n"}जमताती देव सकळीक || २ ||{"\n"}
          अमातिथी पर्व कृष्ण खेळे काला । {"\n"}वाटे भूदेवाला स्वानंदाने || ३ ||{"\n"}
          तुकाविप्र म्हणे सत्य अनुभव । {"\n"}साधु संत सर्व घेती तेथे || ४ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>२५ </Text>
        <Text style={styles.text}>
          त्वरीत मागणे मागतो प्रीती । {"\n"}लाज काय ते साच श्रीपती || १ ||{"\n"}
          सर्व साक्षीया सर्व देखण्या | {"\n"}दे कृपानिधी नाम ते घेण्या || २ ||{"\n"}
          मागणे दुजे आमचे  नसे । {"\n"}ठाऊके तुम्हा सर्वही आसे || ३ ||{"\n"}
          विनवि तुकाविप्र धोंगडी । {"\n"}घाली कीर्तनी श्री हरी उडी || ४ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>२६ </Text>
        <Text style={styles.text}>
          तप सायास न लगे । {"\n"}देव उभा कथा रंगे || १ ||{"\n"}
          सोपा जाला कलीमाजी । {"\n"}उभा कीर्तनी सहजी || २ ||{"\n"}
          बहु तपे न लगती । {"\n"}कथा रंगी भेटी होती || ३ ||{"\n"}
          तुकाविप्र म्हणे हरी । {"\n"}सत्य कीर्तन गजरी || ४ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>२७ </Text>
        <Text style={styles.text}>
          थेंब बहुत मेघाचे | परि एका पाणीयाचे || १ ||{"\n"}
          फळे वृक्षासी अनेक | सर्वामध्ये बीज येक || २ ||{"\n"}
          साखरेचे बहू कण | गोडी सर्व एक पणे || ३ ||{"\n"}
          तैसे जग बहू परी | एक आत्मा सत्य हरी || ४ ||{"\n"}
          तुकाविप्र म्हणे जाणा | ऐशा वेदांतीच्या खुणा || ५ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>२८ </Text>
        <Text style={styles.text}>
          थोडकीया  श्रमे फार लाभ आम्हा  जाला | {"\n"}नाम गर्जताची देव सत्य जगी आला || १ ||{"\n"}
          बोध्य आवतार स्वरूपाचे नीजध्यानी | {"\n"}सावधान होये नित्य नाम संकीर्तनी || २ ||{"\n"}
          तुकाविप्र दैव  भले देव कथे भेटी | {"\n"}सत्य गुरु नित्यनेमे कृपा कर कटी || ३ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>२९ </Text>
        <Text style={styles.text}>
          देव नाही भक्त नाही | संत साधू  सिद्ध नाही || १ ||{"\n"}
          ऐसे कल्पी ज्यांचे मन | नव्हे आत्म त्या दर्शन || २ ||{"\n"}
          ज्याचे मुखी सर्व नास्ति | तया नव्हे आत्म प्राप्ती || ३ ||{"\n"}
          नाही असे जे म्हणती | तया जाणे अधोगती || ४ ||{"\n"}
          तुकाविप्र म्हणे आहे | देव जेथे तेथे देहे || ५ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>३० </Text>
        <Text style={styles.text}>
          देव पाहतो ऐकतो | देव बोलतो चालतो || १ ||{"\n"}
          देव करितो सर्व ही | व्याप बैसोनिया देही || २ ||{"\n"}
          भले मुर्खाचे राव | नाही म्हणताती देव || ३ ||{"\n"}
          ब्रह्मा उत्पत्तीचे अंग | विष्णु प्रतिपाळी जग || ४ ||{"\n"}
          शिव करितो संहार | ऐसा चालतो व्यापार || ५ ||{"\n"}
          तुकाविप्र म्हणे काय | नाही सकळची आहे || ६ ||

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>३१ </Text>
        <Text style={styles.text}>
          देवाजीच्या दासा चिंता | भय तरी काय आता || १ ||{"\n"}
          भय नाही चिंता आंस | सर्व विषयी उदास || २ ||{"\n"}
          ऐसे जातिवंत भोळे | दास देवाचे आगळे || ३ ||{"\n"}
          सर्व काळ सुख रूप | ब्रीद भूषण प्रताप  || ४ ||{"\n"}
          तुकाविप्र देव भक्त | भय चिंते  विरहित || ५ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>३२ </Text>
        <Text style={styles.text}>
          देव भक्त उभयेता । {"\n"}श्रोता वक्ता जाहाले || १ ||{"\n"}
          उभेयता प्रीतीमुळे । {"\n"}हे सोहळे कथेचे || २ || {"\n"}
          भाव भक्ती बळे कथा । {"\n"}उभी सत्ता श्रीहरि || ३ ||{"\n"}
          तुकाविप्र देव भक्ती । {"\n"}कथा युक्ती हरिची || ४ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>३३ </Text>
        <Text style={styles.text}>
          दिन उगवे तो आम्हा । {"\n"}हरी नामा संगती || १ ||{"\n"}
          ऐसी देणे जयालागी । {"\n"}ते या जगी सांगाती || २ |||{"\n"}
          नामी आवडी आसावी । {"\n"}नीत्य नवी आभंग || ३ || {"\n"}
          विनवणी सकळीका | {"\n"}हे भावीका भोळीया || ४ ||{"\n"}
          तुकाविप्र म्हणे हेत । {"\n"}नामी सत्य धरा की || ५ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>३४ </Text>
        <Text style={styles.text}>
          धर्म वासना सर्व सांडली  | {"\n"}जोडुनी धने पुरूनी ठेवीली || १ ||{"\n"}
          जतन राहीली काळ चालीता  । {"\n"}धन्ये मी म्हणे येक जोडता  || २ ||{"\n"}
          काळ फीरता पाडीली घरे । {"\n"}द्रव्य काढीले सर्व ही खरे || ३ ||{"\n"}
          तेधवा रडे चुकलो खरा । {"\n"}नुमजे तुकाविप्र या नरा || ४ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>३५ </Text>
        <Text style={styles.text}>
          धन्य कीर्तन प्रसंग । {"\n"}संत संग कलीत || १ ||{"\n"}
          सार प्रसंग प्रारब्धा । {"\n"}आजी वेदा श्रुतीचा || २ ||{"\n"}
          नाम विठ्ठल कीर्तन । {"\n"}धन्य ध्यान उघडे || ३ ||{"\n"}
          श्रोता वक्ता दोनी भाग । {"\n"}येक अंग लाभासी || ४ ||{"\n"}
          तुकाविप्र म्हणे येक । {"\n"}नाम सुख विठ्ठल || ५ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>३६ </Text>
        <Text style={styles.text}>
          नभ नसे कोणे ठायी । {"\n"}ब्रह्म हें ही ऐसेची || १ ||{"\n"}
          सर्व नभाचिया पोटी । {"\n"}नव्हे तुटी सहसा || २ ||{"\n"}
          येकामाजी येक प्रीती | । {"\n"}ऐसी क्षिती अभंग || ३ ||{"\n"}
          तुकाविप्र म्हणे नभ । {"\n"}हे स्वयंभ सर्वत्री || ४ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>३७ </Text>
        <Text style={styles.text}>
          नाम गर्जना करीत । {"\n"}हारे वेथा भवाची || १ ||{"\n"}
          ऐसे साधन सुगम । {"\n"}हारी नाम कलीत || २ ||{"\n"}
          सर्व प्रकारे साधन । {"\n"}नाम धन्ये हारीचे || ३ || {"\n"}
          जाण आत्मनी  जाहाले । {"\n"}ते लागले भजेना || ४ ||{"\n"}
          तुकाविप्र म्हणे सार । {"\n"}कथा थोर हारीची || ५ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>३८ </Text>
        <Text style={styles.text}>
          नारायेण आदी कृपे आत्रीनाथ। {"\n"}सुकृते समर्थे । {"\n"}आनसूये सतीची  || १ ||{"\n"}
          तीनी देव येक रूपे जये पोटी । {"\n"}आंनतशा कोटी । {"\n"}सुक्रुताच्या आभंग  || २ ||{"\n"}
          तुकाविप्र तथा प्रसादे कलीत । {"\n"}कीर्तनी वनात । {"\n"}घनानंद विठ्ठल  || ३ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>३९ </Text>
        <Text style={styles.text}>
          नाम विठल आगळे । {"\n"}तारू त्रिजगा सगळे || १ ||{"\n"}
          ऐसे दिसेना दुसरे । {"\n"}जड जीवा तारू खरे || २ ||{"\n"}
          हरी विठल हा मंत्र । {"\n"}सर्वा पावन पवित्र || ३ ||{"\n"}
          नेघे तो एक नाडला । {"\n"}जेन्मा नाही तैसा आला || ४ ||{"\n"}
          तुकाविप्र म्हणे हरी । {"\n"}वदो विठल वैखरी || ५ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>४० </Text>
        <Text style={styles.text}>
          टीपरी खेळता विठल आठवा । {"\n"}आभंग लावा ध्वजा की || १ ||{"\n"}
          नमन तुमच्या चेरण कमळा | {"\n"}टीपरी बाळा कृष्णाची || २ ||{"\n"}
          वेदांत जाणते टिपरी खेळू या । {"\n"}स्वयंभ उदया नाम धींग || ३ ||{"\n"}
          प्रमाण तुकीया विप्र प्रसादे  । {"\n"}  नाचतो छेंदे आभंग || ४ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>४१ </Text>
        <Text style={styles.text}>
          डोळे भेटी जाली हरी । {"\n"}कटी कर वीटेवरी || १ ||{"\n"}
          रूप सावळे गोजीरे । {"\n"}डोळा साठवले बरे || २ ||{"\n"}
          सीरी मुगूट झळाळी । {"\n"}उभा साजे वनमाळी || ३||{"\n"}
          रत्नजडीत पदक । {"\n"}शोभा प्रकार अनेक || ४ ||{"\n"}
          मूक्त चौकडीया कानी । {"\n"}हीरे लागले नयेनी || ५ ||{"\n"}
          शोभीवंत उभे ध्यान । {"\n"}मन वेधले पाहून || ६ ||{"\n"}
          तुकाविप्र डोळे भेटी । {"\n"}विटेवरी जगजेठी || ७ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>४२ </Text>
        <Text style={styles.text}>
          डोळे भेटीसी तुटी नसो देवा | {"\n"}विनवणी विठ्ठल वासुदेवा || १ ||{"\n"}
          अखंडीत समोर सर्व काजा । {"\n"}करावे सत्य महाराजा || २ ||{"\n"}
          पळभरी वियोग पूरवेना | {"\n"}मायबापा विठ्ठल दयाघना || ३ || {"\n"}
          तुकाविप्र आवडी उरुबुरू | {"\n"}प्रिती नाचावे सत्य जगद्गुरू || ४ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>४३ </Text>
        <Text style={styles.text}>
          पटी कापुस आसता । {"\n"}नाही वार्ता तयासी || १ ||{"\n"}
          नाना नामे जाले पट। {"\n"}नाही खोट कापुसा || २ ||{"\n"}
          कोणी म्हणेना कापूस । {"\n"}पट त्यास बोलती || ३ ||{"\n"}
          तुकाविप्र म्हणे तैसा  । {"\n"}जन ठसा ब्रह्मीचा || ४ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>४४ </Text>
        <Text style={styles.text}>
          पाश लपविले यमे । {"\n"}ऐसे झाले हरीनामे || १ ||{"\n"}
          यम सामोरा पातला । {"\n"}नर नाम धारकाला || २ ||{"\n"}
          केला आदर बहुत । {"\n"}जोडोनिया दोन्ही हात || ३ ||{"\n"}
          नाम पराक्रम ऐसा । {"\n"}भोळा भाव धरा कैसा || ४ || {"\n"}
          तुकाविप्र म्हणे यम । {"\n"}तोचि झाला सत्य धर्म || ५ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>४५ </Text>
        <Text style={styles.text}>
          प्रथम कलीत नामदेवा ऐसा | {"\n"}उद्धरिला कैसा कुटुंबेसी || १ ||{"\n"}
          दामासेटी बाप गोणाबाई माता | {"\n"}सणकादी भक्ता ऐसे केले || २ || {"\n"}
          उपमन्ये ध्रूव प्रल्हादा समान | {"\n"}बाळा दिला मान नामयाचा || ३ || {"\n"}
          तुकाविप्र म्हणे ऐसे किती भक्त | {"\n"}विठ्ठले विख्यात उद्धरिले || ४ || {"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>४६ </Text>
        <Text style={styles.text}>
          फार हेत हाचि जाला । {"\n"}तुज पहावे विठ्ठला || १ ||{"\n"}
          चंद्रभागेसी नहावे । {"\n"}सभामंडपी नाचावे || २ ||{"\n"}
          अन्न सेवावे भिक्षेचे । {"\n"}मधुकरी वेदांतीचे || ३ ||{"\n"}
          नाम गांवे तुझे हरी । {"\n"}विठो रंग साळेवरी || ४ ||  {"\n"}
          तुकाविप्र हेत फार । {"\n"}डोळे भेटी निरंतर  || ५ || {"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>४७ </Text>
        <Text style={styles.text}>
          बद्रीवनासी यावया । {"\n"}काय कारण तुकीया || १ ||{"\n"}
          पूर्वजन्मी हेत केला । {"\n"}तैसा तूर्त फळा आला || २ || {"\n"}
          विनायकासी पूजावे । {"\n"}हेत केला होता जीवे || ३ || {"\n"}
          तुका विप्र हेत होणे । {"\n"}बद्रीवनी गुरु देणे || ४ || {"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>४८  </Text>
        <Text style={styles.text}>
          बावन वर्णहो भाऊ सांगताती | {"\n"}धरा दृढ चित्ती गुरु चेले || १ ||{"\n"}
          अभिमाने नका लंडिया हो मरु | {"\n"}संत जगद्गुरु मनोहर || २ ||  {"\n"}
          श्रोते वक्ते जया कीर्तनी डोलती | {"\n"}ते ठायी श्रीपति नाचता हे || ३ ||  {"\n"}
          तुकाविप्र श्रोत्या  वक्त्या मेळी | {"\n"}सापडला बळी कृपे आता || ४ ||  {"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>४९</Text>
        <Text style={styles.text}>
          भक्त देव दोन्हीपणे । {"\n"}आता होणे प्रसन्न || १ ||{"\n"}
          उभयता मिळोनीया । {"\n"}करा दया आभंग || २ ||{"\n"}
          भेद ठेवू नका काही । {"\n"}याची देही सांभाळा || ३ ||{"\n"}
          प्रीती केली देव भक्ता । {"\n"}उभयेता विनंती || ४ ||{"\n"}
          तुकाविप्र म्हणे कृपा । {"\n"}मायेबापा करावी || ५ ||{"\n"}

        </Text>

        <View style={styles.line}></View>
        <Text style={styles.title}>५० </Text>
        <Text style={styles.text}>
          भाव जेथे प्रगटला । {"\n"}देव तेथेची बींबला || १ ||{"\n"}
          सत्यदेव भावापासी । {"\n"}आम्ही पूसीले वेदासी || २ ||{"\n"}
          तुम्ही धरा येक बोले । {"\n"}भाव संतापासी भले || ३ ||{"\n"}
          शाहाणेची आहा सर्व । {"\n"}देव तोची खरा भाव || ४ ||{"\n"}
          तुकाविप्र म्हणे धरा । {"\n"}संत पायी भाव बरा || ५ ||
          {"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>५१ </Text>
        <Text style={styles.text}>
          भले प्रारब्धाचे गाढे | नामधार ते निधडे || १ ||{"\n"}
          माता पिता त्याचे धन्य | नामी रंगले अनन्य || २ ||{"\n"}
          कुळ पवित्र तयाचे | नाम विठ्ठल वाचे || ३ ||{"\n"}
          पुरा ब्रम्हची तो होये | हरी हरी प्रीती गाये || ४ ||{"\n"}
          तुकाविप्र म्हणे नाम | धन्य गाती युक्त प्रेम || ५ ||
          {"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>५२ </Text>
        <Text style={styles.text}>
          भोंदावया तुम्हा नाही । {"\n"}आलो आम्ही विठो द्वारी || १ ||{"\n"}
          भावभक्ती पाहो तेही । {"\n"}तुका देही विप्र हो || २||{"\n"}
          तुम्हा विप्र वृंदा सर्व । {"\n"}नाम साधन असे आर्व || ३ ||{"\n"}
          तुकाविप्र सांडोनि गर्व । {"\n"}प्रीती भाव वाढवावा || ४ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>५३ </Text>
        <Text style={styles.text}>
          मढे प्रत्यक्ष चालवी । {"\n"}तया ऐकवी बोलवी || १ ||{"\n"}
          पाणी पेववी मढीया । {"\n"}आन्न सेववी काया || २ ||{"\n"}
          नाना दाखवी कौतुक । {"\n"}देव नित्य जवळीक || ३ ||{"\n"}
          सर्व देहाचे व्यापार । {"\n"}चालवितो निरंतर || ४ ||{"\n"}
          तुकाविप्र म्हणे देही । {"\n"}गुरु कृपे देव पाही || 5 ||
          {"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>५४ </Text>
        <Text style={styles.text}>
          मजपासी आसोनी माझे मन । {"\n"}नव्हे माझीया सत्य आधीन || १ ||{"\n"}
          म्हणवोनी तुम्हासी विनविले । {"\n"}मन ऐसे येकाची प्रीती बोले || २ ||{"\n"}
          समजवोनी कीर्तनासी लावा । {"\n"}तुकाविप्र मनासी तुम्ही देवा || 3 ||{"\n"}
          {"\n"}
        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>५५ </Text>
        <Text style={styles.text}>
          मना विनंती हे तुज । {"\n"}साधी आत्महीत काज || १ ||{"\n"}
          मान सन्मान मागसी । {"\n"}न मिळता दुखवसी || २ ||{"\n"}
          नको पाहू मानामान। {"\n"}करी संतांसी नमन || ३ ||{"\n"}
          संत अवघी पंढरी । {"\n"}गोष्टी न मिळे दुसरी || ४ ||{"\n"}
          तुकाविप्र म्हणे मना। {"\n"}तुज अभंग प्रार्थना || ५||
          {"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>५६ </Text>
        <Text style={styles.text}>
          येका मातीचे जाहाले । {"\n"}घट भले अनंत || १ ||{"\n"}
          माती घटाला सुटेना । {"\n"}ब्रह्म जना तैसेची || २ ||{"\n"}
          घट मातीचा घडला  । {"\n"}तो मातीला सोडेना || ३ ||{"\n"}
          तुकाविप्र म्हणे माती | {"\n"}घट प्रीती सुटेना || ४ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>५७ </Text>
        <Text style={styles.text}>
          येका गुरुकृपे वीण | सर्व सीण सहज || १ ||{"\n"}
          म्हणोनीया संपादावी | नित्य नवी कृपा हे || २ ||{"\n"}
          हीत जाणावे त्वरित | संग संत कीर्तन || ३ ||{"\n"}
          तुकाविप्र म्हणे भला | लाभ जाला कृपेचा || ४ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>५८ </Text>
        <Text style={styles.text}>
          युगायुगीचा हा | नामा भक्त भोळा | {"\n"}उदास मोकळा | ब्रह्मनिष्ठ || १ ||{"\n"}
          भक्ता माजी बळी | नामा सर्वगुणे | {"\n"}आगळे करणे | नामयाचे   || २ ||{"\n"}
          देवाचा अत्यंत | आवडता नामा | {"\n"}सत्य केली सीमा | नामदेवे || ३ ||{"\n"}
          तुकाविप्र म्हणे | नामा मूर्तिमंत | {"\n"}भेटताहे तुर्त | भाविकासी || ४ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>५९ </Text>
        <Text style={styles.text}>
          रूप निघोट सावळे | आले डोळे भरोनी  || १ ||{"\n"}
          निवालीयाचे पाझर | कटी कर अभंग   || २ ||{"\n"}
          सर्वांगाची डोळे भेटी | पाठी पोटी निघोट  || ३ ||{"\n"}
          तुकाविप्र नामरूप | श्री प्रताप सद्गुरू || ४ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>६० </Text>
        <Text style={styles.text}>
          रमारूक्मीणी सहीत । {"\n"}क्रपावंत हो हरी || १ ||{"\n"}
          प्रेमयुक्त वाचे नाम । {"\n"}नित्य नेम धुमाळी ||२ ||{"\n"}
          ऐसे कीजे रमापती । {"\n"}श्री विनंती विठोबा || ३ ||{"\n"}
          तुकाविप्र म्हणे देणे । {"\n"}सर्वगुणे कीर्तन || ४ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>६१ </Text>
        <Text style={styles.text}>
          रोहिदास आणि | कबीर कमाल । {"\n"}प्रगटा आणिले | नामदेवे || १ ||{"\n"}
          नानकादी भक्त | प्रगट व्हावया |  {"\n"}मुख्य हाची पाया | नामदेव  || २ ||{"\n"}
          कुर्मदास गोरा | सावता प्रगट । {"\n"}नामदेवे नीट | भक्त केले || ३ ||{"\n"}
          तुकाविप्र म्हणे | चोखामेळा बंका । {"\n"}नामदेवे लेका | उद्धरिले || ४ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>६२ </Text>
        <Text style={styles.text}>
          लक्षूमण रामदासी । {"\n"}संत चाफळचा वासी || १ ||{"\n"}
          योगी उदार विरक्त । {"\n"}सत्वगुणी क्षमा युक्त || २ ||{"\n"}
          भक्ती भावार्थे आगळे । {"\n"}ज्ञानी अंतर निर्मळ || ३ ||{"\n"}
          तुर्त पट्ट अधिकारी । {"\n"}लक्षूमण आवतारी  || ४ ||{"\n"}
          तुकाविप्र सुखी होणे । {"\n"}होता तयाचे दर्शने || ५ ||
          {"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>६३ </Text>
        <Text style={styles.text}>
          लाभ समर्थ आइता | दैवे आणियेले हाता || १ ||{"\n"}
          केले नव्हे तेची काही | संत सभेवर देही || २ ||{"\n"}
          सार चहु युगामाजी | नाम कीर्तन सहजी || ३ ||{"\n"}
          तुकाविप्र आपुलीया | दैवा पाहुनी सुखीया || ४ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>६४ </Text>
        <Text style={styles.text}>
          विठ्ठल विठ्ठल स्मरण हा नेम | {"\n"}नित्यावळी नाम कथा हरी  || १ ||{"\n"}
          सहज मुकाम कोठेही पडिला | {"\n"}गाजवी आपुला कीर्तिघोश || २ ||{"\n"}
          देणे हे मागणे प्रसंगा साजिरे | {"\n"}विठ्ठल गोजीरे रूप डोळा || ३ ||{"\n"}
          सर्वांगी तो प्रेमा आपुले प्रितीचा | {"\n"}काया मन वाचा नेम हाचि || ४ ||{"\n"}
          तुकाविप्र म्हणे घडी हे सोन्याची | {"\n"}कीर्तन तुर्तची देखीयेले || ५ ||
          {"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>६५ </Text>
        <Text style={styles.text}>
          वारी जयाचीया कुळी | {"\n"}त्याची लागो पायेधुळी || १ ||{"\n"}
          ऐसे ब्रह्मादी इच्छिती । {"\n"}परी नव्हे तथा प्राप्ती || २ ||{"\n"}
          आम्हा मानवासी लाभ । {"\n"}भाग्ये अपार स्वयंभ || ३ ||{"\n"}
          गुरुकृपेचा प्रताप | {"\n"}रासी लाभाच्या  अमुप || ४ ||{"\n"}
          तुकाविप्र म्हणे भोळा । {"\n"}तया लाभ हा सगळा || ५ ||
          {"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>६६  </Text>
        <Text style={styles.text}>
          विठलाई नाम गाणे | {"\n"}लागो कडेसी हे जीणे || १ ||{"\n"}
          हाची नेम सीद्धी जाता । {"\n"}तुझी कृपा रमाकांता || २ ||{"\n"}
          आम्हा संपूर्ण पावली । {"\n"}कथा रंगी साच बोली || ३ ||{"\n"}
          तुकाविप्र म्हणे ऐसी । {"\n"}कृपा करी विठो कैसी || ४ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>६७  </Text>
        <Text style={styles.text}>
          शुद्ध भावार्थ पदरी । {"\n"}आसलीया देव घरी || १ ||{"\n"}
          फार न लगे चावटी । {"\n"}घडी लाभाची हे मोटी || २ ||{"\n"}
          युग बहुत चांगले । {"\n"}जीणे त्याज होनी भले || ३ ||{"\n"}
          तुकाविप्र म्हणे वक्ता । {"\n"}भली कथा भला श्रोता || ४ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>६८ </Text>
        <Text style={styles.text}>
          शतकोटी ऐसा  | ग्रंथ केला  सिद्ध । {"\n"} त्रिजगी प्रसिद्ध | नामयाने || १ ||{"\n"}
          नामा तुका विप्र | द्रष्ट्रे हे साचार । {"\n"}तिघांचा ओंकार | येक नामा || २ ||{"\n"}
          आदि मधी अंती |  सर्वव्यापी नामा | {"\n"}शारदा महिमा | ना शके वर्णु  || ३ ||{"\n"}
          तुकाविप्र युग्म |  कृष्णराधा जैसे । {"\n"}विठू नामा तैसे |  शोभीवंत || ४ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>६९ </Text>
        <Text style={styles.text}>
          श्रोते बावन वर्णाचे  | {"\n"}शुद्ध पुतळे प्रेमाचे || १ ||{"\n"}
          प्रेम सर्वांगी आणावे । {"\n"}देवा संगती खेळावे || २ ||{"\n"}
          ऐसे जन्माचे प्रमाण । {"\n"}गावे श्री हरीचे गुण || ३ ||{"\n"}
          हरी खेळाचे संगती । {"\n"}काला रंगी प्रेम प्रीती || ४ ||{"\n"}
          तुकाविप्र म्हणे ऐसी । {"\n"}युक्त भागवती खासी || ५ ||
          {"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>७० </Text>
        <Text style={styles.text}>
          श्रोता विठ्ठल अभंग | नाम धिंग विठ्ठल || १ ||{"\n"}
          वक्ता विठ्ठल श्रीपती | वेद मूर्ती वेदान्त || २ ||{"\n"}
          भक्ती विठ्ठल भावार्थ | वेद अर्थ सोलीव || ३ ||{"\n"}
          वक्ता श्रोता ही विठ्ठल | समतोल कीर्तनी || ४ ||{"\n"}
          तुकाविप्र निमित्यासी | लोकिकासी दावणे || ५ ||
          {"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>७१ </Text>
        <Text style={styles.text}>
          सत्य जाती येक गहूं । {"\n"}परि प्रकारची बहू  || १ ||{"\n"}
          तैसा आत्मा येक जनी | {"\n"}जीव चौऱ्यांशी ही योनी  || २ ||{"\n"}
          एक जिवनची परी |  {"\n"}बहु तयाच्या लहरी  || ३ ||{"\n"}
          तुकाविप्र म्हणे भूती | {"\n"}हरी एक विराजती  || ४ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>७२ </Text>
        <Text style={styles.text}>
          संत कोणीही यातीचा । {"\n"}तो शांतीचा पुतळा || १ ||{"\n"}
          भाव भक्ती प्रेमेवीण | {"\n"}संत पण कैचे ते || २ ||{"\n"}
          शांती संतपणा मूळ । {"\n"}पूण्येफळ आईते || ३ ||{"\n"}
          तुकाविप्र म्हणे जिणे । {"\n"}संतपणे चांगले || ४ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>७३ </Text>
        <Text style={styles.text}>
          सीमग्याचा नव्हे खेळ | ऐका श्रोते सकळ || १ ||{"\n"}
          काळ बैसलासे उसा | वर्म हे का नेणतसा || २ ||{"\n"}
          हरी वाचे केव्हा यावा | केंव्हा संसार सरावा || ३ ||{"\n"}
          सर्वकाळ नासीवंत | गोष्टी होतची आहेत || ४ ||{"\n"}
          तुकाविप्र म्हणे हारी | आठवावा क्षणभरी || ५ ||
          {"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>७४ </Text>
        <Text style={styles.text}>
          हेत बहुत जाहला । {"\n"}तुज भेटावे विठ्ठला || १ ||{"\n"}
          सभा मंडपी पंढरी । {"\n"}नाचू रंग साळेवरी || २ ||{"\n"}
          आस बहुत सुटली । {"\n"}डोई ठेवावी पाऊली || ३ ||{"\n"}
          श्रोता वक्ता तुम्ही व्हावे । {"\n"}सभा मंडपासी यावे || ४ ||{"\n"}
          तुकाविप्र रंग साळे। {"\n"}वरी नाचवी कृपाळे || ५ ||
          {"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>७५ </Text>
        <Text style={styles.text}>
          हरी हरी दोन अक्षरे गर्जता । {"\n"}आपार  सुकुता जोडी होये || १ ||{"\n"}
          श्रीकृष्ण आर्जुना सांगितले स्तोत्र । {"\n"}ॐकाराचा मंत्र मुळ हरी || २ ||{"\n"}
          तुकाविप्र म्हणे वेद श्रुती वाणी । {"\n"}कीर्तन रंगणी उभा हरी || ३ ||{"\n"}
        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>७६ </Text>
        <Text style={styles.text}>
          ज्ञान कासया कथावे । {"\n"}नाम विठ्ठल गर्जावे || १ ||{"\n"}
          हाची विधी या क्षेत्रीचा | {"\n"}काया मन सत्य वाचा || २ ||{"\n"}
          नाम गर्जना करावी । {"\n"}हरी गुण कीर्ति गावी || ३ ||{"\n"}
          चंद्रभागेसी नहावे । {"\n"}सभा मंडपी नाचावे || ४ ||{"\n"}
          तुकाविप्र सार्थकता । {"\n"}डोळा पंढरी पाहता || ५ ||{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>७७ </Text>
        <Text style={styles.text}>
          ज्ञानराजया विनंती तुम्हा । {"\n"}दाखवा प्रीती पाउले आम्हा || १ ||{"\n"}
          हेत फार हा सुचेना प्रीती । {"\n"}देव हे तुम्हा ज्ञान विनंती || २ ||{"\n"}
          आवडी तुम्ही न्याल उछवा । {"\n"}फारची वाटे सुख या जीवा || ३  ||{"\n"}
          मानसी तुकाविप्र हेत हा । {"\n"}जी आता कृपा दृष्टीने पाहा || ४ ||{"\n"}

        </Text>

      </ScrollView>
    </LinearGradient>
  )
}

export default Abhangparayan

const styles = StyleSheet.create({
  container: {
    paddingHorizontal: 20,
    paddingVertical: 10
  },
  text: {
    color: '#3a2b1e',
    fontFamily: 'VesperLibre-Bold',
    lineHeight: 26,
    fontSize: 18,
    marginTop: 5,
    textAlign: "justify"

  },
  title: {
    color: '#3a2b1e',
    fontFamily: 'VesperLibre-Bold',
    fontSize: 18,
  },
  line: {
    height: 1,
    backgroundColor: 'gray',
    width: '100%',
    marginVertical: 10,
  },
})