import { View, Text, StyleSheet, ScrollView } from 'react-native'
import React from 'react'
import LinearGradient from 'react-native-linear-gradient';

const Alandiabhang = () => {
  return (
    <LinearGradient colors={['#FFF7E6', '#FFECC2']} style={styles.container}>
      <ScrollView showsVerticalScrollIndicator={false}>
        <Text style={styles.title}>अभंग १ </Text>
        <Text style={styles.text}>
          ज्ञानदेवाची हे दशमी कार्तिक | {"\n"}समाधी कौतुक | कृष्णपक्ष समर्थ || १ ||{"\n"}
          प्रथम दिवस उत्सवाचा नेम | {"\n"}कथा हरीनाम | इंद्रायणी तटाकी || २  ||{"\n"}
          वैष्णवाची मांदी मिळाली अपार | {"\n"}कीर्तन गजर आळंदी या नगरी || ३ ||{"\n"}
          संत सणकादी भक्त महाजन | {"\n"}देव दयाधन | आले राव पंढरी || ४ ||{"\n"}
          तुकाविप्र हेत पुरे तात्काळची | {"\n"}कृपा ज्ञानियाची परी पूर्ण अभंग || ५ ||

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग २ </Text>
        <Text style={styles.text}>
          विष्णु अवतार ज्ञानदेव संत {"\n"}प्रमाण कलीत चालविती भिंताडे || १ ||{"\n"}
          पशु रेडा वेद बोलाविला {"\n"}ज्यांनी प्रसिद्ध पैठणी गौतमीचे तटाकी || २ ||{"\n"}
          भुदेवा संतोष बहुतचि केला {"\n"}सत्य उगविला गीतार्थ जयाला || ३ ||{"\n"}
          तुकाविप्र ऐसे थोर ज्ञानदेव {"\n"}ज्यानी केला भव अवघाची कोरडा || ४ ||

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग ३</Text>
        <Text style={styles.text}>
          आवतार हे देव कलयुगी {"\n"}ज्ञानदेव  मानव तनु जगी || १ ||{"\n"}
          उद्धराया पतीत जन लोका{"\n"}जड  मुढ आनाथ दिनरंका || २ ||{"\n"}
          तुकाविप्र आभंग आवडीचा {"\n"}ज्ञानदेव उघडा  प्रचीतीचा || ३ ||

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग ४ </Text>
        <Text style={styles.text}>
          गीतार्थाचा जाला | घोटाळा बहुत {"\n"}म्हणोनीया संत | आवतार || १ ||{'\n'}
          ज्यानी केला बोध | आर्जुनासी प्रीती {"\n"}तेची सत्य मुर्ती | ज्ञानराज || २ ||{'\n'}
          तुकाविप्र म्हणे | ज्ञानेश्वर भले {"\n"}आवतार  जाले | संतरूपे || ३ ||

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग ५ </Text>
        <Text style={styles.text}>
          गीता भांडार उघडीले जेणे {"\n"}उद्धरीले हे जन सर्व गुणे || १ ||{'\n'}
          ब्रह्मांडासी नेवोनी ठेवियेला {"\n"}प्रमाण हे प्रसिद्ध प्राण  भला || २ ||{'\n'}
          तुकाविप्र हे ध्यान समाधीसी {"\n"}ज्ञानदेव अभंग आळंदीसी || ३ ||

        </Text>

        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग ६ </Text>
        <Text style={styles.text}>
          तोची नेम उछव ज्ञानराया {"\n"}यात्रा मंगळ जन तरावया || १ ||{'\n'}
          देशोदेशीचे संत धांव घेती {"\n"}टाळ वीणे सहीत नाचताती || २ ||{'\n'}
          तुकाविप्र उष्ठव आळंदीचा {"\n"}रंग आभंग नाम कीर्तनाचा || ३ ||

        </Text>

        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग ७ </Text>
        <Text style={styles.text}>
          वासी इंद्रायेणी तीर {"\n"}देव ज्ञान आवतार  || १ ||{'\n'}
          पुर आळंदी प्रसिद्ध {"\n"}संत वसावया शुद्ध || २ ||{'\n'}
          मांदी संतांची मिळाली | {"\n"}इंद्रायणी घणाणली || ३ ||{'\n'}
          तुकाविप्र मंडपात {"\n"}नाचे प्रीती सभे संत || ४ ||

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग ८ </Text>
        <Text style={styles.text}>
          धन्य दिवस सोन्याचा | {"\n"}समारंभ आळंदीचा || १ ||{'\n'}
          संत समुदाये भला |{"\n"}जेथे आपार मिळाला || २ ||{'\n'}
          घोश श्री हरी विठ्ठले  | {"\n"}करीती हे संत भले || ३ ||{'\n'}
          तुकाविप्र म्हणे धन्य | {"\n"}संत रूपे देव ज्ञान || ४ ||

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग ९ </Text>
        <Text style={styles.text}>
          ज्ञानराजया विनंती तुम्हा {"\n"}दाखवा प्रीती पाउले आम्हा || १ ||{'\n'}
          हेत फार हा सुचेना प्रीती {"\n"}देव हे तुम्हा ज्ञान विनंती || २ ||{'\n'}
          आवडी तुम्ही न्याल उछवा {"\n"}फारची वाटे सुख या जीवा || ३ ||{'\n'}
          मानसी तुकाविप्र हेत हा {"\n"}जी आता कृपा दृष्टीने पाहा || ४ ||

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग १० </Text>
        <Text style={styles.text}>
          कीर्तनी उभे तुमच्या पुढे {"\n"}आवडी आसो केलीसी मुढे || १ ||{'\n'}
          यावरी तुम्हा आवडे करा {"\n"}पाये दाखवा सत्य पामरा || २ ||{'\n'}
          हेची विनंती वेळ जाणुनी {"\n"}सत्य श्रीहरी नाम कीर्तनी || ३ ||{'\n'}
          दीन हा तुकाविप्र मानवी {"\n"}ज्ञानराज या सत्य विनवी || ४ ||

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग ११ </Text>
        <Text style={styles.text}>
          हेत पुरवीला पाहीजे कृपाळा {"\n"}श्रीविष्णू निर्मळा ज्ञान देवा || १ ||{'\n'}
          समये उचीत विनंती हे खरी {"\n"}परीसावी वरी गोष्टी आहे || २ || {'\n'}
          तुकाविप्र ज्ञानदेवा पाई हेत {"\n"}सभा मंडपात नाचावे हा || ३ ||

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग १२ </Text>
        <Text style={styles.text}>
          कनक तरूचे तळवटी कथा {"\n"}संगी ज्ञाननाथा नाचवावे || १ ||{'\n'}
          ऐशा हेते प्रीती विनंती कीर्तनी {"\n"}दशमी सुदीनी लीहीते हे || २ || {'\n'}
          तुकाविप्र नाचे सभा मंडपात {"\n"}कीजे तोची आर्थ ज्ञानदेवा || ३ ||

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग १३ </Text>
        <Text style={styles.text}>
          संन्यासाचे पोटी विष्णु अवतार{"\n"}देव ज्ञानेश्वर गीता अर्थ कराया || १ ||{'\n'}
          तपोनिधी बाप समर्थ संन्यासी {"\n"}सद्गुरु आज्ञेसी निरुपम वीरक्त || २ ||{'\n'}
          विधीयुक्त ब्रह्म-चर्य आचरले{"\n"}संन्यासी जाहाले काशीमध्ये जावोनी || ३ ||{'\n'}
          तुकाविप्र म्हणे अवतार देव {"\n"}जाहाले स्वभावे तयाचिया उदरी || ४ ||

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग १४
        </Text>
        <Text style={styles.text}>
          येजुर्वेद शाखा | माध्यांजन द्वीज {"\n"}गोविंद सहज {"\n"}तपोनीधी प्रेमळ || १ ||{'\n'}
          नीराबाई माता | पवित्र सुंदरी {"\n"}तयेचे उदरी {"\n"}विठ्ठल हे जन्मले || २ ||{'\n'}
          सर्व तीर्थे केली | उत्तर मानस {"\n"}दक्षण मानस {"\n"}करावया निघाले || ३ ||{'\n'}
          विठोबा हा पुत्र | येकुलता येक {"\n"}समर्थ भावीक {"\n"}वितरागी प्रेमळ || ४ ||{'\n'}
          तुकाविप्र म्हणे | आळंदीसी आले {"\n"}देऊळी राहीले {"\n"}सिद्धेश्वर देवाचे || ५ ||

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग १५
        </Text>
        <Text style={styles.text}>
          सिद्धोपंत कुलकर्णी आळंदीचे | {"\n"}भक्त सिद्धोबाचे एकनिष्ठ भावार्थी || १ ||{'\n'}
          कन्या येकुलती येक उपवर | {"\n"}पडीला विचार सिद्धोपंता वराचा || २ ||{'\n'}
          तेव्हा सिद्धेश्वरे स्वप्न सांगितले | {"\n"}थापटोणी केले जागे सिद्धोपंतासी  || ३ ||{'\n'}
          वर आला आहे देवूळी तयाला | {"\n"}द्यावे या मुलीला आहे बहु उत्तम  || ४ ||{'\n'}
          तुकाविप्र म्हणे जागे सिद्धोपंत | {"\n"}होवोनी धावत  देवळासी पातले || ५ ||

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग १६
        </Text>
        <Text style={styles.text}>
          गोविंद नीराई विठ्ठल या तिघा | {"\n"}भेटी पांडुरंगा स्वप्नामाजी जाहाली || १ ||{'\n'}
          सांगितले देवे तिघासही स्वप्न | {"\n"}विठोबाचे लग्न येथे होत आहे की || २ ||{'\n'}
          तिघेही उठोनी बैसली  चिंतनी  | {"\n"}रखुमाई देवी धन्ये | वधूवर विठ्ठल || ३ ||{'\n'}
          आंपूर्व सोहळा विठ्ठल रुक्माइ | {"\n"}जाहाला सर्व ही | लग्न प्रीती आळंदी || ४ ||{'\n'}
          तुकाविप्र म्हणे इंद्रायणी तिरी | {"\n"}रुक्मा देवी खरी | ठेवोनी निघाले || ५ ||

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग १७
        </Text>
        <Text style={styles.text}>
          सिद्धोपंती स्वप्न सांगितले तया | {"\n"}गोविंद योगीया नीराबाई विठ्ठल || १ ||{'\n'}
          मान्य केले स्वप्न आपुले ही त्यांसी | {"\n"}घटीत छत्तीसी उतरले अपूर्व || २ ||{'\n'}
          लग्न लावीयेले बहुत प्रीतीने | {"\n"}आशिर वचने दिधले देवे देवे || ३ ||{'\n'}
          तुकाविप्र म्हणे चिंतनी देखिला | {"\n"}प्रसंग हा भला गोविंद पंत यांनी || ४ ||

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग १८
        </Text>
        <Text style={styles.text}>
          रुक्माइ ठेवीली सिदोपंता पासी | {"\n"}क्षेत्र आळंदीसी | पूढीलीया संधाने || १ ||{'\n'}
          दक्षण मानस कराया निघाले | {"\n"}बारा वर्षे गेले | तीकडेची तीर्थासी || २ ||{'\n'}
          उत्तर दक्षण त्रिवार साधीली | {"\n"}तीर्थे सांगितली तैसी तैसी पुराणी || ३ ||{'\n'}
          कासी वास केला माता पिता शांत | {"\n"}जाहलिया संत येकलाची विठोबा || ४ || {'\n'}
          तुकाविप्र म्हणे संन्यास घेतला | {"\n"}उत्तम साधला योग ऐसा अभंग || ५ ||

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग १९
        </Text>
        <Text style={styles.text}>
          स्वप्नी जे देखीले चिंतनी पाहीले | {"\n"}अनुभवी आले कथा सूत्र देवाचे || १ ||{'\n'}
          गोविंद निराई विचार तंद्रीत | {"\n"}आले सिद्धोपंत नमस्कार जाहला || २ ||{'\n'}
          विचारले तुम्ही कोण कोठे जाता | {"\n"}देश ही कोणता कोण ग्राम वृत्तीचे || ३ ||{'\n'}
          तुकाविप्र म्हणे वृत्ती आपेगांव | {"\n"}गौतमी स्वभावे तीर पुण्य भूमीसी || ४ ||

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग २०
        </Text>
        <Text style={styles.text}>
          एकमेका स्वप्ने निवेदन केली | {"\n"}लग्न लावीयेले विठोबा रुखमाईचे || १ ||{'\n'}
          स्वप्नी साक्षात्कार जाला गोवींदासी |  {"\n"}घडीयेले तैसे देवजीच्या सत्तेने || २ ||{'\n'}
          दक्षिण मानस करोंनीया तीर्थे | {"\n"}पातले भावार्थे काशीपूर या क्षेत्री || ३ ||{'\n'}
          माता पितरासी देवाज्ञा जाहाली | {"\n"}वैकुंठासी गेली उभय माता पीता || ४ ||{'\n'}
          वर्णाश्रम विधी सर्व उरकला | {"\n"}संन्यास घेतला विरागी विठोबाने || ५ ||{'\n'}
          तुकाविप्र म्हणे देव सत्ता भली | {"\n"}कळो कोणा आली माया मोह जगती || ६ ||

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग २१
        </Text>
        <Text style={styles.text}>
          अपूर्वची वैराग्य साधीयेले | {"\n"}गुरुसेवेसी चित्त लावीयेले || १ ||{'\n'}
          जाले आपार पुण्ये निरुपम | {"\n"}विधीपूर्वक चालविले नेम || २ ||{'\n'}
          ऐसी पुण्ये केलीच त्रिभुवना | {"\n"}माजी मंगळ सकल ही जना || ३ ||{'\n'}
          हारीहर विधी सहेत  राजा | {"\n"}ऐसीयाच्या यावेची उदराला || ४ ||{'\n'}
          मूळ मायेसहित चौघेजण | {"\n"}देव घेणार जनम परी पूर्ण || ५ ||{'\n'}
          तुकाविप्र तो हेत घडतीया | {"\n"}पोटी जन्म प्रमाण संन्यासीया || ६ ||

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग २२
        </Text>
        <Text style={styles.text}>
          रुक्मादेवी ठेवोनी आळंदीसी | {"\n"}गेली तिघेही तीर्थ करायासी || १ ||{'\n'}
          निरूबाई विठोबा गोविंद हे | {"\n"}घेवोनीया संन्यास बैसले हे || २ ||{'\n'}
          तप समर्थ उदयासी आले | {"\n"}रुक्मादेवीने पुण्ये बहु केले || ३ ||{'\n'}
          इंद्रायणीचे स्नान उष:काळी | {"\n"}शुभ्र पातळ शुभ्रदिव्य चोळी || ४ ||{'\n'}
          कुंकू भाळी मंगळसूत्र गळा | {"\n"}देव पुजिती सिद्धराज भोळा || ५ ||{'\n'}
          तुकाविप्र सहज प्रसन्नता | {"\n"}ज्ञानदेवाची मूळ खरी कथा || ६ ||


        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग २३
        </Text>
        <Text style={styles.text}>
          तप आले समर्थ रुक्माईचे | {"\n"}अवतार पोटासी यावयाचे || १ ||{'\n'}
          उभयताचे तप  समतीसी | {"\n"}आले चारी देव ही जन्मयासी || २ ||{'\n'}
          तुकाविप्र तेव्हाच उभयंता | {"\n"}रुक्मादेवी विठ्ठल माता पीता || ३ ||

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग २४
        </Text>
        <Text style={styles.text}>
          रुक्मादेवीचीया तपे | विठो आणीला प्रतापे || १ ||{'\n'}
          गुरु शिष्य समुदाये | आले क्षेत्र आळंदीये || २ ||{'\n'}
          सिद्धेश्वरा पासी आले सिद्धोपंत ची भेटले || ३ ||{'\n'}
          सिद्धेश्वरा पासी आले सिद्धोपंत ची भेटले || ४ ||

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग २५
        </Text>
        <Text style={styles.text}>
          तीन शत संन्यासीया | पुडी आलो सांगोनीया || १ ||{'\n'}
          सिद्धोपंत म्हणे गीरी | धन्य दैव गती खरी || २ ||{'\n'}
          समुदाये ऐसा आजी | घडत आहे सहजी || ३ ||{'\n'}
          तुकाविप्र म्हणे भली | बरे गीर्जाई बोलीली || ४ ||

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग २६
        </Text>
        <Text style={styles.text}>
          रुक्मादेवी आनंदली | संत सेवेसी लागली || १ ||{'\n'}
          सर्वी दिला आशीर्वाद | तीन शत संत वृंद || २ ||{'\n'}
          त्रिभुवना मान्य पुत्र | वती होशील पवित्र || ३ ||{'\n'}
          तुकाविप्र भक्ति बळे | रुक्मादेवी पुत्र फळे || ४ ||

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग २७
        </Text>
        <Text style={styles.text}>
          संत समुदाय भला | सत्य सूप्रसन्न झाला || १ ||{'\n'}
          रुक्मादेवी पाय धुती | संत निष्काम विभूति || २ ||{'\n'}
          तीन शताचे धुतले | पाय विठोबा देखीले || ३ ||{'\n'}
          तुकाविप्र म्हणे तेंव्हा | वर आला अनुभवा || ४ ||

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग २८
        </Text>
        <Text style={styles.text}>
          विठोबाने ग्राम घर | वोळखीला सिद्धेश्वर || १ ||{'\n'}
          इंद्रायेणी वोळखीली | कांता रुक्माइ आपुली || २ ||{'\n'}
          प्रथमता सिद्धोपंत | सासू गिर्जाई विख्यात || ३ ||{'\n'}
          तुकाविप्र म्हणे पुण्ये | रुक्मादेवीचे हे धन्ये || ४ ||

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग २९
        </Text>
        <Text style={styles.text}>
          त्रयोदसी दिवाळीची | पूजा संन्यास धर्माची || १ ||{'\n'}
          ऐसी पुडी केली प्रीती | संन्यासीया तीन शती || २ ||{'\n'}
          सिद्धोपंती राहाविले | चतुर्दसी नहाणीले || ३ ||{'\n'}
          एकटीया रुक्मीणीने | तुकाविप्र म्हणे धन्ये || ४ ||

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग ३०
        </Text>
        <Text style={styles.text}>
          तीनशता मर्दीयेले | प्रीती रुक्माइने  तेले || १ ||{'\n'}
          न्याहाळीले भक्तिभावे | संत संन्यासी हे सर्वे || २ ||{'\n'}
          सिदोपंतासी  म्हणती | कोठे रुक्माइचा पती || ३ ||{'\n'}
          तुकाविप्र म्हणे सत्य | वृत्त सांगे सिदोपंत || ४ ||

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग ३१
        </Text>
        <Text style={styles.text}>
          पंत बोलती  स्वामी राजया | {"\n"}संतगुरु सागरा दया || १ ||{'\n'}
          तीर्थवासीया दिधली आधी | {"\n"}दैव येकली येक त्या मधी || २ ||{'\n'}
          प्रेमळा दिली भावीक भल्या | {"\n"}यात्रीया प्रीती सत्य आपुल्या || ३ ||{'\n'}
          बहिण ती निरू सत्य आमुची | {"\n"}सद्गुरू कृपा संत जातीची || ४ ||{'\n'}
          तिचीया प्रीती मूळ  दिधली | {"\n"}वृत्तीवंत हे कोठीली || ५ ||{'\n'}
          गौतमी तिरी आप या पुरी | {"\n"}भेट जाहाली भीमरा तीरी || ६ ||{'\n'}
          त्यावरी तुकाविप्र पुढती | {"\n"}भेटी जाहाली दैव संगती || ७ ||

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग ३२
        </Text>
        <Text style={styles.text}>
          दैव हे गती भेटता तुम्ही | {"\n"}मुख पावलो दर्शनेची राहिले || १ ||{'\n'}
          तीर्थ फिरता देवूळा आले | {"\n"}त्या दिनी प्रीती वस्ती राहिले || २ ||{'\n'}
          स्वप्न दाविले सिद्ध ईश्वरे | {"\n"}या रीती आले घडत हे बरे || ३ ||{'\n'}
          मास आकरा या घरी प्रीती | {"\n"}कार्तिकी आली त्याज पुढती || ४ ||{'\n'}
          तीन मूर्ती ही सिद्ध जाहल्या | {"\n"}आवडी आम्ही वाटी लावील्या || ५ ||{'\n'}
          मास त्याजला एकसे तीस | {"\n"}जाहाले तुकाविप्र हे दिस || ६ ||{'\n'}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग ३३
        </Text>
        <Text style={styles.text}>
          पंत गोविंद सासुरी या नाम | {"\n"}सासू नीराई  संत निरुपम || १ ||{'\n'}
          वर विठ्ठल गौर वर्ण ऐसे | {"\n"}अती प्रिये तुम्हासी सिष्य जैसे || २ ||{'\n'}
          मुखवटा तो याची रीती आहे | {"\n"}ऐकियेला संन्यास घेतला हे || ३ ||{'\n'}
          निरुबाई गोविंद उरकली | {"\n"}वृत्ती विरक्त आनयासे जाली || ४ ||{'\n'}
          केला संन्यास ग्रहण ही निका | {"\n"}वय नव्हे आणीक ही ऐका || ५ ||{'\n'}
          सिदोपंत स्वामीस वृत्त सांगे | {"\n"}तुकाविप्र याहूनी जाले मागे || ६ ||

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग ३४
        </Text>
        <Text style={styles.text}>
          संन्यास घेतला विठोबाने  जेव्हा | {"\n"}रुक्माइचे तेंव्हा | जीणे व्यर्थ  जाहाले || १ || {'\n'}
          देणारा घेणारा | दुशण  सांगती | {"\n"}काये फळ प्राप्ती | संन्यासीया  आयुक्त || २ ||{'\n'}
          आसिर्वाद स्वामी | या वरी जाहाला | {"\n"}तीन पुत्र तुजला |  एक कन्या होईल || ३ ||{'\n'}
          ऐसी वाणी स्वामी | वदली असता | {"\n"}घडिया घटिता | तुकाविप्र येईल || ४ ||

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग ३५
        </Text>
        <Text style={styles.text}>
          स्वामी बोलती पंत हो भले | {"\n"}शास्त्रही तुम्ही सर्व पाहीले || १ ||{'\n'}
          सर्व पावलो खूण या मनी | {"\n"}गेलीसे खरी गोष्ट होवोनी || २ ||{'\n'}
          सावरा आता शास्त्र संमती | {"\n"}सत्य गोष्टी हे स्वामी बोलती || ३ ||{'\n'}
          शास्त्रता तुकाविप्र जे निटी | {"\n"}वाट काढली वेद चोखटी || ४ ||

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग ३६
        </Text>
        <Text style={styles.text}>
          सर्व स्वामीने ग्रंथ पाहीले | {"\n"}त्यावरी गणसूत्र बांधीयेले || १ ||{'\n'}
          चार बालके होत जोवरी | {"\n"}तोवरी विठो रहा या घरी || २ ||{'\n'}
          सत्य वाणी हे तुझीच हाते | {"\n"}होतसे विठो शास्त्र किमते || ३ ||{'\n'}
          मान्य केल्यावीण ना गती | {"\n"}तीन उदरी देव जन्मती || ४ ||{'\n'}
          {/* aaaaaaaaaaaaaaaaaaaaaaaaaa| सहस्त्र ही तुकाविप्र जाहाला || ५ || */}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग ३७
        </Text>
        <Text style={styles.text}>
          गर्भ राहीला प्रथम दिवसी | {"\n"}नव ही जाले मास त्याजसी || १ ||{'\n'}
          पुत्र निवृत्ती नाथ जन्मले | {"\n"}तीन त्याजला मास जाहाले || २ ||{'\n'}
          ज्ञान त्याजवरी पुत्र दुसरा | {"\n"}गर्भ विष्णु श्री राहीला खरा || ३ ||{'\n'}
          मास त्या नव ज्ञान जन्मला | {"\n"}तीन जाहाले मास त्याजला || ४ ||{'\n'}
          राहिला विधी गर्भ त्यावरी | {"\n"}व्याप हा क्षिति सर्व जो करी || ५ ||{'\n'}
          पुत्र तीन त्रिगुण चांगले | {"\n"}आवडी तुकाविप्र जन्मले || ६ ||

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग ३८
        </Text>
        <Text style={styles.text}>
          सोपान जन्मल्या वरी तीन मास | {"\n"}गर्भ पहा कैसा आदिमाया राहिला || १ ||{'\n'}
          नव मासावरी मुक्ताई जन्मली | {"\n"}चित्कळा शोभली नात सिद्धोपंतासी || २ ||{'\n'}
          कन्या रत्न होता रुक्माई देवीसी | {"\n"}जाल्या तीन मासी उभयेता निघाली || ३ ||{'\n'}
          विठोबा रुक्मिणी महा यात्रा केली | {"\n"}बाळे हे ठेवीली आजा आजी जवळी || ४ ||{'\n'}
          तुकाविप्र म्हणे मनकर्णिकेत | {"\n"}उभयेता गुप्त जाली जळा भीतरी || ५ ||

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग ३९
        </Text>
        <Text style={styles.text}>
          आठेताळ मास आळंदी भीतरी | {"\n"}सिद्धोपंता घरी राहीले की विठोबा || १ || {'\n'}
          तीन वर्षे तीन मास निवृत्तीसी | {"\n"}ज्ञान राज यासी वर्षे सव्वा दोनची || २ ||{'\n'}
          एक वर्ष तीन महीने सोपाना | {"\n"}मुक्ताई निधाना तीन मास तेधवा || ३ ||{'\n'}
          तुकाविप्र म्हणे त्यापुढे पुढती | {"\n"}चहु बाळे  ख्याती केली कली युगात || ४ ||

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग ४०
        </Text>
        <Text style={styles.text}>
          अवतार तिन्ही विधी हरिहर {"\n"}निवृत्ती शंकर ज्ञानदेव श्रीविष्णु || १ ||{'\n'}
          ब्रह्मदेव पुत्र धाकुटा सोपान {"\n"}मुक्ताई निधान आदिमाया मूळची || २ || {'\n'}
          तुकाविप्र म्हणे सिद्धेश्वर गीरी{"\n"}कृपाफळे खरी नीरुबाई गोविंद || ३ ||

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग ४१
        </Text>
        <Text style={styles.text}>
          वहीच्या सेवटी आळंदीचा काला | {"\n"}कृष्ण कार्तिकीला त्रयोदसी विख्यात || १ ||{'\n'}
          प्लव संवत्सर शक शालिवान | {"\n"}सत्रा शत तीन कुमंडली तीरी या || २ ||{'\n'}
          सिद्धराज पिठी वनी या आनंद | {"\n"}कलीयुग शुद्ध प्रथम हा चरण || ३ ||{'\n'}
          आठे ताळ शत एक्याऐंशी प्रमाण | {"\n"}कीर्तन रंगण यात्रा नेम आळंदी || ४ ||{'\n'}
          श्रोते वक्ते ज्ञानेश्वर होवोनीया | {"\n"}गोष्टी लिहिल्या या सहज श्री कीर्तनी || ५ ||{'\n'}
          तुकाविप्र ज्ञान राजी या अंकित | {"\n"}संत सभे आत वाणी सत्य वदली || ६ ||{'\n'}

        </Text>


      </ScrollView>
    </LinearGradient>
  )
}

export default Alandiabhang

const styles = StyleSheet.create({
  container: {
    paddingVertical: 10,
    paddingHorizontal: 20
  },
  title: {
    color: '#3a2b1e',
    fontSize: 18,
    fontFamily: 'VesperLibre-Bold',
  },
  text: {
    color: '#3a2b1e',
    fontFamily: 'VesperLibre-Bold',
    lineHeight: 26,
    fontSize: 18,
    marginTop: 8,
    textAlign: "justify"

  },
  line: {
    height: 1,
    backgroundColor: 'gray',
    width: '100%',
    marginVertical: 20,
  },
})