import { View, Text, StyleSheet, ScrollView } from 'react-native'
import LinearGradient from 'react-native-linear-gradient'

const Haripath2 = () => {
  return (
    <LinearGradient colors={['#FFF7E6', '#FFECC2']} style={styles.container}>
      <ScrollView showsVerticalScrollIndicator={false}>
        <Text style={styles.toptext}>संत तुकाविप्र यांचे हरीपाठाचे म्हणून अभंग नाहीत परंतु त्यांच्या भक्तांनी काही अभंग हरीपाठाचे म्हणून ठरवले आहेत. त्यामुळे प्रत्येक ठिकाणी वेगळे वेगळे अभंग हरीपाठाचे म्हणून असू शकतात. या app मध्ये  दिलेले अभंग हे हरी या शब्दाने सुरू होणारे आहेत आणि आधी दु चरणी नंतर चौ चरणी आणि शेवटी पद अशी विभागणी केल्याने हे अभंग संत ज्ञानेश्वर संत तुकाराम आणि संत एकनाथ यांच्या हरीपाठाच्या चालीवर म्हणता येतात.</Text>
        <View style={styles.line}></View>
        <Text style={styles.title1}>अभंग{'\n'} </Text>
        <Text style={styles.title2}>१</Text>
        <Text style={styles.text}>
          हारी हारी गर्जा बाप ।{'\n'}सीद्ध सर्वही संकल्प ।।१।।{'\n'}
          आनुमाने तेची पापी ।{'\n'}कर्मी असोत या तपी ।।२।।{'\n'}
          नाम न गर्जती हारी ।{'\n'}वाणी तयाची घाणेरी ।।३।।{'\n'}
          ऐसा वेदार्थ चांगला ।{'\n'}आनुभव भोळीयाला ।।४।।{'\n'}
          तूर्त लाभ जया व्हावा ।{'\n'}त्याने गावे येका देवा ।।५।।{'\n'}
          तुकाविप्र नाम गर्जे ।{'\n'}हारी विठल सहजे ।।६।।{'\n'}
        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title2}>२ </Text>
        <Text style={styles.text}>
          हारी गर्जना करावी ।{'\n'}कीर्ती आभंग जोडावी ।।१।।{'\n'}
          शांती धरावी सबळ ।{'\n'}कीजे आंतर निर्मळ ।।२।।{'\n'}
          चित्त शुद्धी सत्यपणे ।{'\n'}जावे गुरूला शरण ।।३।।{'\n'}
          ऐसी वेदाज्ञा आभंग ।{'\n'}हारी नाम कीजे धींग ।।४।।{'\n'}
          तुकाविप्र म्हणे नीती ।{'\n'}ऐसी आमुते वेदांती ।।५।।{'\n'}
        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title2}>३ </Text>
        <Text style={styles.text}>
          हारी कीर्तनी अप्रिती ।{'\n'}त्यांची वाईट संगती ।।१।।{'\n'}
          ज्याची आवडी कीर्तनी ।{'\n'}तोच धन्य त्रिभुवनी ।।२।।{'\n'}
          तया संगती बसता ।{'\n'}सर्व सुखे येती हाता ।।३।।{'\n'}
          ऐसे वेदांती प्रमाण ।{'\n'}सार कीर्तन हा रंग ।।४।।{'\n'}
          तुकाविप्र म्हणे हारी ।{'\n'}कथा संत संग हारी ।।५।।{'\n'}
        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title2}>४ </Text>
        <Text style={styles.text}>
          हारी नाम गर्जे त्याला ।{'\n'}भेटी सहज विठ्ठला ।।१।।{'\n'}
          सर्व पातकाचा भला ।{'\n'}ठाव जेणेची पुशीला ।।२।।{'\n'}
          पुण्ये परायण जाले ।{'\n'}उपकाराशी लागले ।।३।।{'\n'}
          पाप कैसे लीम्पे त्यासी ।{'\n'}नाम जयाचे वाणीसी ।।४।।{'\n'}
          तुकाविप्र हारी म्हणे ।{'\n'}बुद्धी पुण्ये परायणे ।।५।।{'\n'}
        </Text>

        <View style={styles.line}></View>
        <Text style={styles.title2}>५ </Text>
        <Text style={styles.text}>
          हारी कीर्तन ऐकावे ।{'\n'}उगे निवांत बैसावे ।।१।।{'\n'}
          गत गोष्टी देवाजीची ।{'\n'}करावी हे सार्थकाची ।।२।।{'\n'}
          येर गत गोष्टी येथे ।{'\n'}न कराव्या हे उचित ।।३।।{'\n'}
          जाणतीया नरा काये ।{'\n'}सांगणे ते फार आहे ।।४।।{'\n'}
          सुचनाची मात्र केली ।{'\n'}धरा भजनाची चाली ।।५।।{'\n'}
          तुकाविप्र म्हणे लाभ ।{'\n'}कली संकीर्तन शुभ ।।६।।{'\n'}
        </Text>

        <View style={styles.line}></View>
        <Text style={styles.title2}>६ </Text>
        <Text style={styles.text}>
          हारी कथेवीण काही ।{'\n'}मना आवडची नाही ।।१।।{'\n'}
          म्हणोनीया आंतरीचे ।{'\n'}सुचवीले हे प्रीतीचे ।।२।।{'\n'}
          साहे जाहाले पाहीजे ।{'\n'}ऐसे बीरूदासी साजे ।।३।।{'\n'}
          तुकाविप्र म्हणे हेत ।{'\n'}विठो पुरवा कलीत ।।४।।{'\n'}
        </Text>

        <View style={styles.line}></View>
        <Text style={styles.title2}>७  </Text>
        <Text style={styles.text}>
          हारीभक्त होता भले ।{'\n'}सत्य प्रचीतीसी आले ।।१।।{'\n'}
          भक्तीभावे देव ऋणी ।{'\n'}आंगी प्रेम नाम वाणी ।।२।।{'\n'}
          सर्वभूती ब्रह्मभाव ।{'\n'}गुरुकृपा आनुभव ।।३।।{'\n'}
          तुकाविप्र म्हणे भक्ती ।{'\n'}देव ऋणी होणे युक्ति ।।४।।{'\n'}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title2}>८  </Text>
        <Text style={styles.text}>
          हारी कीर्तनी अप्रीती ।{'\n'}त्याची वाईट संगती ।।१।।{'\n'}
          ज्याची आवडी कीर्तनी ।{'\n'}तोची धन्य त्रिभुवनी ।।२।।{'\n'}
          तया संगती बैसता ।{'\n'}सर्व सुखे येती हाता ।।३।।{'\n'}
          ऐसे वेदांती प्रमाण ।{'\n'}सार कीर्तन रंगण ।।४।।{'\n'}
          तुकाविप्र म्हणे हारी ।{'\n'}कथा संत संग खरी ।।५।।{'\n'}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title1}>भजन {'\n'} </Text>
        <Text style={styles.title2}>९  </Text>
        <Text style={styles.text}>
          हारी गुरू कीजे भक्ती ।{'\n'}नित्य युक्ती नैरास्ये ।।१।।{'\n'}
          नित्य आसावे उदासी ।{'\n'}मरणासी जाणोनी ।।२।।{'\n'}
          नित्य काळ ऐसी नवी ।{'\n'}आभ्यासावी सद्भक्ती ।।३।।{'\n'}
          क्षमा आभ्यासावी दया ।{'\n'}नित्य पाया ऐसेला ।।४।।{'\n'}
          तुकाविप्र म्हणे शांती ।{'\n'}नित्य हाती धरावी ।।५।।{'\n'}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title2}>१० </Text>
        <Text style={styles.text}>
          हारी विठ्ठल श्रवण ।{'\n'}दे स्मरण देवाजी ।।१।।{'\n'}
          आता नको रीती घडी ।{'\n'}हे चि जोडी दे देवा ।।२।।{'\n'}
          फार मागु ना या विण ।{'\n'}तुझी आण बापाजी ।।३।।{'\n'}
          प्रेम अद्भूत सर्वदा ।{'\n'}दे येकदा अभंग ।।४।।{'\n'}
          तुकाविप्र तुझे पाई ।{'\n'}विठ्ठलाई प्रमाण ।।५।।{'\n'}


        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title2}>११ </Text>
        <Text style={styles.text}>
          हारी दिनी ऐसे पर्व ।{'\n'}भेटी देव विठ्ठली ।।१।।{'\n'}
          वारकरी सर्व जन ।{'\n'}सिंधु ज्ञान मिळाले  ।।२।।{'\n'}
          डोळे भेटी ब्रह्मानंद ।{'\n'}भाव शुद्ध भाविक ।।२।।{'\n'}
          धन्ये आजी सार दिन ।{'\n'}संकीर्तन विठ्ठल ।।४।।{'\n'}
          तुकाविप्र नामधारा ।{'\n'}वारी करा हे भेटी ।।५।।{'\n'}


        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title2}>१२  </Text>
        <Text style={styles.text}>
          हारी विठ्ठल समर्था ।{'\n'}फार कथा आवडे ।।१।।{'\n'}
          देव भक्त बोला चाली ।{'\n'}नाम कली कीर्तन ।।२।।{'\n'}
          सार देवा हे आवडे ।{'\n'}फार थोडे प्रमाण ।।३।।{'\n'}
          साचे पणे भक्तीभाव ।{'\n'}तोची  देव प्रसन्न ।।४।।{'\n'}
          तुकाविप्र हारी भक्ती ।{'\n'}सर्व युक्ती विठ्ठल ।।५।।{'\n'}


        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title2}>१३  </Text>
        <Text style={styles.text}>
          हारीहारी कृष्णवेणी ।{'\n'}श्री रूक्मिणी विठ्ठल ।।१।।{'\n'}
          चंद्रभागा पुंडलीक ।{'\n'}संत येक दर्शन ।।२।।{'\n'}
          पुरी ब्रह्म हे पंढरी ।{'\n'}भूमीवरी वैकुंठ ।।३।।{'\n'}
          तुकाविप्र नित्य उभा ।{'\n'}सत्य शोभा कीर्तनी ।।४।।{'\n'}


        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title2}>१४  </Text>
        <Text style={styles.text}>
          हारी भक्ती वेड बहुत चांगले ।{'\n'}संतांसी मानले सर्व गुणे ।।१।।{'\n'}
          भक्तीवीण वेड धोंडे मारायाचे ।{'\n'}फट फजितीचे जन लोकी ।।२।।{'\n'}
          भक्तीवेड ज्याला तयाला पूजिती ।{'\n'}येराला मारिती रांडा पोरे ।।३।।{'\n'}
          तुकाविप्र म्हणे भले भक्ती वेड ।{'\n'}सर्वासी आवड वेडाची या ।।४।।{'\n'}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title2}>१५  </Text>
        <Text style={styles.text}>
          हारीचे कीर्तन सर्वासी तारक ।{'\n'}वैकुंठ नायक  उभा जेथ अखंड ।।१।।{'\n'}
          ऐसीया प्रसंगी कोणी नर बैसा ।{'\n'}लाभ जोडा कैसा निरुपम कलीत ।।२।।{'\n'}
          सर्व लाभा माजी लाभ तो सार ।{'\n'}कीर्तन गजर त्रिभुवन ताराया ।।३।।{'\n'}
          तुकाविप्र म्हणे भावार्थ निर्मळ ।{'\n'}धरोनी सफळ करावा हा संसार ।।४।।{'\n'}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title2}>१६  </Text>
        <Text style={styles.text}>
          हारी गुरू नाम कीर्तन सभेत ।{'\n'}उभा देव संत समागमी ।।१।।{'\n'}
          सर्व ही सोहळे पाहोनी कीर्तनी ।{'\n'}सत्ता त्रीभुवनी जयाची तो ।।२।।{'\n'}
          तुकाविप्र म्हणे पतीत पावन ।{'\n'}करोनी कीर्तन सर्वा तारी ।।३।।{'\n'}
          {'\n'}
        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title2}>१७   </Text>
        <Text style={styles.text}>
          हारी वीण प्राणी ।{'\n'}न तरते खरे ।{'\n'}
          हारी भक्त बरे ।{'\n'}मृत्यू लोकी जन्मले ।।१।।{'\n'}
          श्रीहारी स्मरणे ।{'\n'}आपण तरती ।{'\n'}
          सर्वत्रा तारीती ।{'\n'}हारी भक्त प्रतापी ।।२।।{'\n'}
          तुकाविप्र म्हणे ।{'\n'}हारी भक्त धन्ये ।{'\n'}
          त्रिभुवना मान्ये ।{'\n'}याती असो कोणती ।।३।।

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title2}>१८   </Text>
        <Text style={styles.text}>
          हारी दाता भोक्ता अन्न मुख्य हारी ।{'\n'}प्रजापती हारी विप्र तनु ।।१।।{'\n'}
          भुक्ते भोजे येते सर्व हारीरूप ।{'\n'}प्रमाण संकल्प हारी हारी ।।२।।{'\n'}
          आम्हा हारी मंत्र नित्य ऐसा नेम ।{'\n'}नाही दुजे काम सहसाही ।।३।।{'\n'}
          सर्वज्ञ जाणती हारी मंत्र सार ।{'\n'}नेणती गव्हार सांगु जाता ।।४।।{'\n'}
          तुकाविप्र म्हणे भले अवतार ।{'\n'}नामाचा गजेर करीताती ।।५।।{'\n'}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title2}>१९   </Text>
        <Text style={styles.text}>
          हारी मंत्र नव्हे पोरासोरी खेळ ।{'\n'}वोंकाराचे मूळ हारी मंत्र ।।१।।{'\n'}
          प्रमाण माना हो संथेचा सेवट ।{'\n'}कीर्तन वैकुंठ हरिनाम ।।२।।{'\n'}
          हारी हारी काये म्हणाल कीर्तन ।{'\n'}सार हे साधन सर्वत्रासी ।।३।।{'\n'}
          हारी नामे वीण वोंकार हा थोटा ।{'\n'} मंत्र हाची मोटा सर्वामध्ये ।।४।।{'\n'}
          तुकाविप्र म्हणे हारी नाम गर्जा ।{'\n'}कीर्तिचिया ध्वजा अनायासे ।।५।।{'\n'}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title2}>२०   </Text>
        <Text style={styles.text}>
          हरिचिया दासा ।{'\n'}नाही चिंता भये ।{'\n'}साह्य सखा होय ।{'\n'}देव तया ।।१।।{'\n'}
          सर्वकाळ उभा ।{'\n'}रक्षावया भक्त ।{'\n'}विठ्ठल विख्यात ।{'\n'}मागे पुढे ।।२।।{'\n'}
          भय नाही चिंता ।{'\n'}सहज तयाला ।{'\n'}शरण विठ्ठला ।{'\n'}येक वेळ ।।३।।{'\n'}
          तुकाविप्र बैसे ।{'\n'}कीर्तन रंगणी ।{'\n'}विठ्ठल स्मरणी ।{'\n'}सर्वकाळ ।।४।।{'\n'}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title2}>२१   </Text>
        <Text style={styles.text}>
          हारीनामे वेद सर्वस्वे साजीरे ।{'\n'}वचन हे खरे वेदांतीचे ।।१।।{'\n'}
          नामरूप सारा वेदांत शोभणा ।{'\n'}सर्वांग देखणा वर्म जाणे ।।२।।{'\n'}
          सांगणे ऐकणे आभंग वेदांती ।{'\n'}वैदीका प्रचीती नामरूप ।।३।।{'\n'}
          तुकाविप्र म्हणे आडदांडा काय ।{'\n'}वेदशास्त्र होय तीमत ।।४।।{'\n'}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title2}>२२   </Text>
        <Text style={styles.text}>
          हारीहरा प्रिती संगमा आली ।{'\n'}विनंती तसी सत्य शोभली ।।१।।{'\n'}
          आनुभवे आता नाचणे भले ।{'\n'}हेची श्रीवरा मानसा आले ।।२।।{'\n'}
          पुरवले तुकाविप्र आवडी ।{'\n'}कीर्तनी हारी घाली या उडी ।।३।।{'\n'}
        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title2}>२३ </Text>
        <Text style={styles.text}>
          हारी हारी दोन अक्षरे गर्जता ।{'\n'}आपार  सुकुता जोडी होये ।।१।।{'\n'}
          श्रीकृष्ण आर्जुना सांगितले स्तोत्र ।{'\n'}ॐकाराचा मंत्र मुळ हारी ।।२।।{'\n'}
          तुकाविप्र म्हणे वेद श्रुती वाणी ।{'\n'}कीर्तन रंगणी उभा हारी ।।३।।{'\n'}
        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title2}>२४   </Text>
        <Text style={styles.text}>
          हारी गुरू कीजे भक्ती ।{'\n'}नित्य युक्ती नैरास्ये ।।१।।{'\n'}
          नित्य आसावे उदासी ।{'\n'}मरणासी जाणोनी ।।२।।{'\n'}
          नित्य काळ ऐसी नवी ।{'\n'}आभ्यासावी सद्भक्ती ।।३।।{'\n'}
          क्षमा आभ्यासावी दया ।{'\n'}नित्य पाया ऐसेला ।।४।।{'\n'}
          तुकाविप्र म्हणे शांती ।{'\n'}नित्य हाती धरावी ।।५।।{'\n'}
        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title2}>२५   </Text>
        <Text style={styles.text}>
          हारीकथा तटी कृष्ण वेणीच्या ।{'\n'}पूर्व आर्चिते घडली आमूच्या ।।१।।{'\n'}
          लाभ घावला सगट सारीखा ।{'\n'}वेद शास्त्र या गर्भीचा नीका ।।२।।{'\n'}
          आनुभवे मना सुख जाहाले ।{'\n'}कीर्तनी प्रीती नाचता भले ।।३।।{'\n'}
          विजेई जाहाला विप्र हा तुका ।{'\n'}संगती विठो संत भाविका ।।४।।{'\n'}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title2}>२६   </Text>
        <Text style={styles.text}>
          हारीदिनी भ्रूगू शुद्ध कार्तिकी ।{'\n'}बरवी घावली आजी घडी हे नीकी ।।१।।{'\n'}
          संत संगती हारी कथा नवी ।{'\n'}नित्यशा उभी कृष्ण वैष्णवी ।।२।।{'\n'}
          शालिवान या शक शतावळी ।{'\n'}प्रीती यक्याण्णवी हारी कथा कली ।।३।।{'\n'}
          सहज घावली हे तनु आता ।{'\n'}त्यात चांगली श्रीहारी कथा ।।४।।{'\n'}
        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title2}>२७    </Text>
        <Text style={styles.text}>
          हारी गुरु कीर्तन करू नित्य ।{'\n'}तरोनिया जनासी तारू सत्य ।।१।।{'\n'}
          आम्हासी हे विहित समजले ।{'\n'}त्याची विचारे देहे चालविले ।।२।।{'\n'}
          तुकाविप्र विहित हे ची खरे ।{'\n'}हारी गुरु कीर्तन करू बरे ।।३।।{'\n'}
        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title2}>२८    </Text>
        <Text style={styles.text}>
          हारीहर नित्यावळी ।{'\n'}नाम संकीर्तन धुमाळी ।।१।।{'\n'}
          ब्रम्हपुरी मुख्य स्थान ।{'\n'}शिवनाथी वृंदावन ।।२।।{'\n'}
          भाक नामयाची होती ।{'\n'}केली उगवणी प्रीती ।।३।।{'\n'}
          शतकोटीचा सेवट ।{'\n'}हारीहर कृष्णा तट ।।४।।{'\n'}
          तुकाविप्र म्हणे देवे ।{'\n'}केले कौतुक बरवे ।।५।।{'\n'}
        </Text>
      </ScrollView>
    </LinearGradient>
  )
}

export default Haripath2

const styles = StyleSheet.create({
  container: {
    paddingVertical: 10,
    paddingHorizontal: 20
  },
  title1: {
    color: '#3a2b1e',
    fontSize: 20,
    fontFamily: 'VesperLibre-Bold',
    textAlign: "center"
  },
  title2: {
    color: '#3a2b1e',
    fontSize: 18,
    fontFamily: 'VesperLibre-Bold',

  },
  text: {
    color: '#3a2b1e',
    fontSize: 18,
    marginTop: 8,
    fontFamily: 'VesperLibre-Bold',
    lineHeight: 26,
    textAlign: "justify"

  },
  toptext: {
    color: '#3a2b1e',
    fontSize: 18,
    marginTop: 8,
    fontFamily: 'VesperLibre-Bold',
    lineHeight: 26,
    textAlign: "justify"

  },
  line: {
    height: 1,
    backgroundColor: 'gray',
    width: '100%',
    marginVertical: 20,
  },
})