import { Text, StyleSheet, ScrollView, View } from 'react-native'
import LinearGradient from 'react-native-linear-gradient'

const verses = [
  `सद्गुरु कृपेचा | अगाध महिमा ।
वेदा जाली सीमा | वर्णु जाता ।।
तेथे पाड काय | इतर वाणीचा ।
महिमा गुरुचा | वर्णावया ।।
सद्गुरु कृपेची | अगाध करणी ।
कीर्तन रंगणी | उमटली ।।
श्रोता वक्ता उभा | विठ्ठल समर्थ |
वदवी यथार्थ | जाले तैसे ।।

गौतमी तटाकी | आपेगांव क्षेत्र ।
परम पवित्र | पूण्यभूमी ।।
तेथील गोविंद | पंत कुलकर्णी ।
विठ्ठल स्मरणी | सर्वकाळ ।।
नीराबाई पुण्य | पवित्र अर्धांग ।
भरीव सर्वांग | प्रेमसदा ।।
पंढरीची वारी | आषाढी कार्तिकी ।
भावभक्ती नीकी | जया घरी ।।

पुत्र संततीची । धरोनीया आस ।
विनवी देवास । निराबाई ।।
हरि गुरुभक्ति । परायेण पुत्र ।
परम पवित्र । व्हावा येक ।।
देवा विनविता । प्रसन्न जाहाले ।
आपण आले । मुख्य पोटा ।।
नवविधा भक्ती । भावे आवडली ।
निराबाई जाली । पुत्रवती ।।

स्वयंभ ज्ञानाचा । पुतळा विठोबा ।
जयाचेनी शोभा । सर्व कर्मा ।।
कर तळा मळ । जया वेद चारी ।
निपुण अंतरी । सर्व विद्या ।।
पाचवे वरुषी । जाला व्रतबंध ।
ज्ञानी विठो शुद्ध । आयताची ।।
गोविंद निराई । विठोबा सहित ।
करावया तीर्थ । चालियेले ।।

करोनिया तीर्थ । उत्तर मानस ।
दक्षिण मानस । करु आले ।।
आळंदीसी आले । इंद्रायणी तीरी ।
यात्रा सिद्धेश्वरी । उतरले ।।
कुलकर्णी तेथे । मुख्ये सिद्धोपंत ।
गिरजेचा कांत । सत्वगुणी ।।
गीरीबाई सिधो । पंत उभयता ।
येवोनी समस्ता । प्रार्थियेली ।।
आश्रम पवित्र । करावा समर्थी ।
केली सिधोपंती । विनवणी ।।
यात्रा समारंभ । आणिला घरासी ।
भक्ती भावार्थेसी । पूजावया ।।
नवविधा भावे । पूजन भोजन ।
यथाशक्ती दान । सर्व केले ।।
आनंद लोटला । अर्घ विसीवरी ।
निद्रा अवसरी । स्वप्न जाले ।।

सीघोपत गीरी । बाई पोटी धन्य ।
कन्या एक रत्न । नवसाचे ।।
रख्मा देवी नाम । लावण्य सुंदरी ।
रूप मनोहर । आदिमाया ।।
स्वप्न झाले ऐसे । कन्या ही सुंदरी ।
बांधावी पदरी । विठोबाच्या ।।
गीराबाई सिधो । पंत हरुषले ।
बहु बरे जाले । देवराया ।।

तेथे तेथे स्वप्न । सारखे जाहले ।
लग्न लावियेले । समारंभ ।।
लग्न विधी यथा । स्थित उरकिला ।
निरोप घेतला । विठोबानी ।।
दक्षिण मानसे । करोनिया तीर्थे ।
पावले भावार्थे । कासीपुरा ।।
माता पिता यासी । देवाज्ञा जाहली ।
वैकुंठासी गेली । उभयता ।।

वर्णाश्रम विध । सर्व उरकला ।
संन्यास घेतला । विठोबाने ।।
नरसी आश्रम । याचे दीक्षाघारी ।
साधियेली थोरी । शांती क्षमा ।।
चैतन्ये आश्रम । नाम ठेवियेले ।
तीर्थे चालविले । करावया ।।
शिष्ये समुदाय । सहित नरसी ।
आश्रम तीर्थासी । चालीयेले ॥

धरोनिया हेत । दक्षिण भारत ।
पातले तीरास । इंद्रायणी ।।
आळंदी नगर । प्रवेश करिता ।
भेटी सिधोपंता । प्रथमची ।।
साधु सीधोपंत । आश्रयासी नेले ।
विठोबा देखिले । रख्माईने ।।
गीर्जाबाई कानी । सांगितली मात ।
पाहोनी एकांत । रख्माईने ।।
चैतन्ये आश्रम । म्हणती जयाला ।
भ्रतार आपुला । तो चि होये ।।
विभ्रांत ओळखी । पुरली सर्वांची ।
सीधोपंत साची । प्रश्न केला।।

सरस्वती स्वामी । साष्टांग नमिले ।
वृत्त सांगितले । होते तैसे ।।
नरसे ही खूण । अभंग पुरली ।
रुक्माई दिधली । विठोहाती ।।
गुरु आज्ञा मुख्य । मानुनी विठ्ठले ।
अंगिकारीयेले । रुक्माईसी ।।
विचारले स्वामी । होईल संतती ।
याची काय गति । पुढे कैसी ।।

नरसी आश्रम । बोलियेले बापा ।
होय गुरुकृपा । सुखे होकी ।।
ब्रह्मा विष्णु सीव । आदिमाया च्यार।
बाळे धुरंधर । पोटा आली ।।
चारी बाळे होता । उभयता गेली ।
वैकुंठासी भली । ब्रह्मानंदे ।।
उरली ही चार । बाले निराश्रित ।
न करिती व्रत । बंध कोणी ।।

संन्यास्याची मुले । म्हणुनी हेळती ।
तेणे चौघा चित्ती । उद्विग्न।।
निवृत्ती सोपाने । विचार बोलिला ।
जावे पैठणाला । ज्ञानदेवा ।।
अवश्य म्हणोनी । वंदिले चरण ।
चालीले पैठण । पाहावया ।।
पतित जनाचा । फेडावया पांग ।
चालीले अभंग । देव चारी ।।

पावले पैठण । नमीले भूदेव ।
सांगितला भाव । स्वागताचा ।।
व्रतबंध होणे । म्हणोनिया आलो ।
पाहोनी तोषलो । द्विजवरा ।।
जेणे लाभे आम्हा । पवित्रता गाढी ।
ते युक्ती रोकडी । करावीजी ।।
द्विज वरा भावे । करोनी विनंती ।
उभ्या वेदमूर्ती । बाळ जैसे ।।
संन्याशाची मुले । द्वेषिती म्हणोनी ।
शास्त्रार्थ पाहोनी । सकळही ।।
न मानिती द्विज । हेळोनी बोलती ।
ज्ञानदेवा चित्ती । अनुताप ।।
बोलियेले द्विज । असता रे मुला ।
तेधवा बोलीला । ज्ञानदेवो ।।
कासयाने थोरी । तुजलारे आली ।
अहंकार भुली । सांड आता ।।

वाचोनी पढोनी । शहाणे जाहाला ।
थोरपणा आला । तेणे काय ।।
उलीस दिसत । म्हणताती पोर ।
बोले विचारोत्तर । बरं की हो ।।
ज्ञानोबा म्हणती । द्विज हो ऐकारे।
ब्रह्म ठावे आम्हा । सर्व घरी ।।
ते क्षणी टोणगा । त्याच ठायी आला।
वरुनी पाखला । भरोनिया ।।

ज्ञानेश्वराकडे । पाहोनी रोकला ।
ज्ञानदेवे केला । नमस्कार ।।
का रे केले पोरा । नमन तयासी ।
तुम्हा आम्हा त्यासी । भेद काये।।
खवळले द्विज । ऐकोनिया बोल ।
समता होईल । कैसी पोरा ।।
वेद म्हणू आम्ही । तैसा म्हणे काय ।
म्हैसा येक होय । द्विज कसा।।

नवल या गोष्टी । काय द्विजराव ।
करी तरी देव । काय नव्हे ।।
हाचि रेडा वेद । करील उच्चार ।
ऐसे ज्ञानेश्वर । बोलियेले ।।
सर्वांगे भरला । द्विजाचिया कोप ।
पावला संकल्प । रेडियासी ।।
बोलेन हा रेडा । वेदा पोरा आता ।
नाही तर जाता । जीवे च्यारी ।।
या चि रेड्यापाई । नेमीले मरण ।
न बोलता जाण । वेद रेडा ।।
ज्ञानोबा म्हणती । ऐका महाराज।
येथे काय काज । बहु बोली ।।

निवृत्ती बोले । स्थीर करोनी बैसा ।
बोलेल हा म्हैसा । वेदचारी
हासीनले सर्व । बैसले निवांत ।
वदला वेदांत । पशुरेडा ।।
सांगोपांगचहु । वेदांचा उच्चार ।
केला द्विजवर । डोलविले ।।
जै जै कार केला । स्वर्गी सुरवरी ।
विमाने अंबरी । पुष्पवृष्टी ।।

प्रतिष्ठान पुरा । आनंद ओतला ।
रेडा बोलविला । ज्ञानदेवे ।।
संतोषले देव । द्विज सकळीक ।
पंडित वैदिक । अग्निहोत्री ।।
शास्त्री पुराणिक । योगी वीतरागी ।
राव रंक मुंगी । संतोषले ।।
साष्टांग नमिले । सर्वी ज्ञानेश्वर ।
सत्य अवतार । म्हणवोनी ।।

निरोप घेवोनी । तैसेचि निघाले।
नेवासीया आले । ब्रह्मानंद हे ।।
मोहनी राजाचे । देवालयी वास।
केला अनायास । मार्गी जाता ।।
तेथे सचोपंत । बाबा ठाणेदार ।
पंताचे चाकर । हेमाद्रिया ।।
रामदेव राजा । प्रधान हेमाद्रि ।
दोघे अवतारी । पुण्यवंत ।।

गीतार्थेसी चाली । अभंग जयांची ।
आवडी गीतेची । राया मना ।।
लंकेशी हेमाद्री । पंत जेव्हा गेले।
छप्पनही आणिले । ग्रंथ त्यानी ।।
छपन्न भाषेचे । छपन्न ही ग्रंथ ।
पाहिले यथार्थ । शोधोनिया ।।
राया मनी अर्थ । एकही न वाणे।
गीता योग्य लेणे । अर्थ नोहे ।।

गीतार्थ नेटका प्राकृत पाहावा ।
राजयाच्या जीवा वेध ऐसा ।।
नेवासीच्या मध्ये । संचोपंत होते ।
सकळ भावार्थ । ज्ञान सिंधु ।।
तथा हटकीले । हेमाद्री पंतानी ।
तेचि आले दिनी । ज्ञानेश्वर ।।
सचोपंत बाबा । दौलताबादेसी ।
तूर्त जावयासी । निघालेली ।।
देवाचे दर्शन । घ्यावया चालिले ।
ज्ञानोबा भेटले । देवद्वारी ।।
नमन साष्टांग । घालोनी विनंती ।
केली सचोपंती । ज्ञानदेवा ।।
मज आले जाने । दौलताबादेसी ।
राज आज्ञा ऐसी । तूर्त आहे ।।
परतोनी भेटी । याची स्थळी व्हावी।
ये विंसी करावी । आज्ञा काय ।।

करा कार्य सिद्धी । भेटी परतोनी ।
होईल कीर्तनी । याच स्थळी ।।
आज्ञा वंदोनीया । पंत चालीयेले।
दौलता पातले । बाद किल्ला ।।
हेमाद्रीपंताचे । दर्शन होतांची ।
मुख्य काज हेचि । सांगितले ।।
गीतेचा प्राकृत । अर्थ कोणी करी।
ऐसा पृथ्वीवरी । शोधकरा ।।
आज्ञा म्हणोनिया । निरोप घेतला ।
नेवासे पातला । सचोपंत ।।
ज्ञानदेवा केले । नमन साष्टांग ।
वृतांत अभंग । सांगितला ।।
आज्ञा आता काय । करणे करावी।
कार्य सिद्धी व्हावी । तूर्त ऐसी ।।
निवृत्ती बोलले । ज्ञानोबा ऐकावे ।
कार्य त्या करावे । गृहस्थाचे ।।

बरे म्हणोनिया । दिधला निरोप ।
तरणि प्रताप । ज्ञानराये ।।
सचोपंत गेले । आपुल्या घरासी ।
लागले ग्रंथासी । यत्नाचिया ।।
शाई केली साचे । कातरीले बरे ।
लेखण्या सुंदरे । सिद्ध केल्या ।।
निवृत्ती सोपान । मुक्ताई निजेली।
ज्ञानदेवे केली । युक्ती गाढी ।।

कोळसा घेवोनी । देवालयावरी ।
गीता ज्ञानेश्वरी । अर्थ केला ।।
साडेतीन घटीका । ओवी टीपण ।
गीतार्थ प्रमाण । निवडला ।।
प्रातःकाळ होता । सचोपंत आले ।
नमन घातले । ज्ञानदेवा ।।
शाई साच्या सिद्ध । लेखणी या स्वामी।
ग्रंथ मनोधर्मी । सिद्ध व्हावा ।।

ज्ञानोबाने तया । दाविले देऊळ ।
लिहीले सजळ । गीतार्थाने ।।
गीतार्थ लिहीला । देऊळा वरुता ।
येतो कैसा हाता । तुर्तातूर्त ।।
मायोत्तरे काज । अपूर्व जाहाले ।
परंतु राहिले । भिंतीवरी ।।
सचोपंत बाबा । तेणे चिंतातूर ।
देखिले साचार । निवृत्तिने ।।
निवृत्ती म्हणती ज्ञानोबा सुजाणा ।
मनीचिया जाणा गृहस्थाचे ।।
आज्ञा म्हणोनिया । लेखणी धरीली ।
ते लिहावे दिली । सचोपंता ।।

साडेतीन घटका । ग्रंथ जाला सिद्ध ।
सर्वगुण शुद्ध । निरुपम ।।
गतकाली चार । हजार तीनशे ।
नव्वद वरुसे । लोटलीया ।।
शालीवान शके । बाराशे बारात ।
सिद्ध झाला ग्रंथ । ज्ञानेश्वरी ।।
लेखीक जाहाले । सदाचिदानंद ।
बाबा नाम शुद्ध । सचोपंत ।।

टोणग्याचे मुखे । वेद सिद्ध केला ।
तैसेचि हा केला । कीर्तीघोष ।।
साडेतीन घटीका । ग्रंथ सिद्ध केला ।
पुढे देखियेला । सचोपंत ।।

ते चि क्षणी सिद्ध । सचोपंत जाले ।
चरण वंदिले । ज्ञानोबाचे ।।
ग्रंथ पाठविला । दौलता बादेशी ।
हेमाद्री पंतासी । ब्रह्मानंद ।।

राजा सदरेसी । बैसला उदार ।
सर्वज्ञ चतुर । ज्ञाननिधी ।।
तया पुढे ग्रंथ । आणोनि ठेविला ।
राजा संतोषला । बहु तेणे ।।
सचोपंती आज्ञा । राया मागितली ।
चाकरी ठेविली । पायावरी ।।
पुत्राचिया नांवे । धंदा मागितला ।
निरोप दिधला । सचोपंता ।।

हेमाद्री पंतानी । वाचियेला ग्रंथ ।
राये केला अर्थ । मना ऐसा ।।
वाक निसे अर्थ । पारसी लिहीला ।
राजा बोलियेला । जैसा तैसा ।।
येक पारायणी । जाला वीतराग ।
केला राज्ये त्याग । मनोभावे ।।
राज्ये कारभार । केला स्वाधीन पुत्राचे ।
घ्यावया ग्रंथीचे । सर्व सुख ।।

घेवोनिया ग्रंथ । वेरुळासी गेले ।
गुंफेत शिरले । चौघेजण ।।
प्रधान हेमाद्री । राजा सेनापति ।
वैराग्य विभूती । लेवोनिया ।।
पाणका ब्राह्मण । भोळा ऐसे चार ।
जाले शुद्ध नर । वीतरागी ॥
अमर असावे । न मरावे कदा ।
आनंद सर्वदा । सर्वकाळ ।।

सर्व गुण ऐसा । ग्रंथ संपादित ।
येवोनी गुंफेत । प्रवेशले ।।
सचोपंत बाबा । नेवासे पातले ।
साष्टांग नमिले । ज्ञानराज ।।
गेलीया पासोनी । जाले वर्तमान ।
देवापासी ज्ञान । सांगितले ।।
बरे जाले आता । देऊळीचा लिखा ।
उतरा नेटका । पत्रावरी ।।

येक मासाग्रंथ । पत्री उतरला ।
लिखा तो पुसिला । देऊळीचा ।।
चौदा विद्या कळा । चौसष्टी साधने ।
नाना युक्तीधने । तया ग्रंथी ।।
निवृत्तिरायाने । बुडविला ग्रंथ ।
तोही पाणीयात । ज्ञानेश्वरी ।।
सदाचिदानंद । बाबानी विनंती ।
ग्रंथ असो क्षिती । स्वामीराया ।।

तेधवा तो ग्रंथ । बाहेर काढिला ।
गळोनीया गेला । अर्थ काही ।।
नाना कळा नाना । साधनाच्या युक्ती ।
गळाल्या समस्ते । येकंदर ।।
तुटक उरला । ग्रंथार्थ जेधवा ।
बोलीले तेधवा । ज्ञानदेव ।।
पुढे अवतार । एकनाथ होणे ।
तेधवा करणे । शोध याचा ।।

आज पासोनिया । प्रमाण होतील ।
दोन शत जाले । चौऱ्यानऊ ।।
ग्रंथाचा या शोध । तेव्हा एकनाथ।
करील यथार्थ । प्रतिष्ठानी ।।
निघोनिया गेले । आळंदी क्षेत्रासी ।
वृत्त चांगयासी । कळलेही ।।
भेटीसी बैसोनी । वाघावरी आले ।
हाती धरियेले । महाफणी ।।

ज्ञानदेवा पुढे । निरोप धाडिला ।
यावे भेटायला । समारंभे ।।
ज्ञानोबा बैसले । होते भिंतीवरी ।
चालीले सामोरी । चांगदेवा ।।
देखोनिया वाघ । भिंतीसी बुजला ।
टाकोनी दिधला । चांगदेवा ।।
पडता धरणी । भूजंग पळाले ।
बारा वाटे चाले । चौदा शती ।।

उरले चांगोबा । येकुलेते येक ।
पळाले सेवक । जवळीचे ।।
चांगया ज्ञानोबा । प्रीतीने भेटले ।
भेटीसी पातले । मुक्ताईच्या ।।
मुक्ताईचे भेटी । जाला साक्षात्कार ।
चांगया साचार । उद्धरिला ।।
पंढरीसी आले । भेटी नामयाचे ।
सख्यत्व जनीचे । पाहावया ।।

चोखामेळा गोरा । कबीर सावता ।
परसा भागवत । नरहरी ।।
भाविकांच्या भेटी । जाहल्या सकळ ।
करु तीर्थावळ । चालीयेले ।।
जड मूढ प्राणी । उद्धरिले सर्व ।
रंक आणि राव । दरुषणे ।।

परतुनी आले । पंढरपुरासी ।
जोडियेल्या राशी । स्वानंदाच्या ।।
तेथे आले राव पंडित चतुर ।
कोठे ज्ञानेश्वर म्हणोनिया ।।
रेडियाचे मुखे वेद बोलविले ।
पंडित कोपले ऐकोनिया ।।
ज्ञानेश्वरा वेद बोलविसी आता ।
पंडित बोलता बंका आला ।।

बाईलेचा भाऊ चोखोमेळी याचे ।
बंकानाम त्याचे अतिशुद्र ।।
ज्ञानोबा बोलती, गड्या तूं कोणरे ।
बंका मी महार बोलियेला ।।
आडवी ओढली रेघ त्या पुढती ।
ज्ञानोबा बोलती आरता ये ।।
बंका आला आंत रेघेच्या जेधवा ।
बोलविला कोण रे तू ।।

बोलीयेला बंका शुद्र मी चांगला ।
वंदावया आलो संत पाया ।।
दुसरी ओढली रेघ तयापुढे ।
आंत आला मग बोलविला ।।
वैस्य मी चांगला बोलियेला बंका ।
पातलो पादुका बंदाबया ।।
वोढियेली रेघ त्या पुढे तिसरी ।
येताच भितरी बंका बोले ।।

कोणविचारीता क्षेत्री बोलीताहे ।
वंदावया स्वामी पाये आलो ।।
तयापुढे रेघ ओढिली चवथी ।
पालटली वृत्ती बंकयाची ।।
विचारीता कोण 'हरि' ही वदला ।
बंका बोलयेला ब्राह्मण मी ।।
आज्ञा काये स्वामी जोडियेले हात ।
ज्ञानोबा समर्थ संतराव ।।

ज्ञानदेवे तेव्हा पंडिता दाविले ।
दंड थोपटीले वकयाने ।।
ज्ञानदेवा केले पंडिते नमन ।
अवतार धन्य होयसी तू ।।
चंद्रभागे जाता उभा उभी ऐसे ।
आनंद सरीसे काज केले ।।

अवतार आला सेवटासी जेव्हा ।
चालीयेले तेंव्हा आळंदीसी ।।
सनकादिकांचा घेवोनिया मेळा ।
चालीला सावळा आळंदीसी ।।
संत समुदाय अनंत अपार ।
मध्ये ज्ञानेश्वर हरि गाती ।।
इंद्रायणी तीर आळंदी पातले ।
तारु सांगितले 'हरिपाठ' ।।

हरि नाम गर्जा नाही भय चिंता ।
खूण हे समस्ता सांगितली ।।
धाव घ्यारे बापा पंढरपुरासी ।
ठाव समर्थकासी येतुलाची ।।
डोळेभरी पहा पंढरीचा राणा ।
भावे 'हरि' म्हणा सर्वकाळ ।।
विटेवरी उभे साकार सावळे ।
महद्भुत भोळे पंढरीचे ।।

वेदांचे जीव्हार आगर सुखाचे ।
चोवीसा मूर्तीचे उद्धरण ।।
वेदांत सिद्धांत जयाला वर्णिती ।
उभी ते हे मूर्ती विटेवरी ।।
सकळ जीवांचा उद्धार सगट ।
पंढरी वैकुंठ देखलीया ।।
कोटी कळा मुक्ती पाहता कळस ।
खूण हे सर्वास सांगितली ।।

विश्वास पंढरी तारील सकळा ।
पहा येक वेळ डोळे भरी ।।
हरिनाम प्रीती सकळ ही गर्जा ।
लावा कीर्तीध्वजा सूचविले ।।
चालीले समाधी ज्ञानेश्वर जेंव्हा ।
गजर नाना परी ।।
टाळ वीणे ।।
भेटी मृदुंग चिपळी ।
कीर्तन धुमाळी ब्रह्मानंद ।।

अंबरी दाटल्या विमानाच्या दाटी ।
देव पुष्पवृष्टी करताती ।।
धन्य ज्ञानदेवा मानव जालासी ।
जन तारायासी भक्तीभावे ।।
जै जै कार केला सर्व सुरवरी ।
समाधी भिवरी प्रवेशिले ।।
अभय वरद वचन भाविक ।
दिले सकळीका येकंदर ।।

भक्तीभावे चाला बोला हरि गुण ।
तरा चारी वर्ण भवसिंधु ।।
सांडा काम क्रोध शांती क्षमाधरा ।
भव सिंधु तरा सकळीक ।।
निरोप सकळा आशिर्वाद प्रीती ।
ज्ञानदेव देती तरावया ।।
देव करील ते सहज होईल ।
पाषाण तारील जळावरी ।।

हरि भक्ती काजे सादर असावे ।
तरुनी तारावे आनिकासी ।।
जड मूढ जीव लावावे भजना ।
शेवट सुचना भाविका हे ।।
सकळही नरा कीर्तनाचे वृत्ती ।
करा क्षिरापती खेळकाला ।।
नका करु कथा बाजारी बाजार ।
माळ येकंदर लावू नका ।।

खोटे ब्रह्मज्ञान कोणा सांगू नका।
वाका संता पायी सर्व भावे ।।
नवविधा भक्ती नैराश्य कीर्तन ।
करावे साधन संत प्राये ।।
हरि म्हणा आता समाधी बैसले ।
ज्ञानदेव गेले नीजधामा ।।

नित्य नेम कथा ब्रह्मपुरी वाणी ।
विठ्ठल रुक्मिणी उरुबुरु ।।
चैत्र वसंत कृष्ण सप्तमीसी ।
भौमवार निशी कृष्णातीरी ।।
गत कली चार हजार आठशे ।
सत्तर प्रत्यक्ष चालीयेले ।।
शालीवान शक सोळासे व्याण्णव ।
श्रोता वक्ता देव दत्तात्रेय ।।

सासवडी देवा सोपान समाधी ।
ब्रह्मगीरी मधी मुक्ताबाई ।।
समाधीस्थ जाले तीर्थ कुशावर्ती ।
शंकर निवृत्ती अवतार ।।
कृष्ण येकादशी कार्तिक आळंदी ।
अभंग समाची ज्ञानोबासी ।।
देवोनी समाधी सर्व सुरवरी ।
इंद्रायणी तीरी बास केला ।।

कनकाचा तरु जयाचिये द्वारी ।
इंद्रायणी तीरी आकंदीसी ।।
अज्ञान रोविला दंड तो द्वारेसी।
पल्लव तयासी आझोनीया ।।
यात्रा समारंभ आजवरी मोठा ।
पंढरी बैकुंठा समसाम्ये ।।
आळंदी संताचे माहेर देखिले ।
पावन जाहाली जन्मांतर ।।
मोक्ष मुक्ती जया चरणा लागती ।
आळंदीसी जाती तयाचिया ।।

गुरुकृपे बीण ऐसे लाभ केचे ।
कृपे सद्गुरुचे सर्व लाभ ।।
गुरु कृपे तेथे सर्व सुख रासी ।
सप्त बोले ऐसी वेद श्रुती ।।
श्रोता वक्ता देव आपण जाहला चरित्र वदला कथारंगी ।।
ज्ञानोबाचा अवतार येकनाथ ।
वरदी श्रीदत्त प्रतिष्ठानी ।।

आदिनाथ गुरु श्री शिव शंकर ।
तयाचा मच्छेद्र उपदेसी ।।
मच्छिंद्र नाथाचे गोरक्ष बरदी ।
तयाच प्रसादी गैनिनाथ ।।
गनीचे निवृत्ती पाद प्रसादित ।
तयाचा अंकीत ज्ञानदेव ।।

आदिगुरु परात्पर नारायण ।
तयाचे प्रमाण शिष्य अत्रि ।।
अत्रीचे श्रीदत्त दत्ताचे अंकीत, ।
अभंग कलीत, जनार्दन ।।
जनार्दन वर येकनाथ राया ।
येकोबाची दया विश्वनाथ ।।
विश्वनाथ राजा कृपा विश्वेश्वर ।
त्रिमुर्ती अवतार विप्रनाथ ।।
विप्र चरणीचा, रजरेणू तुका ।
निमित्यासी लोका दाविताती ।।
तुकाविप्र म्हणे सद्गुरु महिमा ।
हरी हर ब्रम्ह जाणती ।।`,
]

const Rachitcharitra = () => {
  return (
    <LinearGradient colors={['#FFF7E6', '#FFECC2']}>
      <ScrollView style={styles.container}>
        {verses.map((block, index) => (
          <View key={index} style={styles.block}>
            <Text style={styles.text}>{block}</Text>
          </View>
        ))}
      </ScrollView>
    </LinearGradient>
  )
}

const styles = StyleSheet.create({
  container: {
    padding: 12,
  },
  block: {
    marginBottom: 22, // 👈 8 ओळी संपल्यावर समान gap
  },
  text: {
    fontFamily: 'VesperLibre-Bold',
    textAlign: 'center',
    fontSize: 18,
    lineHeight: 26,
    color: '#3a2b1e',
  }
})

export default Rachitcharitra