import { View, Text, StyleSheet, ScrollView } from 'react-native'
import LinearGradient from 'react-native-linear-gradient'

const Tatvmasi = () => {
  return (
    <LinearGradient colors={['#FFF7E6', '#FFECC2']} style={styles.container}>
      <ScrollView>
        <Text style={styles.title}>पद </Text>
        <Text style={styles.text}>
          तत्वमसि महावाक्य प्रमाण | {"\n"}भाव भक्ति प्रेम विवरण ||धृ || 		{"\n"}
          शुद्ध सत्य निखिल जे ब्रम्ह | {"\n"}तेथे इच्छा चैतन्य आगम |{"\n"}
          महतत्व माया हे उगम | {"\n"}उद्भवला ॐकार या नाम{"\n"}
          निराकार चैतन्य ते शुद्ध | {"\n"}इच्छितेची माया जाली सिद्ध | {"\n"}
          सोहं नाम तयाला प्रसिद्ध | {"\n"}अहं मात्रा ॐकारची अर्ध 		{"\n"}
          पुरुष ते प्रकृती प्रत्यक्ष | {"\n"}शुद्ध ब्रम्ह इच्छेचीया वसे |{"\n"}
          अविद्या हे आली जीव दसे | {"\n"}तुकाविप्र घट भिन्न दिसे{"\n"}
        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग </Text>
        <Text style={styles.text}>
          तत्पद प्रमाण परमात्मा ईश्वर | {"\n"}तोची सवीकार | जीवात्मा हा त्वं  पद {"\n"}
          सस्वरूपाचा या विसर जेधवा | {"\n"}आविद्या तेधवा | तेची होये प्रसिद्ध {"\n"}
          पूर्ण चैतन्य ते परमात्मा होये | {"\n"}प्रत्यक्ष चैतन्य हे  | जीवआत्मा म्हणती {"\n"}
          अनात्मा त्रिगुण भूत साधन जे | {"\n"}प्रपंचे सहजे | तुकाविप्र शरीर 	{"\n"}
        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग </Text>
        <Text style={styles.text}>
          अहं अर्ध मात्रा | वोंकारा पासून | {"\n"}मात्रा जाल्या तीन | आ उ म या सहज{"\n"}
          आकार प्रथम उकार दुसरी | {"\n"}मकार तिसरी | मात्रा ऐशा ॐकारी{"\n"}
          जेथे जन्म हरी हार ब्रम्हा दीका | {"\n"}तिन्ही मात्रा देखा | पिंड ऐसी रचना{"\n"}
          देह मात्रा मुळ | प्रकृती ॐकार | {"\n"}त्याचा सर्वेश्वर | अभिमानी होये की{"\n"}
          सर्व साक्षी तेथे | आवस्था विचार | {"\n"}म्हणे तुकाविप्र | परा वाचा तेथीली{"\n"}
        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>पद </Text>
        <Text style={styles.text}>
          माया देहे दूसरा बोलीयेला | {"\n"}अभिमानी की हो रुद्र त्याला{"\n"}
          वाचा पश्यन्ति होये दुजी तेथे | {"\n"}तये स्थानी मकार मात्रा सत्य{"\n"}
          आवस्था हे प्रलय तये स्थानी | {"\n"}वर्म जाणती गुरु भक्त ज्ञानी{"\n"}
          सत्य तिसरा हिरण्य गर्भ देहे | {"\n"}तेथे मात्रा उकार जननी हे{"\n"}
          वाचा मध्यमा विष्णु अभिमानी | {"\n"}स्थिति अवस्था ऐसे देह तीनी{"\n"}
          देहे विराट अभिमानी ब्रम्हा | {"\n"}सृष्टि अवस्था आकार मात्रा नेमा{"\n"}
          वाचा वैखरी विप्र म्हणे तुका | {"\n"}जेथे उद्धव वेद सकळीका{"\n"}
        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग </Text>
        <Text style={styles.text}>
          स्थिति उत्पत्ति संहार | {"\n"}तिन्ही देवाचा व्यापार{"\n"}
          कोणा पासोनिया कोण | {"\n"}जाला विस्तार प्रमाण{"\n"}
          आवधानी प्रीती द्यावी | {"\n"}पिंड रचना ऐकावी{"\n"}
          जीव आत्मा कोणे रीती | {"\n"}वाहाडला त्रिजगति{"\n"}
          सत्व अहंकारी भला | {"\n"}जन्म अंतकर्णा जाला{"\n"}
          अहंकार चीत बुद्धी | {"\n"}मन अंतकर्ण आधी{"\n"}
          तुकाविप्र म्हणे ऐका | {"\n"}श्रोत्या सकळ भावीका{"\n"}
        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग </Text>
        <Text style={styles.text}>
          आत्मयासी याची द्वारे | {"\n"}होये विवेक संचारे{"\n"}
          मन बुद्धी आणि चित्त | {"\n"}चौथा अहंकार सत्य{"\n"}
          अंतकर्ण हे पाचवे | {"\n"}देह वर्तवी स्वभावे{"\n"}
          अंतकर्णी हेत जाला | {"\n"}तोची मनासी कळला{"\n"}
          होये नोहे म्हणे मन | {"\n"}बुद्धी निवडती ज्ञान{"\n"}
          चित्त निश्चयासी आणी | {"\n"}अहंकारी ते करणी 		{"\n"}
          तुकाविप्र अंतकर्ण | {"\n"}पाई सद्गुरू प्रमाण {"\n"}


        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग </Text>
        <Text style={styles.text}>
          सत्व अहंकारी जाला | {"\n"}आता राजस बोलला{"\n"}
          राजस या  अहंकारी | {"\n"}जाली इंद्रिये ही खरी{"\n"}
          चक्षु रसना श्रवण | {"\n"}त्वचा पाचवे ते घ्राण{"\n"}
          शब्द स्पर्श रुप रसे  | {"\n"}गंध विषय हे ऐसे{"\n"}
          वाचा पाणी हे चळण | {"\n"}गुद उपस्थ प्रमाण{"\n"}
          सूष्ट दुष्ट कर्म होती | {"\n"}गुण इंद्रिया संगती{"\n"}
          अहंकारी या राजसे | {"\n"}तुकाविप्र नाचतसे{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>पद </Text>
        <Text style={styles.text}>
          तामस अहंकारी अहंकारी{"\n"} तत्वे जाहाली खरी |धृ|{"\n"}
          तामस अहंकारी जन्मले | {"\n"}आकाश निर्मळ हे चांगले |{"\n"}
          वायो आकाशी जन्मला | {"\n"}आणि तेजासी या व्याला{"\n"}
          वायो पासूनी जाले तेज | {"\n"}तेजी आप जाले सहज{"\n"}
          पृथ्वी आपी हे जन्मली | {"\n"}सर्वा आधार होती जाली{"\n"}
          तुकाविप्र म्हणे गुण | {"\n"}भुते ऐकावी प्रमाण{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>पद </Text>
        <Text style={styles.text}>
          ऐका गुणभुते गुणभुते | {"\n"}पंच पंचवीस ते | धृ |{"\n"}
          अस्थि मांस त्वचादी रोम | {"\n"}नाडी पृथ्वी पासूनी जन्म{"\n"}
          पृथ्वीचे घर स्वाधीष्टान | {"\n"}जिव्हा मुख आणि पीत वर्ण{"\n"}
          स्वाद गोड पर्णरस आहार | {"\n"}फरश अंकुश दोनी शस्त्र{"\n"}
          तुकावीप्र म्हणे बोलीली  | {"\n"}पृथ्वीचे हे खूण जाहाली{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग </Text>
        <Text style={styles.text}>
          पंचवीस भुते पंचवीस गुण | {"\n"}तयाचा प्रमाण | विस्तार हा{"\n"}
          पृथ्वी जाली आता आपाचा विस्तार | {"\n"}ऐका आदरे | भावीक हो{"\n"}
          लाळ मूत्र श्रूक श्रोणित हे श्वेद | {"\n"}आपाचे प्रसिद्ध गुण हे{"\n"}
          घर नाभी आणि वर्ण असे श्वेत | {"\n"}मुख त्या उपस्थ स्वाद क्षार{"\n"}
          आहार मैथुन सूरी याचे शस्त्र | {"\n"}म्हणे तुकाविप्र आप ऐसे{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग </Text>
        <Text style={styles.text}>
          पृथ्वी जाले आप | जाले आता तेजे | {"\n"}विस्तार सहज | ऐकावा की{"\n"}
          क्षुधा तृषा निद्रा | आळस कांती हे | {"\n"}तेजांश हा होये | रक्त वर्ण{"\n"}
          हृदय भुवन | तेजाचे हे घर | {"\n"}देखणे आहार | मुख नेत्र{"\n"}
          स्वाद त्याचा असे | सहज तिखट | {"\n"}भाला हे प्रगट | शस्त्र त्याचे{"\n"}
          तुकाविप्र म्हणे | विस्तार तेजाचा | {"\n"}जाला आता साचा | वायो ऐका{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग </Text>
        <Text style={styles.text}>
          पृथ्वी आप तेज | तीहीचा विस्तार | {"\n"}जाला आता सार | वायो ऐका{"\n"}
          धावन वळण निरोध आकोंच | {"\n"}पसरण पांच | वायोचे हे{"\n"}
          घर कंठ स्थान | वर्ण असे निळा | {"\n"}स्वाद असे आम्ला | मुख नाक{"\n"}
          वोडण खांड हे दोनी वायो शस्त्रे | {"\n"}परिमळ आहार प्रमाणची{"\n"}
          तुकाविप्र म्हणे | विस्तार वायोचा | {"\n"}जाला आकाशाचा | ऐका आता{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग </Text>
        <Text style={styles.text}>
          क्रोध लज्जा भय | द्वेष मोह ऐसे | {"\n"}आकाशाचे अंश | पांच हे की{"\n"}
          याचा असे वास | ललाटाचे ठायी | {"\n"}मुख याचे पाही | श्रवण हे{"\n"}
          आहार ऐकणे | वर्ण याचा काळा | {"\n"}प्रचीत सकळा | स्वाद कडू{"\n"}
          शस्त्र असे बाण | आकाश या रीती | {"\n"}बोले वेद श्रुती | महावाक्ये{"\n"}
          तुका विप्र म्हणे | आता पुढे ऐका | {"\n"}प्रीती सकळीका | सूचना हे{"\n"}
        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग </Text>
        <Text style={styles.text}>
          आप निद्रा करी | पृथ्वी बोलतसे | {"\n"}वेदार्थ सुरस | श्रुती शास्त्र{"\n"}
          तेज पहातसे | नाना पदार्थासी | {"\n"}अक्षर ज्ञानासी | व्हावयाला{"\n"}
          वायो चालतसे | देहासी घेवोनी | {"\n"}आकाश ऐकोनी | सुखरूप{"\n"}
          तुकाविप्र म्हणे | पाचांचा स्वभाव | {"\n"}सहज अपूर्व | वेगळाला{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>पद </Text>
        <Text style={styles.text}>
          पंच तत्व तनु आकारली | {"\n"}साहित्यही त्यास योजीली ||धृ ||{"\n"}
          नामे दाहा एकाची प्राणाची | {"\n"}वेगळाली वर्तणूक ज्यांची | {"\n"}प्रीती नामे ऐकावी तयाची | {"\n"}प्रथमता नाम हे प्राणची{"\n"}
          व्यानोदान आपान समान | {"\n"}पांच पिंडी प्राण हे पवन | {"\n"}क्रीया याची देहे वर्तमान | {"\n"}ऐकावी श्रोते प्रीती आनंदाने{"\n"}
          प्राणश्री श्वासो श्वासी वेरझार | {"\n"}करीतसे नित्य निरंतर | {"\n"}अन्नोदक करीतो आहार | {"\n"}अभंग हा तयाचा व्यापार{"\n"}
          व्यान रस धातुसी निवडी | {"\n"}सांदोसांदी पोहोचवी गोडी | {"\n"}तेणे होये शरीरा वाहाडी | {"\n"}तेणे होये शरीरा वाहाडी{"\n"}
          मळमूत्र आपान सारीतो | {"\n"}सर्व संधी समान लवतो | {"\n"}पाचाचाही व्यापार नित्य तो | {"\n"}तुकाविप्र आनन्द गर्जतो{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>पद </Text>
        <Text style={styles.text}>
          पिंडाधी पती जाहाले देहाचे | {"\n"}ब्रम्हांडासी धीपती हे पांच ||धृ ||{"\n"}
          नाग आणि कूर्म देवदत्त | {"\n"}धनंजये कर्कश विख्यात | {"\n"}ब्रम्हांडाचा  व्यापार हे कर्ते | {"\n"}पंचांग या ज्ञानासी जाणते{"\n"}
          जांभईसी देत असे नाग | {"\n"}कूर्मा घरी ढेकर प्रसंग | {"\n"}हास्य रुदनेचे सर्व अंग | {"\n"}देवदत्त शिंकतो अभंग{"\n"}
          आंगमोडा देतो धनंजये | {"\n"}ऐसे पिंड ब्रम्हांड दहा हे | {"\n"}पिंड ऐसा प्रपंचची होये | {"\n"}ज्ञान ऐसे पिंड चालता हे{"\n"}
          आकाशाचा होये हा कर्कश | {"\n"}नाग असे वायोचा प्रत्यक्ष | {"\n"}ढेकूर हा कूर्म आप  तेज | {"\n"}देवदत्त आपाचा निशे:श{"\n"}
          धनंजये पृथ्वीचा प्रमाण | {"\n"}देहाचीया मेळी सर्व प्राण | {"\n"}जीव भाव नसे प्राणेवीण | {"\n"}प्रपंच हा तुकाविप्र म्हणे{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग </Text>
        <Text style={styles.text}>
          ऐशा रचियेल्या स्थूळा | {"\n"}सांगितल्या साक्षी कळा |{"\n"}
          प्राण बिजा पासोनिया | {"\n"}रुप प्रपंच तनु या{"\n"}
          ऐसा तत्व योग साचा | {"\n"}छत्तीस हा विभागाचा |{"\n"}
          जाणती हा क्षेत्र योग | {"\n"}तेची अध्यात्मीयेचा ग{"\n"}
          तुकाविप्र म्हणे प्रीती | {"\n"}ऐसे नेणे मूढ मती{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग </Text>
        <Text style={styles.text}>
          आंतकर्ण श्रोता प्रती | {"\n"}येते व्यानाचे संगती{"\n"}
          तेथोनीया असे चित्त | {"\n"}वाचा शब्दा प्रती सत्य{"\n"}
          ऐसे पांच गुण भले | {"\n"}लीन आकासी जाहाले{"\n"}
          मग संगती समान | {"\n"}त्वचे प्रती येते मन{"\n"}
          स्पर्श विषयाची घेणी | {"\n"}करी चेष्टवोनी पाणी{"\n"}
          एवं तुकाविप्र म्हणे | {"\n"}पवनी हे पांच लीन{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग </Text>
        <Text style={styles.text}>
          उदानासी हाती धरी | {"\n"}बुद्धी चढे दृष्टीवरी{"\n"}
          चरणा चेष्टवी निवडी | {"\n"}रुप तेजाचे आवडी{"\n"}
          चित्त प्राणचीया सवे | {"\n"}रसनेचा ठाव पावे{"\n"}
          सीस्ना चेष्टवोनी प्रीती | {"\n"}धावे रती रसा प्रती{"\n"}
          एवं  पांच जणी जळी | {"\n"}देवोनीया बुटकुळी{"\n"}
          जाली पृथ्वीसी मिळणी | {"\n"}तुकाविप्र वदे वाणी{"\n"}
        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग </Text>
        <Text style={styles.text}>
          आता पृथ्वीचीया मेळी | {"\n"}आली ऐकावी सकळी{"\n"}
          अहंकाराचीया मती | {"\n"}वायु अपाना संगती{"\n"}
          घ्राणा प्रती येत असे | {"\n"}गंधा निवडी उल्हासे{"\n"}
          येवं पंचप्राण घोडा | {"\n"}होये मन वृत्ती आरूढा{"\n"}
          सर्व आंगी पसरोनी | {"\n"}आसे एवढा लक्षणी{"\n"}
          तुकाविप्र म्हणे साचे | {"\n"}लिंग देह वासनेचे{"\n"}


        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>पद </Text>
        <Text style={styles.text}>
          आकर्म कर्म | {"\n"}काहीच आत्मा नेणे ||धृ ||{"\n"}
          नाही अभिमान ज्याला | {"\n"}कर्ता आकर्ता हा त्याला | {"\n"}नाम रुप वार्ता गुणे{"\n"}
          जेथे इच्छा उपक्रम | {"\n"}तेची निष्कर्मीया कर्म | {"\n"}जन्म चराचर होणे |{"\n"}
          होवोनीया इच्छायुक्त | {"\n"}आसक्त तो जाला सक्त | {"\n"}महतत्व प्रगटणे{"\n"}
          प्रगटले महतत्व | {"\n"}उभारले गुण सर्व | {"\n"}तुकाविप्र जीव प्राणे{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग </Text>
        <Text style={styles.text}>
          तया कर्म संचिताचा जाला व्यये | {"\n"}तेथे गुणत्रये उभारले सहज{"\n"}
          देव त्रये शक्ती सह वर्तमान | {"\n"}जाहाले उत्पन्न | {"\n"}ब्रम्हा विष्णु महेश{"\n"}
          तिन्ही देव हेची तिन्ही अहंकार | {"\n"}शक्ती प्रतिकर कारण हे उपाधी{"\n"}
          तुकाविप्र म्हणे ईश्वराची माया | {"\n"}आज्ञान बोलाया | {"\n"}नाहीच की दुसरी{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          स्वरूपी जाहाले अज्ञान उदित | {"\n"}कारण तयाते | {"\n"}म्हणतात प्रसिद्ध{"\n"}
          जे का प्रसवले अद्भुत प्रपंच | {"\n"}आज्ञान कंदाचे | {"\n"}मग तया अंकुर{"\n"}
          होते जाले मग लिंग ते शरीर | {"\n"}वासना आकार होये सत्य जयाचा{"\n"}
          वासनामय हे दृष्टीसी दुर्गम | {"\n"}म्हणोनी सुक्षम | {"\n"}तुकाविप्र वायो हे{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग </Text>
        <Text style={styles.text}>
          इच्छाशक्ती असे सत्वगुण | {"\n"}जन्म अंतकर्ण चेतुष्ट्य हा जाहला{"\n"}
          जीव रुप तया पाचाशी वर्तने | {"\n"}अंतकर्ण मन बुद्धी चित्त अहंता{"\n"}
          अंतकर्ण उगा संकल्प ऊठीजे | {"\n"}तयासी म्हणे जे मन करू न करू{"\n"}
          तुकाविप्र म्हणे नेमोनीया सांगे | {"\n"}तेची बुद्धी मग लक्ष सांगे प्रमाण{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          सांगितले तेच धरिले जिव्हारी | {"\n"}ऐसे ते निर्धारी चीत रुप जाणावे{"\n"}
          अहंकार तोची धरील्या त्या अर्था | {"\n"}स्वीकार ममता | {"\n"}त्याग करी जाणोनी{"\n"}
          ऐसीया प्रकारे सत्वाची संतती | {"\n"}रुप यथा व्यक्ति | {"\n"}केले असे अभंग{"\n"}
          तुकाविप्र म्हणे रज स्थिति आता | {"\n"}ऐका भावे श्रोता | {"\n"}वक्ता हरी विठ्ठल{"\n"}
        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          कर्मेंद्रीये ज्ञानेंद्रिये दहा जण | {"\n"}पंधरा प्रमाण | पंच प्राणे सहित{"\n"}
          पाचा तत्वाचे हे पाच पांच गुणे | {"\n"}वाटणी प्रमाणे | स्थूल देहे उभारा{"\n"}
          आस्थी मांस त्वचा नाडी रोम पृथ्वी | {"\n"}मिळाली बरवी | पांच पाचा प्रकारे{"\n"}
          आपी मास तेजी त्वचा नाडी वायो | {"\n"}रोम नभी स्वंयो | आस्थी तुकाविप्र श्री{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>सौरी </Text>
        <Text style={styles.text}>
          पाचा ठायी पाचा रीती क्षिति मिसळली | {"\n"}आप ऐसे पांचा ठायी आनायसे चाली{"\n"}
          मूत्र आपी रक्त तेजी लाळ वायो प्रती | {"\n"}वीर्य तेज आकाशासी स्वेद असे क्षिति{"\n"}
          तेज क्षुधा आप | त्रशा वायो मैथुनासी | {"\n"}तुकाविप्र नभी निद्रा क्षीती आळसासी{"\n"}
        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>सौरी </Text>
        <Text style={styles.text}>
          पाच आंगे पाचा ठायी वायो मिसळला | {"\n"}प्रसरण आकाशासी वायो देता जाला{"\n"}
          धावनासी आपणा ठेवीतसे वारा | {"\n"}निरोधन ते तेजा प्रती भाग दिला खरा{"\n"}
          वळण हे आपा प्रती पृथ्वी आकोचना | {"\n"}वायो ऐसा पाचा ठायी तुकाविप्र म्हणा{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>वोवी </Text>
        <Text style={styles.text}>
          भय आकाशाचा अंश | {"\n"}आकाशी हा सदा असे | {"\n"}द्वेष वायोस राग तेजास | {"\n"}लोभ आपास मोह पृथ्वी{"\n"}
          पंचवीस पाचा पांचा | {"\n"}मेळ झाला तत्वांचा | {"\n"}आकार हा स्थूल देहाचा | {"\n"}हा कळलीया परिचयो{"\n"}
          ऐसे कळलीयावीन  प्रीती | {"\n"}नोहे आत्म ती प्रतीति | {"\n"}लिंग देहाची तत्वे प्रीती | {"\n"}याची रीती वाटावी{"\n"}
          पंच महाभूताचे विशेष | {"\n"}गुण दिसती प्रत्यक्ष | {"\n"}गंध रुप शब्द स्पर्श रस | {"\n"}वर्तत असे आंतकर्ण{"\n"}
          आहंकार आपान घ्राण गंध स्वेद | {"\n"}हे पृथ्वीचे गुण प्रसिद्ध | {"\n"}आकासी अहंकार | {"\n"}अपान वायो शुद्ध{"\n"}
          तेज गंध आपी | {"\n"}ऐसी क्षिति मिळाली हे पाचा प्रती | {"\n"}तुकाविप्र म्हणे श्रोती | {"\n"}दिजे प्रीती आवधान{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग दिडका </Text>
        <Text style={styles.text}>
          आप मिळाले पाचास{"\n"}आता कैसे ऐकावे |{"\n"}
          चित्त आणि जिव्हा प्राण | {"\n"}रस सीस्न पांच हे{"\n"}
          चित्त आकासी दिधले | {"\n"}वायो दिले प्राणासी |{"\n"}
          जिव्हा दिधली तेजासी {"\n"}आपासी रस हा{"\n"}
          सीस्न पृथ्वीसी नेमीले | {"\n"}ऐसे जाले आप हे |{"\n"}
          तेज गुण आता ऐका | {"\n"}सकळीका सूचना{"\n"}
          तुकाविप्र म्हणे आप | {"\n"}हा संकल्प जाहाला{"\n"}
        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग दिडका </Text>
        <Text style={styles.text}>
          तेजाचे हे पांच गुण | {"\n"}आता देणे पाचासी{"\n"}
          बुद्धी उदान हे दोन | {"\n"}चक्षु तीन रुप हे{"\n"}
          पादा सहित हे पांच | {"\n"}गुण साच तेजाचे{"\n"}
          बुद्धी दिधली आकासी | {"\n"}हा वायोसी उदान{"\n"}
          चक्षु तेजीच राहिले | {"\n"}रुप दिले आपासी{"\n"}
          पाय दिधले पृथ्वीला | {"\n"}ऐसा जाला विभाग{"\n"}
          तुकाविप्र म्हणे पांच | {"\n"}पवनाचे ऐकावे{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग दिडका </Text>
        <Text style={styles.text}>
          स्पर्श पाणी मन त्वचा | {"\n"}हा वायोचा समान{"\n"}
          मन दिधले आकासी | {"\n"}आपणा पासी समान{"\n"}
          त्वचा तेजासी दिधली | {"\n"}आपा भली स्पर्शणी{"\n"}
          पृथ्वी प्रती दिले पाणी | {"\n"}हे मिळणी वायोची{"\n"}
          आता मिळणी आकाश | {"\n"}पांच आकाश पाचासी{"\n"}
          तुकाविप्र म्हणे श्रोती | {"\n"}हे पुढती ऐकावे{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग </Text>
        <Text style={styles.text}>
          पांच आकाश आकार | {"\n"}व्यान श्रोत अंतकर्ण{"\n"}
          शब्द वाचा सार सत्य | {"\n"}गुण नित्य आकाश{"\n"}
          आंतकर्ण आकाशात | {"\n"}व्यान देत वायोसी{"\n"}
          श्रोत्र अंश ठेवीयेला | {"\n"}तेजी भला आकाशे{"\n"}
          शब्द आपी वाचा मही | {"\n"}पाचा ठायी मिळाली{"\n"}
          तुकाविप्र स्वामी भेटी | {"\n"}आर्थ गोष्टी अभंग{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>पद </Text>
        <Text style={styles.text}>
          पाचाचे हे पंचवीस गुण | {"\n"}देही वावरे चळण हे जाण{"\n"}
          शरीरी हा त्रिशून्य मार्ग चाले | {"\n"}तिन्ही वाटा ओंकार होते जाले{"\n"}
          भव बंधाचा ठाव पुसे चौथे | {"\n"}प्राणापान हे मावळती जेथे{"\n"}
          त्रिशून्य हे तयासी म्हणताती | {"\n"}चौथे व्यापक सर्व मोक्ष मुक्ती{"\n"}
          तुकाविप्र ते मोक्ष मुक्ती पद | {"\n"}भक्ति वदे भावार्थ श्रुती वेद{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          आद्य शून्य मध्य शून्य ऊर्ध्व शून्य | {"\n"}आणि चतु शून्य निशून्य ते{"\n"}
          आद्य शून्य तेची आकार मात्रका | {"\n"}उकार मात्रका मध्य शून्य{"\n"}
          मकार मात्रका हे ऊर्ध्व शून्य होये | {"\n"}चैतन्य ते होये ओंकारची{"\n"}
          सोहं ब्रम्ह चहु शून्याही परते | {"\n"}असे अलिप्त ते वर्ततसे{"\n"}
          एवं महाशून्य सत्य चतुर्विध | {"\n"}पिंडी चारी शुद्ध तुकाविप्र{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          पिंडी चारी शून्य ऐकावी प्रमाण | {"\n"}गुरुपुत्रा खूण समजावी{"\n"}
          आद्य शून्य मन चंचल जाणिजे | {"\n"}पवन म्हणीजे ऊर्ध्व शून्य{"\n"}
          मध्य शून्य जीव चौथे परब्रम्ह | {"\n"}निर्गुण त्या नाम | {"\n"}निराकार{"\n"}
          निसंग ते निर्विकार पूर्ण घन | {"\n"}ऐसे समजोन योग सिद्ध{"\n"}
          तुकाविप्र म्हणे शून्य कथा ऐसी | {"\n"}पुढे कथा कैसी ऐकावी ते{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          वोंकारावरी ही शून्य बोलताती | {"\n"}सत्य नव्हे युक्ति परंतु ते{"\n"}
          प्रमाण ते नव्हे जीवकृत होये | {"\n"}तार्किक वाद बोला बोली{"\n"}
          चीदाकाश सर्व भूत क्षर तोची | {"\n"}निर्गुण ही तोची अक्षर की{"\n"}
          कुटस्थ निर्गुण अक्षर ऐसीया | {"\n"}क्षराक्षराची व्याव्यावृत तो{"\n"}
          तुकाविप्र म्हणे पुरुष उत्तम | {"\n"}पूर्ण परब्रम्ह सदोदित{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          क्षराक्षरातीत उत्तम पुरुष | {"\n"}भरीत प्रत्यक्ष वेद शास्त्र{"\n"}
          वेद शास्त्र जो का पुराण भरीत | {"\n"}उत्तम विख्यात पुरुष तो{"\n"}
          ऐसे तत्वमसी महावाक्य ज्ञान | {"\n"}जाहाल्या समान जीवेश्वर{"\n"}
          जीव ईश्वराची ऐक्यता प्रसिद्ध | {"\n"}जाणीतल्या शुद्ध महावाक्य{"\n"}
          तुकाविप्र महावाक्याचा गजर | {"\n"}प्रमाण साचार बिजाचा हा{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>पद   </Text>
        <Text style={styles.text}>
          उठले ब्रम्ह | {"\n"}सागरी तरंग हे |धृ |{"\n"}
          स्वरूपासी विसरले | {"\n"}जीव दशे प्रती आले | {"\n"}देहा दीक प्रमाण हे{"\n"}
          अविद्येचा संग जाला | {"\n"}जीव दशा ईश्वराला | {"\n"}यासी ज्ञान तारू होये{"\n"}
          ज्ञान सूर्य उदेजल्या | {"\n"}सर्व दिशा उजळल्या | {"\n"}परब्रम्ह दिसत हे{"\n"}
          तम गेला अविद्येचा | {"\n"}क्षुधांश तो ब्रम्ही साचा | {"\n"}तुकाविप्र नर देहे{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          स्थूल अवस्था जागृती | {"\n"}लिंग देहाची ही स्थिति{"\n"}
          सूशूप्ती  हे कारणांची | {"\n"}ऐसी आहे प्रसिद्धची{"\n"}
          स्थूल अभिमानी विश्व  | {"\n"}लिंगाभीमानी तैजसू{"\n"}
          प्राज्ञ कारणाभीमानी | {"\n"}विश्व वसे दृष्टी स्थानी{"\n"}
          कंठ स्थानी हा तेजस | {"\n"}प्राज्ञ ह्रदयीच वसे{"\n"}
          त्रय अवस्था या भेदे | {"\n"}अभिमानी च्या संबंधे{"\n"}
          मनोवृत्ति विषयाचे | {"\n"}ज्ञान तुकाविप्र साचे{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          स्थूल लिंग हे कारण | {"\n"}होये उपाधी प्रमाण{"\n"}
          रुपे प्रणव चांगले | {"\n"}तिन्ही गुण विस्तारले{"\n"}
          अन्नमय प्राणमये | {"\n"}तीसरे ते मनोमये{"\n"}
          कोश विज्ञान चवथे  | {"\n"}पाचवे ही आनंद ते{"\n"}
          ऊसाचीया पोटी रस | {"\n"}आत्मा तैसा पंच कोश{"\n"}
          तुकाविप्र म्हणे भले | {"\n"}आत्मतत्व निवडले{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>पद  </Text>
        <Text style={styles.text}>
          आजपा हे गायत्री पिंडीची | {"\n"}श्रोत्या प्रीती आहे ऐकायाची ||धृ ||{"\n"}
          आधारते चक्र गुद स्थान | {"\n"}रिद्धी सिद्धी शक्ती रक्त वर्ण | {"\n"}गणपती देव प्रमाण | {"\n"}ऋषि तेथे ईश्वर प्रसन्न{"\n"}
          जप सहा चार मात्रा | {"\n"}मंत्र मुख्य दोनीच अक्षरा | {"\n"}चतुर्दळी अवस्था पवित्रा | {"\n"}आहेतीया ठाव्या गुरु पुत्रा{"\n"}
          स्वाधीष्ठान लिंगस्थानी होये |{"\n"}अग्नी ऋषि  पीतवर्ण ते हे | {"\n"}ब्रम्हदेव तेथे देवता हे | {"\n"}सत्य तेथे सावित्री शक्ती हे{"\n"}
          सहा दळी सहा मात्रा सार | {"\n"}जप होत असे सहा हजार | {"\n"}मुळ मंत्र दोनची अक्षर | {"\n"}आजपा हा जप निरंतर{"\n"}
          मणिपूर चक्र नाभी स्थान | {"\n"}वर्ण नीळा विष्णु देव धन्य | {"\n"}शक्ती तेथे कमळा आपण | {"\n"}वायो ऋषि त्या दळी प्रमाण{"\n"}
          दहा दळे दहा मात्रा जप | {"\n"}नित्यसा हा सहस्त्र संकल्प | {"\n"}जपेवीण म्हणोनी आजप | {"\n"}अनुहात ऐकावा प्रताप{"\n"}
          अनुहात ह्रदये भुवन | {"\n"}उमा शक्ती देव त्रीनयन | {"\n"}सूर्य ऋषि प्रकाशितमान | {"\n"}बारा मात्रा बारा दल ज्ञान{"\n"}
          जप सहा सहस्त्र गर्जना | {"\n"}विशुद्ध हे चक्र कंठ स्थाना | {"\n"}शुभ्र वर्ण शोभा भिन्न भिन्ना | {"\n"}शक्ती जेथे अविद्या निधाना{"\n"}
          जीव देव चंद्र ऋषि जेथे | {"\n"}जप सहा सहस्त्रची तेथे | {"\n"}सोळा मात्रा सोळा दले सत्ये | {"\n"}आता श्रोते द्वीदळ ऐकाते |{"\n"}
          अग्नि चक्र वर्ण शुद्ध ज्योति | {"\n"}भ्रुकुटीचा मध्यभाग क्षिति | {"\n"}हंस ऋषि माया देवी शक्ती | {"\n"}परमहंस देव शोभताती{"\n"}
          दोनी दले दोनी मात्रा थोर | {"\n"}जप तेथे एकची मात्रा सहस्त्र | {"\n"}ब्रम्ह रंध्री सहस्त्रची सार | {"\n"}आत्मादेव गुरु रुशेश्वर{"\n"}
          ज्ञान शक्ती ऊर्ध्व द्वारे येता | {"\n"}वायो तेथे होये संचरता | {"\n"}अहंकाराचे मुळची तत्वता | {"\n"}सहस्त्र दळी तुकाविप्र सत्ता{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          सहस्त्र दल ते अहंकाराचे मुळ | {"\n"}ते ठायी बहळ नाना ध्वनि होताती{"\n"}
          सोहं केवळ ते गुरूस्थान होये | {"\n"}अनेक वर्ण हे तया स्थळी सहज{"\n"}
          जेथे ज्ञान शक्ती परमात्मा देवता | {"\n"}तया गुरूनाथा नमन हे साष्टांग{"\n"}
          तुकाविप्र म्हणे बावन मात्रका | {"\n"}साता चक्री ऐका आजपा याज प्रती{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          व पासोनी श ही चारीच अक्षरे | {"\n"}चक्र मुलाधारे सहा शत जपासी{"\n"}
          स्वाधीष्टान चक्री सहा मात्रा सिद्ध | {"\n"}ब पासोनी शुद्ध ल  पर्यन्त अक्षरे{"\n"}
          मणीपुरी अक्षरांची ही गणना | {"\n"}ऊ पासोनी जाणा फ पर्यन्त ते दहाही{"\n"}
          क पासोनी ठ पर्यन्त मात्रा बारा | {"\n"}अनुहात चक्रा बारा दळी शोभती{"\n"}
          सोळा स्वर मात्रा विशुद्ध ठिकाणी | {"\n"}द्वीदलासी दोनी नेमिली अक्षरे{"\n"}
          तुकाविप्र म्हणे उरले ते बीज |{"\n"}सोहं मात्र नीज एकवीस सहस्त्र{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          सहा शत आणि एक्वीस हजार | {"\n"}प्राण येरझार श्वासो श्वासी करीतो{"\n"}
          साकार तो सत्य आत ओढतसे | {"\n"}बाहिर येतसे हाकार तो प्रसिद्ध{"\n"}
          सोहं मंत्र बीज पिंड ब्रम्हांडासी | {"\n"}पन्नास मात्रासि रुप दोन अक्षरे{"\n"}
          गुरुपूत्र ज्ञानी जप हा जाणती | {"\n"}अजपा म्हणती वेद शास्त्री पुराणी{"\n"}
          तुकाविप्र म्हणे क्रिया दळ प्राण | {"\n"}आजपा संपूर्ण पुढे आता ऐकावे{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          त्रिकुट श्रीहाट तिसरे गोल्हाट | {"\n"}चौथे औटपीठ गुंफा पांच भ्रमर{"\n"}
          आत्मयाचे स्थान सहस्त्रदळ ते | {"\n"}ब्रम्ह रंध्र सत्य शेवटील सहावे{"\n"}
          मुख हे त्रिकुट शोभा शाम वर्ण | {"\n"}ते ठायी प्रमाण ऋषी पृथ्वी येसणा{"\n"}
          लिंग ते आच्यार ऋग्वेद ते स्थळी | {"\n"}जागृती वेल्हाळी अवस्था ते ठिकाणी{"\n"}
          तुकाविप्र म्हणे कमळासण देव | {"\n"}ऐसी हे अपूर्व त्रिकुटीची रचना{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          रसना जाणती सर्व ही रसाते | {"\n"}श्रीहाट स्थान ते आप ऋषि तेथील{"\n"}
          स्वप्नावस्था देहे ते कारण | {"\n"}गुरु लिंग प्रमाण येजुर्वेद ते ठायी{"\n"}
          कमळा वल्लभ तेथील देवता | {"\n"}शोभा ते पाहता क्षीर वर्ण साजिरी{"\n"}
          नेत्र स्थान हेची गोल्हाट कमळ | {"\n"}ते ठायी झळाळ तेज ऋषि करतो{"\n"}
          सीवलिंग तेथे सामवेद गाती | {"\n"}अवस्था सुषुप्ति देव पाणी पिनाक{"\n"}
          गोल्हाटाचे वरी पादुकांचे तळी | {"\n"}औठाचीये स्थळी पुण्यागीरी प्रमाण{"\n"}
          जंगम लिंग वायो तेथे ऋषि | {"\n"}ते ठायी वेदासी आथवर्ण उच्चार{"\n"}
          तुर्या हे अवस्था देवता ॐकार | {"\n"}शोभा ती समग्र नीळ वर्ण तेथीली{"\n"}
          श्रोत्र स्थान होये गुंफा हे भ्रमर | {"\n"}तेथे ऋषेश्वर आकाश हे प्रसिद्ध{"\n"}
          प्रसाद ते लिंग सूक्षम  ते वेद | {"\n"}उन्मनी प्रसिद्ध अवस्था ते स्थळीची{"\n"}
          तुकाविप्र म्हणे शोभा कृष्ण वर्ण | {"\n"}देवता प्रमाण सदासीव त्या स्थळी{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          सहस्त्र दळी ब्रम्हरंध्र स्थान | {"\n"}गुण चक्रा लये | कोटी सूर्य प्रकाश{"\n"}
          वेद नाही देव अवस्था नाहीच | {"\n"}कोटी चंद्र साचे | वोप देती प्रमाण{"\n"}
          समाधी सुख ते स्वानंद सेजार | {"\n"}भुवन परात्पर ब्रम्हांडीची आजपा{"\n"}
          आजपा जाहाली पिंड ब्रम्हांडीची | {"\n"}क्रिया पवनाची आता श्रोते ऐकावी{"\n"}
          तुकाविप्र म्हणे प्रीती आवधानी | {"\n"}आसावी म्हणून वीनंती हे अभंग{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          इडा पिंगळा सुशूम्ना | {"\n"}देही वर्तती या भिन्ना{"\n"}
          पवन हे सिद्धी जाणा | {"\n"}योगियाच्या सिद्ध खुणा{"\n"}
          वामे इडा वाहातसे | {"\n"}पिंगळा हे दक्षणेस{"\n"}
          मध्ये सुशूम्ना  त्रिवेणी | {"\n"}ऐसी जाहाली मिळणी{"\n"}
          स्रावी अमृत सत्रावी | {"\n"}कळा जीवन स्वभावी{"\n"}
          तीला सेवीता अमर | {"\n"}होये प्रमाण तो नर{"\n"}
          तुकाविप्र म्हणे ज्ञानी | {"\n"}नित्य नेम या साधनी{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          उष्ण काले उष्ण काया | {"\n"}बहु संतप्त जालीया{"\n"}
          अर्ध चंद्र ऊर्ध्व कीजे | {"\n"}क्रिया पवन सहजे{"\n"}
          होये सितळ तो प्राणे | {"\n"}मग संतोष पावणे{"\n"}
          शीत काळी शीत त्वचा | {"\n"}उपाय हा पीडील्याचा{"\n"}
          पिंडीचा तो अर्ध सूर्य | {"\n"}साधने तो ऊर्ध्व होये{"\n"}
          तरी न लगे प्रावर्ण | {"\n"}कथा अग्नि ही प्रमाण{"\n"}
          क्षुधा काळी क्षुधा पिडी | {"\n"}तरी तयासी हे जोडी{"\n"}
          कीजे सत्रावी दोहन | {"\n"}देही वारे भूक तहान{"\n"}
          होये सहज निचाड | {"\n"}नाही भोजनाची चाड{"\n"}
          ऐशा पवन अभ्यासी | {"\n"}काळ वंचना काळासी{"\n"}
          व्हावे अमर म्हणोनी | {"\n"}भाव धरी अंतकर्णी{"\n"}
          आत्मज्ञानी ऐसे रीती | {"\n"}नित्य साधनी आहेती{"\n"}
          इति पवन प्रकर्ण | {"\n"}हरी गुरु समर्पण{"\n"}
          नाही साधन हे कोणा | {"\n"}उग्या बोलाबोली खुणा{"\n"}
          तुकाविप्र म्हणे खेळ | {"\n"}सिद्ध सहज सकळ{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          ज्ञानी तपस्वी महंत | {"\n"}भक्ति निष्ठा आलंकृत{"\n"}
          नाही संगाचे वेसन | {"\n"}विषयाचे नाही ध्यान{"\n"}
          काम क्रोधा जे वेगळे | {"\n"}सदा शांतीचे पुतळे{"\n"}
          नीराभिमान ची ते | {"\n"}त्यजी काम्य निषधाते{"\n"}
          तया ज्ञान हे कळावे | {"\n"}इतरांसी न कळावे{"\n"}
          तुकाविप्र म्हणे ज्ञान | {"\n"}गुरु भक्तासी प्रसन्न{"\n"}
        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          गुरु भक्त कथा रंगी | {"\n"}नाचे संताचीया संगी{"\n"}
          निंदा स्तुति करो कोणी | {"\n"}नाही जयाचीया मनी{"\n"}
          अभिमान नाही जया | {"\n"}ज्ञान सांगावे तया{"\n"}
          लाभ आलाभी जो स्थिर | {"\n"}सुखरूप निरंतर{"\n"}
          योग्य ऐसीया सहज | {"\n"}तुकाविप्र म्हणे नीज{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>पद   </Text>
        <Text style={styles.text}>
          वाशिष्ट हा श्रीराम संवाद | {"\n"}परउपकारार्थ आनन्द ||धृ ||{"\n"}
          अष्ट दळा कमळ ह्रदये | {"\n"}तेथे मन मधुकर आहे | {"\n"}भ्रमण तो नित्य करीताहे | {"\n"}पूर्व दळा आ श्वेत वर्ण होये{"\n"}
          तेथे जरी प्रवेशले मन | {"\n"}तरी धैर्य उदारता पुण्य | {"\n"}वासना हे होये सुप्रसन्न | {"\n"}मन पाकोळीका हे साधन{"\n"}
          अग्नि दळी असे वर्ण राता | {"\n"}जरी तेथे मन पावे सत्ता | {"\n"}तरी मग अवस्था हे चित्ता | {"\n"}उद्वेग का शोक उपजता{"\n"}
          दक्षणया दिशे वर्ण काळा | {"\n"}तेथे मन संचरे ज्या वेळा | {"\n"}क्रोध द्वेष वासने वेगळा | {"\n"}नव्हे प्राणी कोणत्याही काळा{"\n"}
          नैऋतेचे पाते असे निळे | {"\n"}मन तेथे मधुकर खेळे | {"\n"}तरी वित्त पुत्र मोह जाळे | {"\n"}बांधीयेले असे यांनी बळे{"\n"}
          पीत वर्ण पश्चिम दळ ते | {"\n"}मन असे संचरता तेथे | {"\n"}विनोद हा आल्हाद भरीत | {"\n"}सुखरूप तुकाविप्र नाथ{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          शाम वर्ण पाते वायव्य कोणीचे | {"\n"}त्या ठायी मनाचे येणे जरी{"\n"}
          तरी तीर्थ साधू दर्शनाची चाली | {"\n"}भावना तेथील सर्वोत्तम{"\n"}
          उत्तर पाकोळी पीत वर्ण तेथे | {"\n"}मन जाये सत्य तरी मग |{"\n"}
          अष्ट सुख भोग करू उपजती | {"\n"}पाकोळी ऐका ती इशान्येची{"\n"}
          गौर उत्तम ते ईशान पाकोळी | {"\n"}तयाचीया मेळी मन जाये{"\n"}
          तरी हरीकथा श्रवण मनन | {"\n"}उपजे कीर्तन देहे धर्म{"\n"}
          मनासी प्रवेश जाहालीया संधी | {"\n"}आत्मा पिडे व्याधी रोग ऐसा{"\n"}
          मध्य स्थिरावल्या निद्रा की समाधी | {"\n"}प्रहराचे संधी विश्रांती हे{"\n"}
          मन कळीकेसी भ्रमण करीत | {"\n"}अनुसंधान ते ऐसे असे{"\n"}
          ऐशा अष्ट कमळाच्या ज्ञाने | {"\n"}परमार्थ साधन उपकारा{"\n"}
          महावाक्य ऐसे बोलतची आहे | {"\n"}अनुभव ते हे सिद्ध कथा{"\n"}
          तुकाविप्र म्हणे वशिष्ट श्रीराम | {"\n"}संवाद उत्तम अभंग हा{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          सिद्ध स्वरूपाचा हा सहज खेळ | {"\n"}स्वभाव निर्मळ पांच मुद्रा प्रकर्ण{"\n"}
          वेगळाले वर्ण वेगळाले स्वभाव | {"\n"}सिद्ध अनुभव श्रुती वाक्य प्रमाण{"\n"}
          तुकाविप्र म्हणे विस्वासे श्रवण | {"\n"}मनन करणे घेणे अनुभवासी{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>पद  </Text>
        <Text style={styles.text}>
          प्रथम मुद्रा | {"\n"}चांचरी दृष्टी द्वारे  || धृ ||{"\n"}
          आडविया दृष्टी उंच | {"\n"}नेत्र करोंनीया साच | {"\n"}आंतराळ पाहे बरे{"\n"}
          आंतराळी दृष्टी देणे | {"\n"}करोंनीया डोळे लहान | {"\n"}दोन्ही पाती बरोबर{"\n"}
          लावोनीया नेत्र पाती | {"\n"}आंतराळ पाहावीती | {"\n"}तेथे दिसे मुक्त हार{"\n"}
          मुक्ताफळ वोळी दृष्टी | {"\n"}दिसताती बहु कोटी | {"\n"}स्थिति होये निरंतर{"\n"}
          निरंतर स्थिति बळे | {"\n"}जेथे तेथे भरी डोळे | {"\n"}दृष्टी पुढे तेची फिरे{"\n"}
          कृत्तिकाचा मेळा जैसा | {"\n"}चांदण्याचा घोळ तैसा | {"\n"}होत असे खालीवर{"\n"}
          देख पाहे डोळा तुका | {"\n"}विप्र कृपा बळे एका | {"\n"}चाचरी हे मुद्रा थोर{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          चाचरी हे मुद्रा श्वेत वर्ण सदा | {"\n"}पाववी आनंदा  योगियासी{"\n"}
          ऐसी मुद्रा जाली प्रथम विख्यात | {"\n"}जाणत आहेत गुरुपूत्र{"\n"}
          श्वेत वर्ण गोळा चांदण्याचा ब्रम्ह | {"\n"}होवोनीया जन्मा सार्थकता{"\n"}
          तुकाविप्र सत्य दृष्टी द्वार ज्ञान | {"\n"}सद्गुरू प्रसन्न सर्वकाल{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          मुद्रा हे दुसरी हे दुसरी | {"\n"}नाम जीला भूचरी || धृ ||{"\n"}
          नासग्रावरी दृष्टी धरणे | {"\n"}मुखी उजाळ होणे तेणे{"\n"}
          लवू न देवी  पापणी | {"\n"}तेणे नेत्रा सुटते पाणी{"\n"}
          पाहाता मुखावरति तार | {"\n"}पडती उजाळाची थोर{"\n"}
          सहजी पाहोनी ते चांदिणे | {"\n"}आकळूनी मन बुद्धी आसणे{"\n"}
          नाना श्रवणी ध्वनि उठताती | {"\n"}तेथे गुरु पुत्र लीन होती{"\n"}
          ऐसी मुद्रा हे दुसरी | {"\n"}तुकाविप्र डोळे भरी{"\n"}
        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          नीळ वर्ण हे दुसरी | {"\n"}मुद्रा प्रसिद्ध भूचरी{"\n"}
          गुरु पुत्रासी मोहन | {"\n"}मुद्रा भूचरी साधन{"\n"}
          जाल्या ऐशा दोनी मुद्रा | {"\n"}समजल्या गुरु पुत्रा{"\n"}
          पाचा माजी जाल्या दोनी | {"\n"}प्रीती आसो आवधानी{"\n"}
          तीन उरल्या ऐकणे | {"\n"}गुरु पुत्र मुद्रा जाणे{"\n"}
          तुकाविप्र म्हणे श्रोता | {"\n"}आगोचरी ऐका आता{"\n"}
        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>पद  </Text>
        <Text style={styles.text}>
          ऐसी मुद्रा ऐका आगोचरी | {"\n"}तिचे ध्यान असे अभ्यांतरी ||धृ ||{"\n"}
          धरोनीया मन एक निष्टा | {"\n"}निराकारी सत्य नीज निष्ठा | {"\n"}मौन धरी आगोचर मोटा | {"\n"}लावोनीया दोनी नेत्र वाटा{"\n"}
          मन स्थिर ह्रदयी करावे | {"\n"}दृष्टीद्वारे काही न पहावे | {"\n"}आपणची अगोचर व्हावे | {"\n"}उत्तरची कोणासी न द्यावे{"\n"}
          मन ऐसे राखोनी आढळ | {"\n"}सत्यमुद्रा तिसरी निर्मळ | {"\n"}पीतवर्ण दिव्य सुतेजाळ | {"\n"}गुरुपुत्रा कारीणी मंगळ{"\n"}
          तिसरीया मुद्रेचे मोहन | {"\n"}आपणिया लागे प्रीती ध्यान | {"\n"}होवोनीया जाये विसर्जन | {"\n"}सामावल्या आगोचरी शून्य{"\n"}
          प्रसिद्ध हे मुद्रा आगोचरी | {"\n"}राखोनीया मन अभ्यांतरी | {"\n"}निश्चलता सबाह्य आंतरी | {"\n"}तुकाविप्र हे मुद्रा तिसरी{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>सौरी  </Text>
        <Text style={styles.text}>
          चौथी मुद्रा खेचरीचे स्थान अंतराळी | {"\n"}भ्रमर या गुंफे माजी दृष्टी लावीयेली{"\n"}
          पाहणे हे खरे असे दृष्टी उफराटे | {"\n"}अनुभव तेथीलीया देखण्याच्या नेटे{"\n"}
          दृष्टी थोर त्रिकुटीसी घालूनीया जाये | {"\n"}गोल्हाटासी ब्रम्हरंध्री स्थिर मन होये{"\n"}
          ॐकार तो तेथे भासे दिसे रक्तांबर | {"\n"}गगन हे लाल दिसे उगवता मित्र{"\n"}
          आठवे हे असे सत्य समाधीचे | {"\n"}ऊर्ध्व पंथे पाहणे या गुण खेचरीचे{"\n"}
          खेचरीचा अनुभव जाहालीया वरी | {"\n"}भव बंधनासी तोडी चौथी मुद्रा खरी{"\n"}
          वर्ण लाल खेचरीचा तोडी भवबंध | {"\n"}क्षण एक न लगता लाभ असे सिद्ध{"\n"}
          गुरु गम्य गुरु पुत्र साधकासी ठावे | {"\n"}संपादावी गुरु कृपा अनुभव घ्यावे{"\n"}
          तुकाविप्र खेचरीची अनुभव सिद्धी | {"\n"}सूप्रसन्न जाहलिया गुरु कृपा निधी{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          तार्किक हा पक्ष | {"\n"}दृष्टी द्वारे मोक्ष || धृ ||{"\n"}
          चाचरी भूचरी खेचरी | {"\n"}चौथी बोलती आगोचरी{"\n"}
          चाचरी म्हणजे आडवे | {"\n"}दृष्टी पाहणे हे स्वभावे{"\n"}
          नासीक अग्री असे लक्ष | {"\n"}मुद्रा भूचरी हे प्रत्यक्ष{"\n"}
          खेचरी ही मुद्रा म्हणी जे | {"\n"}आकासी त्रिमीरा ते लक्षी जे{"\n"}
          आगोचरी हे ऐसे ध्यानी | {"\n"}बैसती नेत्रासी लावोनी{"\n"}
          आलक्ष जयेचे हे  घर | {"\n"}पांचवी मुद्रा आपरंपर{"\n"}
          दृष्टीद्वारे तुकाविप्र | {"\n"}पाहाणे पर वस्तु साचार{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          भडगावकर म्हणती स्वामीला | {"\n"}आता पंढरीला आहेत जे{"\n"}
          त्याजला भूचरी प्रत्यक्ष प्रसन्न | {"\n"}आहे संत जण पहाताती{"\n"}
          क्षुधा त्रशा तृपी मळ मूत्र शुद्धी | {"\n"}ज्ञान देहामध्ये शुद्ध आहे |{"\n"}
          भरथा सारीखे मारायासी नेले | {"\n"}तेंव्हा न बोलले भ्याले नाही{"\n"}
          ऐसे ते पुराण प्रसीदध असोनी | {"\n"}बोलीयेले ज्ञानी प्रसंगासी{"\n"}
          तुकाविप्र म्हणे रहूगणा सवे | {"\n"}बोलीले स्वभावे सिद्ध ज्ञान{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          ऐकिले जे पहिले प्रत्यक्ष | {"\n"}तेव्हा ही साक्ष गुजरली{"\n"}
          मागे जाले पुढे होतील बहु | {"\n"}आता ही आहेत पृथ्वीवरी{"\n"}
          परी हे अवघी खंडज्ञान कथा | {"\n"}वर्तत असता देहामाजी{"\n"}
          देह नसलिया दर्शन डोळ्याचे | {"\n"}मग कोणा कैचे दृष्टीवीण{"\n"}
          विदेही वर्तता दृष्टी नसे मग | {"\n"}वागवी ते जग आंधळे ते{"\n"}
          सर्वा सार वस्तु वेदा आगोचर | {"\n"}पाहे तुकाविप्र संकीर्तनी{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          न दिसे पदार्थ कोणीच जेधवा | {"\n"}आंधळे तेधवा वागवीती{"\n"}
          म्हणोनीया वस्तु वेदा आगोचेर | {"\n"}सर्वा होनी सार देखिलीया{"\n"}
          देहे धर्म पार मग त्यासी कैसा | {"\n"}काम क्रोध साचा द्वेष राग{"\n"}
          मद मत्सर स्त्री विषयी नीसंग | {"\n"}देखणे अभंग भंग नाही{"\n"}
          घट मठ भंगी आकाश आपण | {"\n"}सिद्ध पूर्ण पणे जेथे तेथे{"\n"}
          तुकाविप्र वस्तु गुरु दिसे डोळा | {"\n"}विषये सोहळा तेथे कैचा{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          बोलू आल्या ऐसे जाले पण सिद्ध | {"\n"}स्थिति आंगी शुद्ध बाणलीया{"\n"}
          लोखंडासी खरा परीस लागला | {"\n"}लोहपण त्याला कैसे मीळे{"\n"}
          लोहाची काळीम हीनता फिटली | {"\n"}लोहात राहिली तरी भिन्न{"\n"}
          तैसा कोणी गुरु प्रसाद लाधला | {"\n"}सूर्यादी तयाला | पाहताती{"\n"}
          तुकाविप्र म्हणे म्हणोनी या आधी | {"\n"}वस्तु शास्त्र सिद्धी गुरु कृपा{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>पद   </Text>
        <Text style={styles.text}>
          पर वस्तु पाहे नित्य डोळा | {"\n"}गुरुपुत्र प्रसादी पुतळा ||धृ ||{"\n"}
          दैन्य त्याचे दरिद्र पळाले | {"\n"}आधी वस्तु शस्त्रासी शोधिले | {"\n"}मग आत्म निष्ठे पोहचले | {"\n"}परब्रम्ही मिश्रित जाहाले{"\n"}
          लवण या सागरात जैसे | {"\n"}भृंगी संगे आळी होय तैसे | {"\n"}देखिलीया ब्रम्ह व्यापकासी | {"\n"}मुकले ते मग जीव दसे{"\n"}
          अंजनासी घालिता पायाळा | {"\n"}धन दिसे तयाचीया डोळा | {"\n"}सत्य सात फोडोनी पाताळा | {"\n"}गुरुकृपा तैसी आत्म कळा{"\n"}
          वेवसीहा कोणताही तया | {"\n"}आसावा तो केधवा कासया | {"\n"}पूर्ण जाली जेंव्हा गुरु दया | {"\n"}तया असोनीया नाही काया{"\n"}
          सारांशता प्रसाद सद्गुरू | {"\n"}आदी मध्य अंत भव तारु | {"\n"}बिजापोटी जैसे वाढे तरु | {"\n"}तुकाविप्र सिद्ध फळ भारू{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          विद्या ते  हेची अध्यात्म | {"\n"}प्रकाशाचे निजधाम{"\n"}
          आज्ञानासी हे दाहक | {"\n"}ज्ञान होये महावाक्य{"\n"}
          संत या मार्गे चालती | {"\n"}आत्म साक्षात्कारी होती{"\n"}
          मेघ पडळाचे आड | {"\n"}सूर्य होताची उघड{"\n"}
          निवारण मेघ होता | {"\n"}आसे प्रकाश आयता{"\n"}
          तैसे अज्ञान जळाले | {"\n"}ज्ञान तेज प्रकाशले{"\n"}
          आत्मा स्व प्रकाश आसे | {"\n"}तुकाविप्र हा प्रत्यक्षे{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>पद   </Text>
        <Text style={styles.text}>
          तद्रूप हे सर्व | हे सर्व | {"\n"}वस्तूचे वैभव || धृ ||{"\n"}
          चीदान्वये व्यवहारी | {"\n"}गौरव सहजी या संसारी |{"\n"}
          देहान्वये कनकाला | {"\n"}वेवहार सहजी होता जाला{"\n"}
          मृत्तिका घट नाना | {"\n"}नसोनी मृत्तिकेसी भिन्ना{"\n"}
          पट तंतुसी दुजे | {"\n"}नसता  दिसणे ते सहज{"\n"}
          तुकाविप्र म्हणे भेटी | {"\n"}सद्गुरू प्रसाद सर्व ही सृष्टि{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          आपूली नित्यता जाणे तोची ज्ञानी | {"\n"}ज्ञान त्रिभुवनी स्व संवेद्य तत्वता{"\n"}
          प्रमाण नेणवे ज्याचा काही अंत | {"\n"}म्हणोनी अनंत सदोदित संपूर्ण{"\n"}
          ब्रम्हानंद ऐसा आद्वये अपार | {"\n"}तोची परात्पर जाणिजे की अभंग{"\n"}
          तुकाविप्र म्हणे ऐसीया निर्धारी | {"\n"}ब्रम्हाभ्यास करी निरंतर अद्वये{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          सर्व सुखाचे ते सत्य होय धाम | {"\n"}ते मी परब्रम्ह ब्रम्है वास्मी निष्काम{"\n"}
          ऐसी भावना हे दिव्यौषधी खरी | {"\n"}क्षय व्याधी हरी अविद्या हे जिवाची{"\n"}
          म्हणोनीया नित्य आत्म हे भावना | {"\n"}देखे त्रिभुवना मायामय सकल{"\n"}
          तुकाविप्र म्हणे ऐसीया येकांती | {"\n"}निघे अदवैती तोची ज्ञानी पुरता{"\n"}
        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          सद चीत आणि आनंद | {"\n"}त्रिविध वस्तु ते अभेद त्रिविधची नव्हेकी{"\n"}
          तोषे वीण सदा संतोष असणे | {"\n"}आत्म सुख येणे सद चीद आनंदे{"\n"}
          सद तेची चीद चीद ते आनंद | {"\n"}नव्हेची त्रिविध वस्तु सार येकली{"\n"}
          तुकाविप्र सुखासुख हे संपूर्ण | {"\n"}येका येक पण ध्यान ध्येय ध्याताची{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>पद   </Text>
        <Text style={styles.text}>
          सोने नग भेटी | {"\n"}नग भेटी मूळ स्वरूपा न तुटी{"\n"}
          मिळणी दुसरीच नाडळे | {"\n"}आत्म साधन या स्थिति फळे{"\n"}
          आतळोचीने दे ती | {"\n"}जेथे ज्ञानाचीये युक्ति{"\n"}
          ध्येय ध्याता ते ध्यान | {"\n"}तेथे हे कैचे अनुसंधान{"\n"}
          तुकाविप्र म्हणे वस्तूचे | {"\n"}वस्तु साधन हो येशाचे{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          घटामाजी काही आकाश गुंतले | {"\n"}घटरूप जाले ऐसे दिसे{"\n"}
          महदाकासी परी ते तुटले केव्हा | {"\n"}तैसे अनुभवा स्वत: सिद्ध{"\n"}
          निराकार आणि आकार त्या रीती | {"\n"}अभंग आहेती येकी येक{"\n"}
          तुकाविप्र ऐसी अखंड धारणा | {"\n"}साक्षात्कारी खुणा कार्य सिद्धी{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          जया स्वरूपाचा अंत नाही कोठे | {"\n"}तेथे सत्य भेटे आत्मत्वची{"\n"}
          ब्रम्ह नोहे जग जग नोहे ब्रम्ह | {"\n"}ऐसे आहे वर्म घरोघरी{"\n"}
          परी या साधने ब्रम्ह जग दिसे | {"\n"}म्हणोनी उल्लासे | {"\n"}पहावे ते{"\n"}
          तुकाविप्र महावाक्य निरोपण | {"\n"}संकळीत खूण समजाया{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          चिंतामणी परीस असता | {"\n"}न पाळी कोणता आहे तैसा{"\n"}
          आकाशासारखे मिळता दर्पण | {"\n"}न पाहे कवण आत्मरूपा{"\n"}
          आत्मरूप दिसेन पाहता तेथे | {"\n"}विसरता जेथे तेची दिसे{"\n"}
          तुकाविप्र डोळा विस्मर्णी ते दिसे | {"\n"}अधिक उल्लासे भक्ति परम{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>सौरी</Text>
        <Text style={styles.text}>
          कर्म क्रिये सवे सदा लागलची दिसे | {"\n"}सांडिताती ते सालेची जाय ऐसे नसे{"\n"}
          अधिकची होये डोळे झाकीलीयावरी  | {"\n"}देहाचीया देहभाव जाये सर्वापरी{"\n"}
          तुकाविप्र निर्मनची सर्व परमात्मा | {"\n"}सर्व उपचार सत्य सर्व परब्रम्हा{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>सौरी</Text>
        <Text style={styles.text}>
          देह बुद्धी मुळे ज्ञान मळकट जाले | {"\n"}मुख्य रुप सहज लपोनिया गेले{"\n"}
          आळंकारामुळे जाले डाक लग सोने | {"\n"}देहभावे मळकट जाले आत्मज्ञान{"\n"}
          पडलीया पुटे झडे डाक सकळही | {"\n"}कासवटी सोने शुद्ध मग तैसे काही{"\n"}
          तुकाविप्र ज्ञान ब्रम्ह सत्य सर्व असे | {"\n"}बोध भानु उदेजला ह्रदय चीदाकाशे{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          ह्रदय आकासे सूर्य उगवला | {"\n"}सर्वी प्रकाशला आनंद हा भरीत{"\n"}
          तीळांजूळी दील्ली देहाभिमानाते | {"\n"}प्रसन्न तयाते सर्व व्यापी प्रगट{"\n"}
          स्वप्रकाश आर्क ह्रदय मांदिरी | {"\n"}सत्य सुखकारी सकळही जीवासी{"\n"}
          तुकाविप्र सर्व सुखासी आराम | {"\n"}सर्वी सदा सम देश काळ रहीत{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          महावाक्य निरोपण संकळीत | {"\n"}कीर्तन सभेत प्राकृतची अभंग{"\n"}
          कलयुग आवघेची प्राकृत | {"\n"}ब्रम्हा विष्णु त्यात प्राकृतची महेश{"\n"}
          माया गणपती प्राकृत सकळ | {"\n"}वैकुंठ पाताळ स्वर्ग सर्व प्राकृत{"\n"}
          तुकाविप्र जीणे प्राकृत कलीचे | {"\n"}अभंग भक्तीचे हरी गुरु कीर्तन{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          प्राकृता वेगळा वेदार्थ कळेना | {"\n"}कलीचीया जना म्हणोनी हे प्राकृत{"\n"}
          वेद कृता युगी त्रेता युगी शास्त्र | {"\n"}पुराण द्वापार प्राकृतच कली हे{"\n"}
          येथे हेची भाशा वेदार्थ बोलती | {"\n"}सर्व समजती अर्थ भाषा प्राकृत{"\n"}
          प्रांजळ समजे या नाव प्राकृत | {"\n"}म्हणोनी पंडित जाणवीती प्राकृते{"\n"}
          तुकाविप्र वाणी प्राकृत अभंग | {"\n"}वेदांचे सर्वांग प्राकृतची अंतर{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>

          अभंग 	प्राकृता वेगळे समजावे काये | {"\n"}घरोघरी आहे  वेद घोष होत की{"\n"}
          परी समजेना प्राकृता वेगळा | {"\n"}प्रांजळ मोकळा अर्थ वेद श्रुतीचा{"\n"}
          श्रुतीची वचने पंडित म्हणती | {"\n"}प्राकृते सांगती गर्भ त्याचा सकळ{"\n"}
          ऊसाचीया पोटी साखरेच्या रासी | {"\n"}श्रीमंत जनासी भोगवीती चतुर{"\n"}
          दुधातूनी तूप काढीती सुगरी | {"\n"}पंगती साजिरी होये तेणे सहज{"\n"}
          तुकाविप्र वाणी वेदाचे पोटीची | {"\n"}प्राकृत कलीची सुराणी हे अभंग{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          समस्त भासेला नमन साष्टांग | {"\n"}विनंती अभंग मराठी हे प्राकृत 1706	1706{"\n"}
          सयाद्री पर्वत कृष्ण वेणी तीर | {"\n"}क्षेत्र रामपूर देश दंडकारण्य{"\n"}
          रणदुल्ला याने रहीम ठेवीले | {"\n"}पुर नाम आले आजोनिया शोभेसी{"\n"}
          जोसी कुलकर्णी कसबे क्षेत्रीचे | {"\n"}गौतम कुळीचे कुळ भक्ति भूषण{"\n"}
          जमेत न कोठे खर्चात हा जीव | {"\n"}गोष्टी अनुभव जैशा तैशा बोलत{"\n"}
          गत कली चार हजार आठसे | {"\n"}चौऱ्यांशी प्रत्यक्षे चालतची आहेत{"\n"}
          शालिवान शक सत्रा शत सहा | {"\n"}दीन चालत हा कृष्ण माघ पाडवा{"\n"}
          रवी संक्रमण सोमवती पर्व | {"\n"}मुहूर्त अपूर्व धन संधी लिखिता{"\n"}
          इति तो संपूर्ण आनंद अभंग | {"\n"}संकीर्तन रंग माहावाक्य वेद श्री{"\n"}
          मुलाने आक्षेप काही केला प्रीती | {"\n"}म्हणोनी लिखिती मनोल्लास जाहाला{"\n"}
          चिरंजीव दादा पीलाजी गोविंद | {"\n"}मूलयाने छंद घेतला हा  प्रीतीचा{"\n"}
          आनंदले मन अनुभव बोलला | {"\n"}आनंद लिहिला आला ऐसा अभंग{"\n"}
          पुराण प्रसिद्ध प्रसंग कीर्तन | {"\n"}आनंद भुवन तुकाविप्र विठ्ठल{"\n"}
          मनोल्लासे हेता ऐसी केली प्रीती | {"\n"}अभंग विनंती वेद शास्त्र पुराण{"\n"}
          संत सिद्ध साधू सूतर्की सुढाळ | {"\n"}अंतर निर्मळ नमो सर्वा विनंती{"\n"}
          सहज मुलाचा हेत शुद्ध भोळा | {"\n"}त्या रीती सरस अर्थ आला प्रसंगा{"\n"}
          तुकाविप्र भावे लोटांगण सर्वा | {"\n"}नमन भूदेवा भक्ति भावा विनंती{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>पद   </Text>
        <Text style={styles.text}>
          स्वधर्म कर्म ईश्वर आर्जवाया |{"\n"}
          अग्निमुखे हवनासी | {"\n"}सत्य निष्ठा देवापासी | {"\n"}लाभ जाल्या नरकाया{"\n"}
          नित्य पूजा ब्राम्हणाची | {"\n"}पंगतीसी भोजनाची | {"\n"}आश्रमासी पातलीया{"\n"}
          गुरु भक्ति परायण | {"\n"}नरदेही आधी होणे | {"\n"}संपादणे गुरु दया{"\n"}
          सन्मानावे आतीताला | {"\n"}सुख द्यावे स्व यातीला | {"\n"}सहजची स्वधर्मी या{"\n"}
          तुकाविप्र स्वधर्माचा | {"\n"}लाभ जाला स्वसुखाचा | {"\n"}संकीर्तनी नाचावया{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>पद  </Text>
        <Text style={styles.text}>
          गुरु गोत्र आणि धेनु पूजा द्विज | {"\n"}पितर सहज देव ऐसे{"\n"}
          नित्य निष्ठा नेम पूजन आवडी | {"\n"}स्वधर्म हे जोडी जोडलीया{"\n"}
          मग हाच धर्म कामधेनु होये | {"\n"}सर्व कामना हे पुरवील{"\n"}
          सर्व देव गणा तृप्तता होईल  | {"\n"}तेच चालवीतील योग क्षेम{"\n"}
          इच्छीले मनी ते होईलची प्राप्त | {"\n"}सुप्रसन्न सत्य देव होती{"\n"}
          तुकाविप्र म्हणे  स्वधर्म चालता | {"\n"}सर्व असे सत्ता देवा वरी{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.title}>अभंग  </Text>
        <Text style={styles.text}>
          नित्य यज्ञ स्वधर्म निर्मिली | {"\n"}ब्रम्हदेवे प्रजा वाढविली ||धृ||{"\n"}
          विसरली प्रजा स्वधर्मासी | {"\n"}विनवीते व्हा ब्रम्हयासी | {"\n"}देवा कोण आश्रये आम्हासी | {"\n"}सार्थकता देह धरीलीयासी{"\n"}
          मग ब्रम्हदेव बोलीयेले | {"\n"}तुम्हासाटी विहित चांगले | {"\n"}नित्य यज्ञ स्वधर्म नेमीले | {"\n"}चालता हेत पुरतील{"\n"}
          पीडू नका सहसा शरीरा | {"\n"}व्रते तपे तीर्थे ही न करा | {"\n"}मंत्र यंत्र साधन पसारा | {"\n"}हेतु युक्त यागाही न करा{"\n"}
          यज्ञ तुम्ही स्वधर्म यजावे | {"\n"}अहेतुक चित्ते अनूष्टावे | {"\n"}पतीव्रता जैसी पती सेवे | {"\n"}तैसा तू  ह्या स्वधर्मची स्येव्य{"\n"}
          ऐसे ब्रम्हदेव बोलीयेले | {"\n"}कृष्णदेवे पार्था सांगितले | {"\n"}ज्ञानेश्वरे तेच प्रगटीले | {"\n"}आमुचीया प्रचितीसी आले{"\n"}
          तुकाविप्र स्वधर्म राहाटी | {"\n"}नित्यनेम कीर्तन वैकुंठी | {"\n"}सत्यवास कृष्णेचीया तटे | {"\n"}बोलाबोली संताची हे भेटी{"\n"}

        </Text>
        <View style={styles.line}></View>
        <Text style={styles.textstyle}>
          संत तुकाविप्र यांच्या हस्तलिखित साहित्याच्या बाबतीत प्रथम दर्शनी लक्षात येणारी बाब म्हणजे संत तुकाविप्र यांचे सगळे लिखाण हे दीर्घ लिपीत आहे. यात सगळ्या वेलांटी दुसऱ्या आहेत तर सगळे उकार पहिले आहेत .
          आपल्याला लक्षात आलेल्या बाबी आमच्याकडे पाठवाव्या. आपल्या नावासहित आम्ही त्या बाबींचा सहभाग य aap मध्ये करू
        </Text>
      </ScrollView>
    </LinearGradient>
  )
}

export default Tatvmasi

const styles = StyleSheet.create({
  container: {
    paddingVertical: 10,
    paddingHorizontal: 20,
  },
  title: {
    fontFamily: 'VesperLibre-Bold',
    textAlign: 'center',
    fontSize: 20,
  },
  text: {
    fontFamily: 'VesperLibre-Bold',
    textAlign: 'center',
    fontSize: 18,
    marginTop: 8,
    lineHeight: 26,
    color: '#3a2b1e',
  },
  line: {
    height: 1,
    backgroundColor: 'gray',
    width: '100%',
    marginVertical: 20,
  },
  textstyle: {
    fontFamily: 'VesperLibre-Bold',
    fontWeight: 600,
    fontSize: 17,
    marginBottom: 20,
    lineHeight: 22
  }
})