import { View, Text, StyleSheet, ScrollView } from 'react-native'
import LinearGradient from 'react-native-linear-gradient'

const Santanna = () => {
  return (
    <LinearGradient colors={['#FFF7E6', '#FFECC2']} style={styles.container}>
      <ScrollView contentContainerStyle={styles.scrollContent} showsVerticalScrollIndicator={false}>
        <View style={styles.card}>
          <Text style={styles.text}>
            निसी माजी चंद्र | दिवा सूर्य जैसा ।{"\n"}नामदेव तैसा | भक्ता माजी || १ ||{"\n"}
            देवा माजी गुरू । दैत्या माजी शुक्र ।{"\n"}भक्ता माजी थोर | नामा तैसा || २ ||{"\n"}
            ऋतु माजी जैसा | अभंग वसंत ।{"\n"}तैसा नामा संत | सर्वामाजी || ३ || {"\n"}
            तुकाविप्र म्हणे | काष्टात  चंदन ।{"\n"}नामदेव धन्य | संतांमाजी || ४ ||{"\n"}{"\n"}

            नामदेवे गुरू केला ।{"\n"}तेव्हा त्याला मानीले || १ ||{"\n"}
            साक्षात्कार देवाजीचा ।{"\n"}ऐसा त्याचा वृत्तांत || २ ||{"\n"}
            तेथे गुरूवीन ज्ञानी ।{"\n"}तरू जनी म्हणती || ३ || {"\n"}
            तुकाविप्र म्हणे खोटी ।{"\n"}आस पोटी तरू हे || ४ || {"\n"}{"\n"}

            नामदेवा ऐसे भले ।{"\n"}वानीयेले संतानी || १ ||{"\n"}
            देवा ऐसा ज्याचा सखा ।{"\n"}या साधना ऐसेला || २ ||  {"\n"}
            काये केवा ईतराचा ।{"\n"}न गुरू याचा सामान्ये || ३ ||  {"\n"}
            तुकाविप्र म्हणे वेडी ।{"\n"}सार जोडी नेणती || ४ || {"\n"}{"\n"}

            नामदेव संत | प्रसिद्ध प्रेमळ | {"\n"}विठ्ठल निर्मळ | अवतार  || १ ||{"\n"}
            गोणाईच्या पोटी | भक्ती साठी  देव | {"\n"}जाले संतराव | जन तारू || २ ||{"\n"}
            तुकाविप्र म्हणे | ऐसा वीठ्ठल हे  ।{"\n"}जन्म घेत आहे | युगा युगी || ३ ||{"\n"}
            {"\n"}
            नामदेव आवतार ।{"\n"}तया दिधला हा वर  || १ ||{"\n"}
            हरी विठ्ठल प्रसिद्ध ।{"\n"}सर्व काळ वाचे शुद्ध || २ || {"\n"}
            प्रेम सर्वांगासी गाढे ।{"\n"}नित्य कीर्तन उघडे  || ३ ||{"\n"}
            ऐसे देणे नामदेवा।{"\n"}देवराया दिल्हे तुवा  || ४ || {"\n"}
            तुकाविप्र म्हणे थोर | {"\n"}धन्ये विठ्ठल उदारा  || ५ ||{"\n"}{"\n"}

            नामा अवतार | निरुपम जाहला ।{"\n"}अभंग वदला | शतकोटी || १ ||{"\n"}
            बहुतासी केला | स्वरूप साक्षात्कार | {"\n"}ऐसा अवतार | दुजा नाही  || २ || {"\n"}
            कुटूंब जयाचे |सर्व साक्षात्कारी | {"\n"}आस तीळभरी | चिंता नाही || ३ ||{"\n"}
            तुकाविप्र  म्हणे | उदाराचा राव।{"\n"}संत नामदेव | कलयुगी || ४ ||{"\n"}{"\n"}

            नामदेवे  भक्ति | भावार्थ लाविला  | {"\n"}सर्वत्र जनाला | कलयुगी || १ ||{"\n"}
            वैराग्ये संपत्ती | बहुता दिधली | {"\n"}थोर कीर्ति केली | त्रिभुवनी || २ ||{"\n"}
            मोठे मोठे राजे |  छपन्न भाषेचे | {"\n"}नामदेव साचे | उद्धरीले || ३ ||{"\n"}
            तुकाविप्र म्हणे | नामदेव धन्य |  {"\n"}चहु वर्णा मान्य | संतराव || ४ ||{"\n"}{"\n"}

            नामदेवा ऐसा | भक्त कलयुगी ।{"\n"}प्रमाण त्रिजगी | दुजा नाही || १ ||{"\n"}
            निरूपम नामा | देवा आवडता ।{"\n"}तयासी समता | नाही दुजी || २ || {"\n"}
            शतकोटी ग्रंथ | अभंग वदला ।{"\n"}शिरोमणी जाला | भक्त येक || ३ ||{"\n"}
            तुकाविप्र म्हणे | धन्य नामदेव | {"\n"}कलीत वैष्णव | ज्ञानसिंधु || ४ ||{"\n"}{"\n"}

            नामाचा प्रताप | अवतरले वेद ।{"\n"}कराया आनंद | भू देवासी || १ ||{"\n"}
            ऋचा शत कोटी, | ऋक येजू  साम ।{"\n"}वेदी या निस्सिम | आहेतची || २ ||{"\n"}
            प्राकृत भाषेत | वेद शतकोटी | {"\n"}जीव कोटी कोटी | उध्दराया || ३ ||{"\n"}
            प्रेम भक्ती भावे | केला हा तारवा  | {"\n"}उद्धाराया जीवा | नामदेवे || ४ ||{"\n"}
            तुकाविप्र म्हणे | नामयाच्या साक्षे  ।{"\n"}उद्धार प्रत्यक्षे  |  होत आहे || ५ ||{"\n"}

            नामयाची भक्ती | पाहोनीया आला  ।{"\n"}शरण तयाला | ब्रह्मदेव || १ ||{"\n"}
            उत्पत्ती विचार | आपण तो केला ।{"\n"}मनी नाही आला | रक्षणाचा || २ ||{"\n"}
            नामयाचे काम | मजहोनी थोर ।{"\n"}त्यासी नमस्कार | सर्वभावे || ३ ||{"\n"}
            तुकाविप्र म्हणे | नामदेवे केला ।{"\n"}ब्रह्मदेव चेला | आपुलाची || ४ ||{"\n"}{"\n"}

            नाम पूर्ण ब्रह्म |  जाहाले सकाम  ।{"\n"}इच्छा ही आगम  | व्याले वीस्व || १ ||{"\n"}
            नामची  विठ्ठल |  ज्ञान हे विठ्ठल ।{"\n"}ज्ञेय ही  विठ्ठल | ज्ञाता नामा || २ ||{"\n"}
            तो पण विठ्ठल  | त्रिपुटी सकळ  ।{"\n"}एकची  विठ्ठल | पूर्णब्रह्म || ३ ||{"\n"}
            तुकाविप्र म्हणे |  नामा व्यापक ।{"\n"}जाणा सकळीक | तुम्ही ऐसे || ४ ||{"\n"}{"\n"}

            नामा संताचीये माये | {"\n"}ज्ञानेश बापची होये || १ ||{"\n"}
            संत भक्त लेकरासी | {"\n"}विठ्ठल माऊली पोसी || २ ||{"\n"}
            भक्त पुंडलीक सखा | {"\n"}प्रेमळ सर्व या लोका || ३ ||{"\n"}
            चंद्रभागा हे बहीण | {"\n"}पंढरीची असे खूण || ४ ||{"\n"}
            संत भक्त हे सोयरे | {"\n"}नाम गहन सत्य सारे || ५ ||{"\n"}
            तुकाविप्र भाव ऐसा | {"\n"}ठेवा तुम्ही भरवसा || ६ ||{"\n"}{"\n"}

            नामदेव भाक बळी ।{"\n"}प्रेम कली कीर्तन || १ ||{"\n"}
            शत सेवट कोटीचा।{"\n"}कीर्तनाचा प्रसंग || २ ||{"\n"}
            विप्रवर्या सत्यव्रता ।{"\n"}अवधुता सद्गुरु || ३ || {"\n"}
            विनवणी परिसली ।{"\n"}फळा आली प्रसाद || ४ || {"\n"}
            तुकाविप्र म्हणे कोट ।{"\n"}हा शेवट शताचा || ५ ||{"\n"}{"\n"}

            पराक्रमी किती |  अवतार नामा |{"\n"}आगळा महिमा | नामयाचा || १ ||{"\n"}
            नामदेवे कृपा | तुकयासी केली | {"\n"}वैकुंठासी नेली | त्याची तनु || २ ||{"\n"}
            देही असोनीया | बहु केली काजे | {"\n"}सहजी  सहजे | नामयाने || ३ || {"\n"}
            तुकाविप्र म्हणे | देह गेल्यावरी ।{"\n"}कृपा केली खरी | तुकोबासी || ४ ||{"\n"}{"\n"}

            प्रथम कलीत नामदेवा ऐसा | {"\n"}उद्धरिला कैसा कुटुंबेसी || १ ||{"\n"}
            दामासेटी बाप गोणाबाई माता | {"\n"}सणकादी भक्ता ऐसे केले || २ ||{"\n"}
            उपमन्ये ध्रूव प्रल्हादा समान | {"\n"}बाळा दिला मान नामयाचा || ३ ||{"\n"}
            तुकाविप्र म्हणे ऐसे किती भक्त | {"\n"}विठ्ठले विख्यात उद्धरिले || ४ ||{"\n"}{"\n"}

            प्रतीपाळावया | विष्णु हाची  देव ।{"\n"}नाही समभाव | तया पाशी || १ ||{"\n"}
            विरक्ता तारितो | आसक्ता मारितो ।{"\n"}अधोगती देतो | तयाना तो || २ || {"\n"}
            भेदभाव आहे | त्याजपासी आला ।{"\n"}कळो हे  आम्हाला | ऐसा गुण || ३ ||{"\n"}
            स्व रक्षणा करी |  सीव नाम स्मरण ।{"\n"}नामची प्रमाण | तरावया || ४ ||{"\n"}
            तुकाविप्र म्हणे | नामाची कारण | {"\n"}आव्यक्त प्रमाण | तरावया || ५ ||{"\n"}{"\n"}

            परब्रम्ह व्याले ॐकार उद्भव | {"\n"}म्हणताती देव आदिनाम || १ ||{"\n"}
            नामदेव नामा नाही यात भेद | {"\n"}अभंग आनंद स्वरूपीया || २ ||{"\n"}
            ॐकार हा व्यक्त नामा व्यक्ताव्यक्त | {"\n"}अनुपम भक्त नामदेव || ३ ||{"\n"}
            तुकाविप्र म्हणे नामा गुणातीत | {"\n"}प्रकृती अतित सर्वकाळ || ४ ||{"\n"}{"\n"}

            युगायुगीचा हा | नामा भक्त भोळा | {"\n"}उदास मोकळा | ब्रह्मनिष्ठ || १ ||{"\n"}
            भक्ता माजी बळी | नामा सर्वगुणे | {"\n"}आगळे करणे | नामयाचे   || २ ||{"\n"}
            देवाचा अत्यंत | आवडता नामा | {"\n"}सत्य केली सीमा | नामदेवे || ३ || {"\n"}
            तुकाविप्र म्हणे | नामा मूर्तिमंत | {"\n"}भेटताहे तुर्त | भाविकासी || ४ ||{"\n"}{"\n"}

            शतकोटी ग्रंथ | छप्पन्न या भाषा ।{"\n"}वदला तो कैशा  | नामदेव || १ ||{"\n"}
            जैसा जो भेटला | तयासी बोलीले ।{"\n"}भाषेने शोभले | तया तया || २ ||{"\n"}
            नाही उणे कोठे | अक्षर व्यंजन ।{"\n"}अभंग कीर्तन | नित्यावळी || ३ ||{"\n"}
            तुकाविप्र म्हणे | नामदेव खरा ।{"\n"}भक्त-राज तुरा | कलयुगी || ४ ||{"\n"}{"\n"}

            शतकोटी ऐसा  | ग्रंथ केला  सिद्ध |{"\n"}त्रिजगी प्रसिद्ध | नामयाने || १ ||{"\n"}
            नामा तुका विप्र | द्रष्ट्रे हे साचार ।{"\n"}तिघांचा ओंकार | येक नामा || २ || {"\n"}
            आदि मधी अंती |  सर्वव्यापी नामा | {"\n"}शारदा महिमा | ना शके वर्णु || ३ || {"\n"}
            तुकाविप्र युग्म |  कृष्णराधा जैसे ।{"\n"}विठू नामा तैसे |  शोभीवंत || ४ ||{"\n"}{"\n"}

            शतकोटी वेदातील ।{"\n"}नामया संत विठ्ठल || १ ||{"\n"}
            महावाक्य हे प्रसिद्ध | {"\n"}प्रमाण सद्गुरु बोध || २ ||{"\n"}
            देवभक्त दोहोपणे ।{"\n"}विठल नामा शोभणे || ३ ||{"\n"}
            तुकाविप्र म्हणे बोध।{"\n"}अद्वैत प्रमाण सिद्ध || ४ ||{"\n"}{"\n"}

            शतकोटी ऋचेतील | {"\n"}संत नामदेव विठ्ठल || १ ||{"\n"}
            माहावाक्ये हे प्रसिद्ध | {"\n"}प्रमाण सद्गुरू बोध || २ ||{"\n"}
            नाम नामी नामा येक | {"\n"}जाणताती हे भावीक || ३ ||{"\n"}
            तुकाविप्र भाव सत्य | {"\n"}फळ जीव शीव ऐक्य || ४ ||{"\n"}{"\n"}

            सर्व गजामध्ये | जैसा ऐरावत ।{"\n"}भक्ताचिया पंक्ती | नामा तैसा || १ ||{"\n"}
            चिंतामणी जैसा | सर्व पाषाणांत ।{"\n"}तैसा येक भक्त | नामदेव || २ || {"\n"}
            रागात भैरव । पक्षात गरुड ।{"\n"}नामया उघड | भक्त तैसा || ३ ||{"\n"}
            धनवंता मध्ये |  जैसला कुबेर ।{"\n"}म्हणे तुकाविप्र | नामा तैसा || ४ ||
          </Text>
        </View>
      </ScrollView>
    </LinearGradient>
  )
}

export default Santanna

const styles = StyleSheet.create({
  container: {
    flex: 1,
    backgroundColor: '#faf9f6',
    padding: 16,
  },
  scrollContent: {
    alignItems: 'center',
    paddingBottom: 30
  },
  card: {
    backgroundColor: "#FFFFFF",
    borderRadius: 12,
    elevation: 5,
    shadowColor: "#000",
    shadowOpacity: 0.15,
    shadowOffset: { width: 0, height: 2 },
    shadowRadius: 5,
    padding: 15
  },
  text: {
    fontFamily: 'VesperLibre-Bold',
    fontSize: 18,
    lineHeight: 26,
    color: '#3a2b1e',
  }
})